[{"text": ["Improving Python readability?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've been really enjoying Python programming lately.", "I come from a background of a strong love for C-based coding, where everything is perhaps more complicated than it should be (but puts hair on your chest, at least).", "So switching from C to Python for more complex things that don't require tons of speed has been more of a boon than a bane in writing projects."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["However, coming from this land of brackets and parentheses and structs as far as the naked eye can see, I come across a small problem: I find Python difficult to read."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For example, the following block of text is hard for me to decipher unless I stare at it (which I dislike doing):"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n if foo:\n   bar = baz\n   while bar not biz:\n      bar = i_am_going_to_find_you_biz_i_swear_on_my_life()\n\ndid_i_not_warn_you_biz()\nmy_father_is_avenged()\n</code>\n</pre>\n", "senID": 4}, {"text": ["The problem occurs at the end of that if block: all the tabbing and then suddenly returning to a jarring block feels almost disturbing.", "As a solution, I've started coding my Python like this:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n if foo:\n   bar = baz\n   while bar not biz:\n      bar = i_am_going_to_find_you_biz_i_swear_on_my_life()\n   #-- while --\n#-- if --\n\ndid_i_not_warn_you_biz()\nmy_father_is_avenged()\n</code>\n</pre>\n", "senID": 6}, {"text": ["And this, for some odd reason, makes me more able to read my own code.", "But I'm curious: has anyone else with my strange problem found easier ways to make their tabbed-out code more readable?", "I'd love to find out if there's a better way to do this before this becomes a huge habit for me."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]