[{"text": ["Managing Items in an Object Oriented game"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Every once in a while I like to take a break from my other projects to try to make a classic adventure text-based-game (in Python, this time) as a fun project, but I always have design issues implementing the item system. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'd like for the items in the game to descend from one base Item class, containing some attributes that every item has, such as damage and weight.", "My problems begin when I try to add some functionality to these items.", "When an item's damage gets past a threshold, it should be destroyed.", "And there lies my problem: I don't really know how to accomplish that."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Item", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Since del self won't work for a million different reasons, (Edit: I am intentionally providing the use of 'del' as something that I know is wrong.", "I know what garbage collection is, and how it is not what I want.", ") how should I do this (And other similar tasks)?", "Should each item contain some kind of reference to it's container (The player, I guess) and 'ask' for itself to be deleted? "], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "del self", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "(Edit: I am intentionally providing the use of 'del' as something that I know is wrong. I know what garbage collection is, and how it is not what I want.)", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["The first thing that comes to mind is a big dictionary containing every item in the game, and each object would have a reference to this list, and both have and know it's own unique ID.", "I don't like this solution at all and I don't think that it's the right way to go at all.", "Does anybody have any suggestions?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["EDIT: I'm seeing a lot of people thinking that I'm worried about garbage collection.", "What I'm talking about is not garbage collection, but actually removing the object from gameplay.", "I'm not sure about what objects should initiate the removal, etc. "], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "EDIT:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}]