[{"text": ["Newbie teaching self python, what else should I be learning?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm a newbie to programming.", "I had 1 semester of computer science (we used java).", "I got an A in the course and was able to do everything assigned, however I'm not sure I really understood it.", "I ignored the text and learned by looking at sample programs and then trial and error.", "I was ahead of the class except for two guys who came in knowing java or another OOP language."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'd like to learn Python.", "I'm also going to build a second PC from extra parts I have and use linux.", "Basically, I want to enhance my knowledge of computers.", "Thats my motivation."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Now on learning python are there any good programming theory books that would be useful?", "Or should I read up on more on how computers operate on the lowest levels?", "I don't think I know enough to ask the question I want. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I guess to make it simple, I am asking what should I know to make the most of learning python.", "This is not for a career.", "This is from a desire to know.", "I am no longer a computer science major (it also would not have any direct applications to my anticipated career."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I'm not looking to learn in \"30 days\" or \"1 week\" or whatever.", "So, starting from a very basic level is fine with me. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Thanks in advance.", "I did a search and didn't quite find what I was looking for. "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["UPDATE: Thanks for all the great advice.", "I found this site at work and couldn't find it on my home computer, so I am just getting to read now. "], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]