[{"text": ["Can you recommend a database schema migration tool that is not tied to a particular framework or ORM?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've used South migrations in the past, but am now looking for a database migration tool that is not tied to a particular framework or Object Relational Mapper (South is for Django).", "I need it simply for managing schema updates (and rollbacks) and nothing else.", "Various tools and applications use the same database, so I'd like a dedicated tool to manage the schema and not have it integrated with the ORM of one particular web-application that might use the shared DB."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "South migrations", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://south.aeracode.org/"}]}, {"text": ["Edit: To clarify, I don't need a tool that reads changes to models in an app and generates the schema updates for me.", "I want a tool that uses migrations and applies updates and rollbacks on request, but where I explicitly write the update and rollback actions myself.", "Basically a better managed, and slightly abstracted version of sourceing .sql scripts to do schema upgrades."], "childNum": 4, "tag": "p", "senID": 2, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "don't", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "source", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": ".sql", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Preferably Python-based, as that is what the team is familiar with, the tool needs to work with MySQL but would hopefully also have some abstraction for other RDBMS backends."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Obviously I could find a few myself, but I'd like to harness the experience of the community here to shortcut the process a little by gathering some \"reviews\" from personal experience using the tools in real world scenarios:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "What are the good things about the solution?", "tag": "none", "senID": 5}, {"text": "What are the pitfalls and problems you've encountered with it?", "tag": "none", "senID": 6}, {"text": "Is it actively developed, does it have a good community, support etc?", "tag": "none", "senID": 7}]}, {"text": ["So far I've found yoyo-migrations which looks promising, but no info from anyone using it."], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "yoyo-migrations", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pypi.python.org/pypi/yoyo-migrations/4.1.0"}]}]