[{"text": ["Django, Turbo Gears, Web2Py, which is better for what?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I got a project in mind that makes it worth to finally take the plunge into programming."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["After reading a lot of stuff, here and elsewhere, I'm set on making Python the one I learn for now, over C# or java.", "What convinced me the most was actually Paul Graham's excursions on programming languages and Lisp, though Arc is in the experimental stage, which wouldn't help me do this web app right now."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["As for web app fast, I've checked out Django, Turbo Gears and Py2Web.", "In spite of spending a lot of time reading, I still have no clue which one I should use."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["1)  Django certainly has the nicest online presence, and a nicely done onsite tutorial, they sure know how to show off their thing."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "1)  Django", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["2)  Web2Py attracted me with its no-install-needed and the claim of making Django look complicated.", "But when you dig around on their website, you quickly find content that hasn't been updated in years with broken external links...", "There's ghosts on that website that make someone not intimately familiar with the project worry if it might be flatlining."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "2)  Web2Py", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["3)  Turbo Gears  ...I guess its modular too.", "People who wrote about it loved it...", "I couldn't find anything specific that might make it special over Django.  "], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "3)  Turbo Gears", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I haven't decided on an IDE yet, though I read all the answers to the Intellisense code completion post here.", "Showing extra code snippets would be cool too for noobs like me, but I suppose I should choose my web frame work first and then pick an editor that will work well with it."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Since probably no framework is hands down the best at everything, I will give some specifics on the app I want to build:"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["It will use MySQL, it needs register/sign-in, and there will be a load of simple math operations on data from input and SQL queries.", "I've completed a functional prototype in Excel, so I know exactly what I want to build, which I hope will help me overcome my noobness.", "I'll be a small app, nothing big."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["And I don't want to see any HTML while building it ;-) "], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["PS: thanks to the people running Stackoverflow, found this place just at the right moment too!"], "childNum": 0, "tag": "p", "senID": 11, "childList": []}]