[{"text": ["PyObjc and Cocoa on Snow Leopard"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I am about to start my A-Level Computing project (High School Level) which will hopefully be a  point-of-sale application for Mac OS.", "Unfortunately, Objective-C is a little out of my league at the moment and should I get stuck with it in the project I have no one to help out so I would fail the section of the course and not get into University.", "So this is quite important to me."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I want to use Python to develop a Cocoa app.", "I know that I need PyObjc, however all details on the net seem to assume it is pre-installed.", "Apparently this is the case with Leopard and Snow Leopard but I don't seem to have it on Snow Leopard and never noticed it on Leopard.", "Also, I have tried installing the latest beta of PyObjc by following the instructions on the Sourceforge page, but with no luck."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I would really appreciate it if anyone could shed some light on what needs to be installed, how, and links to any resources or tutorials that could help me."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Thanks in advance for the help!"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Update: I see that this is a popular question, I just got the 'Notable Question' badge for it so I thought I would update anyone coming to this page on what I did after getting the answers."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Update:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Unfortunately, I wasn't able to use Python to create a Mac application.", "This was rather disappointing at the time, but probably a good thing.", "I made a Windows app in C# for my project, it was a tool for creating and running Assembly apps in a simulated environment.", "My course teacher has now started to use my tool to teach the course instead of his own!", "I got a very high score on the computing project (over 90%) and this contributed to me getting an A* in my computing A-Level (the highest grade available) and I consequently got in to Southampton University to study Computer Science. "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["This summer, I decided to make an iPad app (soon to be released) and I am glad to say that I know think I could make a Mac OS application in Objective-C as I feel I have learnt enough.", "I am glad that I took the time to learn it, it is a great language and really useful with iOS becoming so popular."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Sorry for all the boasting, but I am really happy about it.", "What I really want to say is, if you are coming to this page hoping to use PyObjc to create Mac apps easily, don't bother.", "It takes some time and some effort, but once you have learnt Objective-C, it is really satisfying to create apps with it.", "Good Luck!"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}]