[{"text": ["Python IDE for teaching?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I am a student in a year 11 Computer Science class.", "Previously having taught only Visual Basic, my teacher is looking for a language and IDE to teach the class with that is cross-platform and is easy to learn, so I suggested Python to him for the language."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["However, he would also like to teach with an IDE with it that includes a form builder in addition to the typical functions of an IDE (editor, project management, code completion, debugging, etc.).", "Having only ever developed with a text editor (usually nano) and a relevant compiler, I know next to nothing about IDEs and what would be good to use."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "nano", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["I've also realised that Python has bindings for a multitude of graphical toolkits, of which one is probably chosen for use 'behind-the-scenes' in each IDE's form builder, so that is certainly another thing to consider."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Could anyone suggest a free, open source IDE for Python that would fit my class' needs, and would be able to run on Windows, Mac OS X and Linux-based operating systems at least?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["--"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["For those who recommend that plain console programming is the best start for beginners, I agree!", "If I were the teacher, I'd direct my students straight over to the Python console that is already installed on the computers and start teaching some programming not tainted by the issues of GUI programming.", "However, I would still like to find an IDE for him in case he says that he has to follow the curriculum strictly and needs to teach GUI programming with an IDE/form builder."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]