[{"text": ["What classes of applications or problems do you prefer Python to strictly OO Languages?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've got a pretty strong background in C-style languages.", "And have worked on several different types of projects.", "I have just started taking a serious look at Python after reading Programming Collective Intelligence.", "I understand that Python can solve any problem that C# can, and vice-versa.", "But I am curious to know from those who use both regularly, when they choose one over the other.", "Removing other factors, like coworkers experience, etc.  "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Programming Collective Intelligence", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9780596529321/"}]}, {"text": ["When do you choose to create an application in Python instead of a static typed, purely OO language like C# or Java?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Edit:"], "childNum": 0, "tag": "h2", "senID": 3, "childList": []}, {"text": ["I was afraid we were going to get off topic a bit with this question.", "Python is an object oriented language.", "But, as is stated below it may not be the preferred language when your application will have a very heavy business domain, etc.", "I am aware that Python uses objects extensively, and that even functions are objects, something that is not true in all of the \"OO\" languages I brought up earlier.  "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Despite my poor choice of words in the question (almost no languages fit nicely into two or three word descriptions, and it is really difficult to point out differences in languages without it appearing that you are talking down to a certain class of developer.", "), I am still very interested in what you have to say about when you prefer Python to other languages."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]