[{"text": ["I need a really good reason to use Python"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I have been trying to make a case for using Python at my work.", "We use C# and ASP.NET for basically all of our development.", "80% or more of our projects are web applications.", "It seems natural that we would look at some of the nice dynamic web languages (Ruby, Python, etc), and with things like IronRuby and IronPython, I started seriously investigating."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "IronRuby", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Ironruby"}, {"href": "http://en.wikipedia.org/wiki/Ironpython", "text": "IronPython", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["I love Python.", "It's a beautiful, expressive language.", "It's a joy to code in, for sure.", "The multitude of python modules and frameworks make it very appealing.", "Problem is, I cannot think of any specific problems, any specific hurdles that would require a language like Python.", "ASP.NET gives us RAD, it gives us a full-featured framework and all that good stuff.", "Also, we all already know C# and have lots of projects in C#, learning a new language just because doesn't quite work. "], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "require", "childNum": 0, "tag": "b", "pos": 4, "childList": []}, {"text": "because", "childNum": 0, "tag": "i", "pos": 6, "childList": []}]}, {"text": ["Can you guys help me think of something to finally convince my boss to really learn Python and start using it on projects?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Edit: I know that no problem requires only one language, I just meant, are there any specific problems in which dynamic languages excel over static languages."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit again: Let me also mention that my boss prompted ME to investigate this.", "He has put aside hours to research these languages, find a good one, learn it, and then figure out how we can use it.", "I'm at the last step here, I do not need a lecture on why I should consider my motivation for changing something my company does because they do it for a reason. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]