[{"text": ["How to speed up this Python code?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've got the following tiny Python method that is by far the performance hotspot (according to my profiler, >95% of execution time is spent here) in a much larger program:"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "by far", "childNum": 1, "tag": "strong", "pos": 0, "childList": [{"text": "by far", "tag": "em"}]}, {"text": "by far", "childNum": 0, "tag": "em", "childList": []}]}, {"code": "<pre>\n<code>\n def topScore(self, seq):\n    ret = -1e9999\n    logProbs = self.logProbs  # save indirection\n    l = len(logProbs)\n    for i in xrange(len(seq) - l + 1):\n        score = 0.0\n        for j in xrange(l):\n            score += logProbs[j][seq[j + i]]\n        ret = max(ret, score)\n\n    return ret\n</code>\n</pre>\n", "senID": 2}, {"text": ["The code is being run in the Jython implementation of Python, not CPython, if that matters.", "seq is a DNA sequence string, on the order of 1,000 elements.", "logProbs is a list of dictionaries, one for each position.", "The goal is to find the maximum score of any length l (on the order of 10-20 elements) subsequence of seq."], "childNum": 4, "tag": "p", "senID": 3, "childList": [{"text": "seq", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "logProbs", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "l", "childNum": 0, "tag": "code", "pos": 3, "childList": []}, {"text": "seq", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["I realize all this looping is inefficient due to interpretation overhead and would be a heck of a lot faster in a statically compiled/JIT'd language.", "However, I'm not willing to switch languages.", "First, I need a JVM language for the libraries I'm using, and this kind of constrains my choices.", "Secondly, I don't want to translate this code wholesale into a lower-level JVM language.", "However, I'm willing to rewrite this hotspot in something else if necessary, though I have no clue how to interface it or what the overhead would be."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["In addition to the single-threaded slowness of this method, I also can't get the program to scale much past 4 CPUs in terms of parallelization.", "Given that it spends almost all its time in the 10-line hotspot I've posted, I can't figure out what the bottleneck could be here."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]