[{"text": ["How do I install MySQL and the python MySql package on OSX Leopard?", "Or how do I learn about being a web developer using OSX?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm new to the Mac OS and I'm just about ready to throw my brand new MacBook pro out the window.", "Every tutorial on setting up a Django development environment on Leopard is insidiously wrong.", "They are all skipping over one step, or assuming you have setup something one way, or are just assuming that I know one thing that I must not."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'm very familiar with how to setup the environment on Ubuntu/Linux, and the only part I'm getting stuck on with OSX is how to install MySQL, autostart it, and install the python mysql bindings.", "I think my mistake was using a hodgepodge of tools I don't fully understand, I used fink to install MySQL and its dev libraries and then tried to build the Python-mysql bindings from source (but they won't build."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["UPDATE:\nI installed the Binary MySQL package from: http://dev.mysql.com/downloads/mysql/5.1.html#macosx-dmg and I got MySQL server running (can access with admin.", ")\nThe MySQL version I got from port was rubbish, I could not get it to run at all."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://dev.mysql.com/downloads/mysql/5.1.html#macosx-dmg", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://dev.mysql.com/downloads/mysql/5.1.html#macosx-dmg"}]}, {"text": ["I modified the source for the Python-MySQL package as per the answer I chose, but I still got compilation errors that I listed in the comments.", "I was able to fix these by adding /usr/local/mysql/bin/ to my path in my \"~/.profile\" file.", "\"\nPATH=/usr/local/mysql/bin:$PATH\n\""], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Thanks for the help, I was very wary about editing the source code since this operation had been so easy on Ubuntu, but I'll be more willing to try that in the future.", "I'm really missing Ubuntu's \"apt-get\" command, it makes life very easy and simple sometimes.", "I already have an Ubuntu VMWare image running on my MAC, so I can always use that as a fallback (plus it more closely matches my production machines so should be a good test environment for debugging production problems."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]