[{"text": ["Library or tool to download multiple files in parallell"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm looking for a python library or a command line tool for downloading multiple files in parallell.", "My current solution is to download the files sequentially which is slow.", "I know you can easily write a half-assed threaded solution in python, but I always run into annoying problem when using threading.", "It is for polling a large number of xml feeds from websites."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["My requirements for the solution are:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Please don't suggest how I may go about implementing the above requirements.", "I'm looking for a ready-made, battle-tested solution."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Please", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I guess I should describe what I want it for too...", "I have about 300 different data feeds as xml formatted files served from 50 data providers.", "Each file is between 100kb and 5mb in size.", "I need to poll them frequently (as in once every few minutes) to determine if any of them has new data I need to process.", "So it is important that the downloader uses http caching to minimize the amount of data to fetch.", "It also uses gzip compression obviously. "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Then the big problem is how to use the bandwidth in an as efficient manner as possible without overstepping any boundaries.", "For example, one data provider may consider it abuse if you open 20 simultaneous connections to their data feeds.", "Instead it may be better to use one or two connections that are reused for multiple files.", "Or your own connection may be limited in strange ways.. My isp limits the number of dns lookups you can do so some kind of dns caching would be nice. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]