[{"text": ["Elegant structured text file parsing"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I need to parse a transcript of a live chat conversation.", "My first thought on seeing the file was to throw regular expressions at the problem but I was wondering what other approaches people have used. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I put elegant in the title as i've previously found that this type of task has a danger of getting hard to maintain just relying on regular expressions."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The transcripts are being generated by www.providesupport.com and emailed to an account, I then extract a plain text transcript attachment from the email."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The reason for parsing the file is to extract the conversation text for later but also to identify visitors and operators names so that the information can be made available via a CRM."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Here is an example of a transcript file:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n Chat Transcript\n\nVisitor: Random Website Visitor \nOperator: Milton\nCompany: Initech\nStarted: 16 Oct 2008 9:13:58\nFinished: 16 Oct 2008 9:45:44\n\nRandom Website Visitor: Where do i get the cover sheet for the TPS report?\n* There are no operators available at the moment. If you would like to leave a message, please type it in the input field below and click \"Send\" button\n* Call accepted by operator Milton. Currently in room: Milton, Random Website Visitor.\nMilton: Y-- Excuse me. You-- I believe you have my stapler?\nRandom Website Visitor: I really just need the cover sheet, okay?\nMilton: it's not okay because if they take my stapler then I'll, I'll, I'll set the building on fire...\nRandom Website Visitor: oh i found it, thanks anyway.\n* Random Website Visitor is now off-line and may not reply. Currently in room: Milton.\nMilton: Well, Ok. But… that's the last straw.\n* Milton has left the conversation. Currently in room:  room is empty.\n\nVisitor Details\n---------------\nYour Name: Random Website Visitor\nYour Question: Where do i get the cover sheet for the TPS report?\nIP Address: 255.255.255.255\nHost Name: 255.255.255.255\nReferrer: Unknown\nBrowser/OS: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 5.2; .NET CLR 1.1.4322; InfoPath.1; .NET CLR 2.0.50727)\n</code>\n</pre>\n", "senID": 6}]