[{"text": ["Why are scripting languages (e.g.", "Perl, Python, Ruby) not suitable as shell languages?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["What are the differences between shell languages like bash, zsh, fish and the scripting languages above that makes them more suitable for the shell?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["When using the command line the shell languages seem to be much easier.", "It feels for me much smoother to use bash for example than to use the shell profile in ipython, despite reports to the contrary.", "I think most wil agree with me that a large portion of medium to large scale programming is easier in Python than in bash.", "I use Python as the language I am most familiar with, the same goes for Perl and Ruby."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "despite reports to the contrary", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://transneptune.net/2009/06/16/ipython-as-your-default-shell/"}]}, {"text": ["I have tried to articulate the reason but am unable to, aside from assuming that the treatment of strings differently in both has something to do with it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The reason of this question is that I am hoping to develop a language usable in both.", "If you know of such a language, please post it as well."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit: As S.Lott explains, the question needs some clarification.", "I am asking about the features of the shell language versus that of scripting languages.", "So the comparison is not about the characteristics of various interactive (REPL) environments such as history and command line substitution.", "An alternative expression for the question would be:"], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "Edit", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "language", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Can a programming language that is suitable for design of complex systems be at the same time able to express useful one-liners that can access the file system or control jobs?", "Can a programming language usefully scale up as well as scale down?"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]