[{"text": ["What is the best way to install python 2 on OS X?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["A colleague of mine wants to use my python 2 code on his OS X (10.6) machine.", "My code imports several built-in python packages, including Tkinter and shelve, and also uses third-party packages, including numpy, scipy, matplotlib, and ipython."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I've encountered a few problems with OS X's built-in python.", "(IDLE doesn't work, for example*).", "I suspect I should install a more recent version of python, and a different version of Tk."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "more recent version of python", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.python.org/download/releases/2.7.1/"}, {"href": "http://www.python.org/download/mac/tcltk/", "text": "different version of Tk", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["My questions:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If this process goes well, I'd consider adding OS X instructions to my code's documentation, so I'd like to boil down this process to the simplest, most general approach."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["*EDIT: Also, this"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "this", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/q/4765226/513688"}]}, {"text": ["EDIT: Thank you everyone for the useful answers.", "My colleague tried MacPorts, which seems to work well, but has a few speedbumps.", "First we had to install Xcode from the system install disk.", "This is not a fast or lightweight install (several GB).", "Luckily we still had the disk!", "Once Xcode was installed, MacPorts was easy to install.", "Python and the python subpackages we needed were also easy to install, but he told me this installation took several hours.", "Presumably this delay is due to compilation?", "He had an easy time setting the MacPorts python as default.", "However, I think we have to change the 'Python Launcher' application by hand, this seems to still default to the system python."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Even though he has a working system now, I'm tempted to ask him to try one of the other solutions.", "I'm not sure all of my code's potential users will tolerate a multi-hour, multi-gigabyte installation."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]