[{"text": ["Input from 20+ microphones"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've been asked (if it's possible) to write a program monitoring the input of at least 20 microphones, on a single computer."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Currently I'm prototyping in python (2.6), on a Ubuntu system using Alsa.", "My attempts so far have created quite a few questions..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Ubuntu is a requirement, Alsa isn't, and python is an ideal."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["For hardware, one suggestion is multiple sound cards.", "The other is a series of usb hubs and microphone adaptors (like these) (In which case the devices would all be identical and on the same USB bus)"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "these", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.aliexpress.com/product-fm/311098204-Headset-Adapter-100pcs-lot-USB-3d-Audio-Sound-Card-Microphone-wholesalers.html"}]}, {"text": ["Questions:"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Questions:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["How can I simultaneously record multiple microphones from a single sound card?", "(e.g.", "using line-in as well as mic, bonus for anyone who know how I can use more than just two inputs!"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["In the USB setup, how can I identify which position a sound card (usb adapter) in plugged in \nto a USB hub (or chain of USB hubs)."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["If a solution is raw access to the microphones via USB, is a devices position on a usb bus depend only on which port on a USB hub they are plugged into, or do could it change between powering the computer on and off?"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Last, if using raw access, how do I best get the data (no current experience with pyUSB) and what conversion (if any) is required from raw -> audio?"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["Edit:"], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["By monitor, I've been asked to record input to disk (ideally above a set threshold, which the speex codec looks ideal for), monitor volume levels, provide graphic feedback and set up at least one output that cycles through all active microphones."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["Python isn't a long term requirement, just the easiest way I've found so far to get the PCM data from a sound card (microphone only however)"], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["I am intending to have the polling of the soundcards and data processing take place in separate threads, an area that I haven't got much experience with."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["Where would I find more information on implementing a USB audio class driver?"], "childNum": 0, "tag": "p", "senID": 14, "childList": []}]