[{"text": ["\"self\" inside plain function?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've got a bunch of functions (outside of any class) where I've set attributes on them, like funcname.fields = 'xxx'.", "I was hoping I could then access these variables from inside the function with self.fields, but of course it tells me:"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "funcname.fields = 'xxx'", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "self.fields", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["So... what can I do?", "Is there some magic variable I can access?", "Like __this__.fields?"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "__this__.fields", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["A few people have asked \"why?\".", "You will probably disagree with my reasoning, but I have a set of functions that all must share the same signature (accept only one argument).", "For the most part, this one argument is enough to do the required computation.", "However, in a few limited cases, some additional information is needed.", "Rather than forcing every function to accept a long list of mostly unused variables, I've decided to just set them on the function so that they can easily be ignored. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Although, it occurs to me now that you could just use **kwargs as the last argument if you don't care about the additional args.", "Oh well..."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "**kwargs", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Edit: Actually, some of the functions I didn't write, and would rather not modify to accept the extra args.", "By \"passing in\" the additional args as attributes, my code can work both with my custom functions that take advantage of the extra args, and with third party code that don't require the extra args."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Thanks for the speedy answers :)"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]