[{"text": ["Writing a socket-based server in Python, recommended strategies?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I was recently reading this document which lists a number of strategies that could be employed to implement a socket server.", "Namely, they are:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "this document", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.kegel.com/c10k.html"}]}, {"text": ["Now, I would appreciate a hint on which should be used in CPython, which we know has some good points, and some bad points.", "I am mostly interested in performance under high concurrency, and yes a number of the current implementations are too slow."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "in CPython", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["So if I may start with the easy one, \"5\" is out, as I am not going to be hacking anything into the kernel."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["\"4\" Also looks like it must be out because of the GIL.", "Of course, you could use multiprocessing in place of threads here, and that does give a significant boost.", "Blocking IO also has the advantage of being easier to understand."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["And here my knowledge wanes a bit:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["\"1\" is traditional select or poll which could be trivially combined with multiprocessing."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["\"2\" is the readiness-change notification, used by the newer epoll and kqueue"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["\"3\" I am not sure there are any kernel implementations for this that have Python wrappers."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["So, in Python we have a bag of great tools like Twisted.", "Perhaps they are a better approach, though I have benchmarked Twisted and found it too slow on a multiple processor machine.", "Perhaps having 4 twisteds with a load balancer might do it, I don't know.", "Any advice would be appreciated."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]