[{"text": ["Recommended data format for describing the rules of chess"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm going to be writing a chess server and one or more clients for chess and I want to describe the rules of chess (e.g.", "allowable moves based on game state, rules for when a game is complete) in a programming language independant way.", "This is a bit tricky since some of the chess rules (e.g.", "King Castling, en passent, draws based on 3 or more repeated moves) are based not only on the board layout but also on the history of moves."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I would prefer the format to be:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "textual", "tag": "none", "senID": 3}, {"text": "human readable", "tag": "none", "senID": 4}, {"text": "based on a standard (e.g. YAML, XML)", "tag": "none", "senID": 5}, {"text": "easily parsable in a variety of languages", "tag": "none", "senID": 6}]}, {"text": ["But I am willing to sacrifice any of these for a suitable solution."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["My main question is: How can I build algorithms of such a complexity that operate on such complex state from a data format?"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["A followup queston is: Can you provide an example of a similar problem solved in a similar manner that can act as a starting point?"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["Edit: In response to a request for clarity -- consider that I will have a server written in Python, one client written in C# and another client written in Java.", "I would like to avoid specifying the rules (e.g.", "for allowable piece movement, circumstances for check, etc.", ") in each place.", "I would prefer to specify these rules once in a language independant manner."], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}]