[{"text": ["Learning Ruby on Rails any good for Grails?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["My company is in the process of starting down the Grails path.", "The reason for that is that the current developers are heavy on Java but felt the need for a MVC-style language for some future web development projects.", "Personally, I'm coming from the design/usability world, but as I take more \"front-end\" responsibilities I'm starting to feel the need for learning a language more intensively so I can code some logic but especially the front-end code for my UIs and stuff."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I've been trying to get into Python/Django personally, but just never invested too much time on it.", "Now that my company is \"jumping\" into Grails I bought the \"Agile Web Development with Rails (3rd Ed - Beta)\" and I'm starting to get into RoR.", "I'd still like to learn Python in the future or on the side, but my biggest question is: "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": "Should I be learning RoR, and have a more versatile language in my \"portfolio\", knowing that my RoR knowledge will be useful for my Grails needs as well??", "tag": "none", "senID": 3}]}, {"text": ["-OR-"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": "Should I just skip RoR and focus on learning Grails that I'll be needing for work soon, and work on learning RoR/Django (Ruby/Python) later?", "tag": "none", "senID": 5}]}, {"text": ["Basically the question revolves around the usefulness of Grails in a non-corporate setting and the similarities between Rails and Grails.", "(and this, while trying to avoid the centennial discussion of Python vs Ruby (on Rails) :) hehe)"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Thanks in advance folks!", ":)"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]