[{"text": ["how to generate all possible combinations of a 14x10 matrix containing only 1's and 0's"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm working on a problem and one solution would require an input of every 14x10 matrix that is possible to be made up of 1's and 0's... how can I generate these so that I can input every possible 14x10 matrix into another function?", "Thank you! "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Added March 21: It looks like I didn't word my post appropriately.", "Sorry.", "What I'm trying to do is optimize the output of 10 different production units (given different speeds and amounts of downtime) for several scenarios.", "My goal is to place blocks of downtime to minimized the differences in production on a day-to-day basis.", "The amount of downtime and frequency each unit is allowed is given.", "I am currently trying to evaluate a three week cycle, meaning every three weeks each production unit is taken down for a given amount of hours.", "I was asking the computer to determine the order the units would be taken down based on the constraint that the lines come down only once every 3 weeks and the difference in daily production is the smallest possible.", "My first approach was to use Excel (as I tried to describe above) and it didn't work (no suprise there)... where 1- running, 0- off and when these are summed to calculate production.", "The calculated production is subtracted from a set max daily production.", "Then, these differences were compared going from Mon-Tues, Tues-Wed, etc for a three week time frame and minimized using solver.", "My next approach was to write a Matlab code where the input was a tolerance (set allowed variation day-to-day).", "Is there a program that already does this or an approach to do this easiest?", "It seems simple enough, but I'm still thinking through the different ways to go about this.", "Any insight would be much appreciated. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]