[{"text": ["Which cross platform scripting language should we adopt for a group of DBAs?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I wanted to get the community's feedback on a language choice our team is looking to make in the near future.", "We are a software developer, and I work in a team of Oracle and SQL Server DBAs supporting a cross platform Java application which runs on Oracle Application Server.", "We have SQL Server and Oracle code bases, and support customers on Windows, Solaris and Linux servers."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Many of the tasks we do on a frequent basis are insufficiently automated, and where they are, tend to be much more automated via shell scripts, with little equivalent functionality on Windows.", "Unfortunately, we now have this problem of redeveloping scripts and so on, on two platforms.", "So, I wish for us to choose a cross platform language to script in, instead of using Bash and awkwardly translating to Cygwin or Batch files where necessary."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It would need to be:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["It would be preferable if it would run on the JVM, since this will almost always be installed on every server (certainly on all application servers) and we have many Java developers in our company, so sticking to the JVM makes sense.", "This isn't exclusive though, since I know Python is a very viable language here."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I have created a list of options, but there may be more: Groovy, Scala, Jython, Python, Ruby, Perl. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["No one has much experience of any, except I have quite a lot of Java and Groovy experience myself.", "We are looking for something dynamic, easy to pick up, will work with both SQL server and Oracle effortlessly, has some XML simplifying features, and that won't be a turnoff for DBAs.", "Many of us are very Bash orientated - what could move us away from this addiction?"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["What are people's opinions on this?"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["thanks!"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Chris "], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]