[{"text": ["Does anyone knows any Train-table-api service?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["im wondering if there is any online service who provide API about the train timetables (arrivals, departure, etch..), at least for the european stations."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I know www.bahn.de, who provide the accurated timetables for many european countries, but i didin't find any similar to a api service."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["My goal (well, just a future-project) is to develope an application like gmaps, but instead of giving the car-trip i would like to give the train-trip.. you know, the user set the departure day, time and station, then the first arrival, maybe then add another one, and so on."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "future-project", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["So, there is something like, that can be queryed by php/python/javascript?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit: if can help, im wondering to build a service to plan an inter-rail trip!", "(and any help will be really appreciate)"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Im stuck.", "Google's public-service api rely on the information that every local company makes avaiable, much branches are missing (for example, is almost impossible to use it to build an itinerary that touches two or more regions of Europe.", "As i said before, the only service that i know doing it good is the bahn.de, they really have all the data.. but no api.", "I tryed to parse theyre result page (in order to use them as API), but seem like the markup is been build exactly to avoid that.. maybe they have business plans behind that or whatever, but i dont think they will ever release some API.. so, my project is going on without this function (p.s: my project is about non-profit cultural organizations, we wont make war to anyone ;P)"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["@El Goorf: if you find a way, and consider the idea of sharing it, count on my hand if need help!"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]