[{"text": ["For what reason do we have the lower_case_with_underscores naming convention?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Depending on your interpretation this may or may not be a rhetorical question, but it really baffles me.", "What sense does this convention make?", "I understand naming conventions don't necessarily have to have a rhyme or reason behind them, but why deviate from the already popular camelCase?", "Is there a rhyme and reason behind lower_case_with_underscores that I'm somehow missing?", "(and yes, I have read PEP 8 in its entirety, and yes, I do understand that it's merely a proposal, a guide, etc."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Is there", "childNum": 0, "tag": "em", "pos": 3, "childList": []}, {"text": "lower_case_with_underscores", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["I suppose my real question would be this: I'm writing a Python library.", "In fact, with any luck, it may be a rather large library, relative to my other projects.", "I already try to adhere to PEP 8 as much as possible, and so far I've even maintained lower_case_with_underscores as PEP 8 instructs for function and method names.", "But it bugs me that I have to remember to use camelCase for Twisted, camelCase for logging, and just about everything else.", "What naming convention should I use, and why? "], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "lower_case_with_underscores", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "logging", "childNum": 0, "tag": "code", "pos": 3, "childList": []}, {"text": "What naming convention should I use, and why?", "childNum": 0, "tag": "strong", "pos": 4, "childList": []}]}, {"text": ["It would probably amaze people that I care this much about naming, enough to write a lengthy question about it, and it amazes me, too.", "Perhaps I have a little OCD when it comes to these things.", "I don't have much of a \"personal opinion\" about it as much as I have a tendency to just go for whatever is used the most, which in this case, would be camelCase - but it annoys me even further to find out that I'm probably breaking some eternal laws about explicit vs implicit and the zen of python written in stone or something. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]