[{"text": ["python database / sql programming - where to start"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["What is the best way to use an embedded database, say sqlite in Python:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The usage is not a web app.", "It's a small database to hold at most 5 tables.", "The data in each table is just a few string columns.", "Think something just larger than a pickled dictionary"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "The usage is not a web app.  It's a small database to hold at most 5 tables.  The data in each table is just a few string columns.  Think something just larger than a pickled dictionary", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["Update: Many thanks for the great suggestions.", "The use-case I'm talking about is fairly simple.", "One you'd probably do in a day or two.", "It's a 100ish line Python script that gathers data about a relatively large number of files (say 10k), and creates metadata files about them, and then one large metadata file about the whole files tree.", "I just need to avoid re-processing the files already processed, and create the metadata for the updated files, and update the main metadata file.", "In a way, cache the processed data, and only update it on file updates.", "If the cache is corrupt / unavailable, then simply process the whole tree.", "It might take 20 minutes, but that's okay."], "childNum": 3, "tag": "p", "senID": 3, "childList": [{"text": "Update", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "", "childNum": 0, "tag": "br", "pos": 1, "childList": []}, {"text": "", "childNum": 0, "tag": "br", "pos": 2, "childList": []}]}, {"text": ["Note that all processing is done in-memory."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I would like to avoid any external dependencies, so that the script can easily be put on any system with just a Python installation on it.", "Being Windows, it is sometimes hard to get all the components installed.", "So, In my opinion, even a database might be an overkill.  "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["You probably wouldn't fire up an Office Word/Writer to write a small post it type note, similarly I am reluctant on using something like Django for this use-case."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Where to start?"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]