[{"text": ["What is a best practice method to log visits per page / object"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Take my profile for example, or any question number of views on this site, what is the process of logging the number of visits per page or object on a website, which I presumably think includes:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "my profile", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/users/104071/dassouki"}]}, {"tag": "ul", "num": 4, "lis": [{"text": "Counting registered users once (this must be reflected in the db, which pages / objects the user has visited). this will also not include unregistered users", "tag": "none", "senID": 2}, {"text": "IP: log the visit of each IP per page / object; this could be troublesome as you might have 2 different people checking the same website; or you really do want to track repeat visitors.", "tag": "none", "senID": 3}, {"text": "Cookie: this will probably result in that people with multiple computers would be counted twice", "tag": "none", "senID": 4}, {"text": "other method goes here ....", "tag": "none", "senID": 5}]}, {"text": ["The question is, what is the process and best practice to count user requests?"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["EDIT"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "EDIT", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I've added the computer languages to the list of tags as they are of interest to me.", "Feel free to include any libraries, modules, and/or extensions that achieve the task."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["The question could be rephrased into:"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": "How does someone go about measuring the number of imprints when a user goes on a page? The question is not intended to be similar to what Google analytics does, rather it should be something similar to when you click on a stackoverflow question or profile and see the number of views.", "tag": "none", "senID": 10}]}]