[{"text": ["Help with Python loop weirdness?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm learning Python as my second programming language (my first real one if you don't count HTML/CSS/Javascript).", "I'm trying to build something useful as my first real application - an IRC bot that alerts people via SMS when certain things happen in the channel.", "Per a request by someone, I'm (trying) to build in scheduling preferences where people can choose not to get alerts from between hours X and Y of the day.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Anyways, here's the code I'm having trouble with:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n db = open(\"db.csv\")\nfor line in db:\n            row = line.split(\",\")  # storing stuff in a CSV, reading out of it \n            recipient = row[0]     # who the SMS is going to\n            s = row[1]             # gets the first hour of the \"no alert\" time range\n            f = row[2]             # gets last hour of above\n            nrt = []               # empty array that will store hours\n            curtime = time.strftime(\"%H\")  # current hour\n            if s == \"no\":          \n                    print \"They always want alerts, sending email\"  # start time will = \"no\" if they always want alerts\n                    # send mail code goes here\n            else:\n                    for hour in range(int(s), int(f)): #takes start, end hours, loops through to get hours in between, stores them in the above list \n                            nrt.append(hour)\n                    if curtime in nrt: # best way I could find of doing this, probably a better way, like I said I'm new\n                            print \"They don't want an alert during the current hour, not sending\"  # &lt;== what it says\n                    else:\n                            # they do want an alert during the current hour, send an email\n                            # send mail code here\n</code>\n</pre>\n", "senID": 3}, {"text": ["The only problem I'm having is somehow the script only ends up looping through one of the lines (or something like that) because I only get one result every time, even if I have more than one entry in the CSV file."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]