[{"text": ["Why is it not possible to create a practical Perl to Python source code converter?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["It would be nice if there existed a program that automatically transforms Perl code to Python code, making the resultant Python program as readable and maintainable as the original one, let alone working the same way."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The most obvious solution would just invoke perl via Python utils:"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "perl", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n #!/usr/bin/python\nos.exec(\"tail -n -2 \"+__file__+\" | perl -\")\n...the rest of file is the original perl program...\n</code>\n</pre>\n", "senID": 3}, {"text": ["However, the resultant code is hardly a Python code, it's essentially a Perl code.", "The potential converter should convert Perl constructs and idioms to easy-to-read Python code, it should retain variable and subroutine names (i.e.", "the result should not look obfuscated) and should not shatter the wrokflow too much."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Such a conversion is obviously very hard.", "The hardness of the conversion depends on the number of Perl features and syntactical constructs, which do not have easy-to-read, unobfuscated Python equivalents.", "I believe that the large amount of such features renders such automatic conversion impossible practically  (while theoretical possibility exists)."], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "practically", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "theoretical", "childNum": 0, "tag": "em", "childList": []}]}, {"text": ["So, could you please name Perl idioms and syntax features that can't be expressed in Python as concise as in the original Perl code?"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Edit: some people linked Python-to-Perl conventers and deduced, on this basis, that it should be easy to write Perl-to-Python as well.", "However, I'm sure that converting to Python is in greater demand; still this converter is not yet written--while the reverse has already been!", "Which only makes my confidence in impossibility of writing a good converter to Python more solid."], "childNum": 3, "tag": "p", "senID": 7, "childList": [{"text": "Edit", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "to Python", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "greater", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}]