[{"text": ["How much leeway do I have to leave myself to learn a new language?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm a relatively new hire, and I'm starting on a small, fairly simple project.", "The language that this project will be implemented in is still to be determined.", "The question basically boils down to - Java or Python? "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Here's the dilemma: My manager would prefer it to be done in Python.", "I don't object to that, but I have no experience in Python.", "I'd really love to learn Python and think I could manage it fairly quickly (especially as it's a small project).", "BUT the project is due at the end of March and must be ready by then.", "So they'd rather have it in Java and on time than in Python and late, and they don't want to pressure me to do it in Python if I think I can't make it on time."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Sorry about the background - but my question basically is, how long does it take, on average, to adapt to a new language?", "I know this is subjective and personalized, and depends on how fast the particular programmer is... but talking about an average programmer, or even a somewhat fast one that picks up things quickly, what percentage of an increase does programming in a non-native language (but with similar concepts) cause?", "As in, if this project would take me about 2 weeks in Java or a .NET language, how much longer can it take me in Python?", "Can I assume that having double the amount of time (i.e.", "a new, unfamiliar language causes a 50% increase in programming time) is adequate?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["And included in this question - from what I've heard, it seems to be pretty easy/intuitive to switch over from Java to Python.", "Is this true...?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Thanks everyone for all the answers!", "I didn't realize there are so many sides to this question...", "I will try to choose an answer soon - each response made me look at it a different way and it's hard to choose one answer."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Thanks", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}]