[{"text": ["Converting a database-driven (non-OO) python script into a non-database driven, OO-script"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I have some software that is heavily dependent on MySQL, and is written in python without any class definitions.", "For performance reasons, and because the database is really just being used to store and retrieve large amounts of data, I'd like to convert this to an object-oriented python script that does not use the database at all."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So my plan is to export the database tables to a set of files (not many -- it's a pretty simple database; it's big in that it has a lot of rows, but only a few tables, each of which has just two or three columns)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Then I plan to read the data in, and have a set of functions which provide access to and operations on the data."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["My question is this:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["is there a preferred way to convert a set of database tables to classes and objects?", "For example, if I have a table which contains fruit, where each fruit has an id and a name, would I have a \"CollectionOfFruit\" class which contains a list of \"Fruit\" objects, or would I just have a \"CollectionOfFruit\" class which contains a list of tuples?", "Or would I just have a list of Fruit objects?"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I don't want to add any extra frameworks, because I want this code to be easy to transfer to different machines.", "So I'm really just looking for general advice on how to represent data that might more naturally be stored in database tables, in objects in Python."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Alternatively, is there a good book I should read that would point me in the right direction on this?"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Thanks!"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Ben"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]