[{"text": ["Will Django be a good choice for a permissions based web-app?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've been exploring the details of Django for about a week now and like what I see.", "However I've come upon some.. negativity in relation to fine-grained control of permissions to the CRUD interface."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["What I'm writing is an Intranet client management web-app.", "The organisation is about 6 tiers, and I need to restrict access to client groups based on tiers.", "Continually expanding.", "I have a fairly good idea how I'm going to do this, but am not sure if I'll be able to integrate it well into the pre-built admin interface. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I've done absolutely zero Django development otherwise I'd probably have a better idea on whether this would work or not.", "I probably won't use Django if the generated admin interface is going to be useless to this project - but like I said, there is a heavy reliance on fine-grained custom permissions."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Will Django let me build custom permissions/rules and integrate it seamlessly into the admin CRUD interface?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Update One: I want to use the admin app to minimise the repitition of generating CRUD interfaces, so yes I consider it a must have."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Update Two:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["I want to describe the permissions required for this project."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["A client can belong to one or many 'stores'.", "Full time employees should only be able to edit clients at their store (even if they belong to another store).", "However, they should not be able to see/edit clients at another store.", "Casuals should only be able to view clients based on what store they are rostered too (or if the casual is logged in as the store user - more likely)."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Management above them need to be able to see all employees for the stores they manage, nothing more."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["Senior management should be able to edit ALL employees and grant permissions below themselves."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["After reading the django documentation, it says you can't (autmoatically) set permissions for a sub-set of a group.", "Only the entire group.", "Is it easy enough to mock up your own permissions for this purpose?"], "childNum": 0, "tag": "p", "senID": 11, "childList": []}]