[{"text": ["Python CMS for my own website?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm an accomplished web and database developer, and I'm interested in redesigning my own website.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I have the following content goals:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "Support a book I'm writing", "tag": "none", "senID": 3}, {"text": "Move my blog to my own site (from blogger.com)", "tag": "none", "senID": 4}, {"text": "Publish my articles (more persistent content than a blog)", "tag": "none", "senID": 5}, {"text": "Host a forum with light use", "tag": "none", "senID": 6}, {"text": "Embed slide sharing and screencasts", "tag": "none", "senID": 7}]}, {"text": ["I have the following technology goals for implementing my site:"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"tag": "ul", "num": 7, "lis": [{"text": "Learn more Python and Django", "tag": "none", "senID": 9}, {"text": "Leverage a CMS solution such as Pinax or Django-CMS", "tag": "none", "senID": 10}, {"text": "Utilize a CSS framework, such as Blueprint or YUI", "tag": "none", "senID": 11}, {"text": "I develop on a Mac OS X platform", "tag": "none", "senID": 12}, {"text": "I'm comfortable developing in a CLI, but I'd like to practice Eclipse or NetBeans", "tag": "none", "senID": 13}, {"text": "I'd like to employ testing during development", "tag": "none", "senID": 14}, {"text": "Please, no Microsoft languages or tools", "tag": "none", "senID": 15}]}, {"text": ["Any suggestions for technology choices that support these goals?"], "childNum": 0, "tag": "p", "senID": 16, "childList": []}, {"text": ["Edit:  Apologies if the question above was too unclear or general.", "What I'm asking for is if folks have had experience doing a similar modest website, what would be recommendations for tools, frameworks, or techniques outside of those I listed?"], "childNum": 1, "tag": "p", "senID": 17, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 6, "lis": [{"text": "Is there another Python CMS that I should consider besides the two I listed?  E.g. there may be a great Python solution, but it isn't built on top of Django.", "tag": "none", "senID": 18}, {"text": "Perhaps all current Python CMS packages are too \"alpha,\" and I'd be better off writing my own from scratch?  Although I am up to it, I'd rather leverage an existing package.", "tag": "none", "senID": 19}, {"text": "Given this kind of project, would you deploy a CMS with built-in (or plug-in) support for blogs, forums, etc. or would you rather design a simpler website and embed the more complex content management using other services, relying on your own website only as a dumb proxy or portal.  E.g. one can re-publish Blogger.com content using the Google Gdata API.  One can embed re-branded Nabble.com archives into any website, which may provide forum/mailinglist functionality more easily than running the forum itself.", "tag": "none", "senID": 20}, {"text": "Sometimes a CMS package has its own CSS integrated, and using another CSS framework would be redundant or otherwise make no sense.  Yes?  No?", "tag": "none", "senID": 21}, {"text": "Are there plugins for Django in Eclipse or Netbeans?  I understand there's a pretty nice environment for Rails development in NetBeans, and I've read some people wish longingly for something similar for Django, but I don't know if these wishes have since been realized.", "tag": "none", "senID": 22}, {"text": "What are some current preferred tools for unit and functional testing a Django application?  Are these integrated with Eclipse or Netbeans?", "tag": "none", "senID": 23}]}]