[{"text": ["What is the best way to store set data in Python?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Here is my situation.", "I have a list of data that looks like this:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["[(id__1_, description, id_type), (id__2_, description, id_type), ... , (id__n_, description, id_type))"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The data is loaded from multiple files that all belong to the same grouping.", "In each grouping there could be multiples of the same id, each coming from different files.", "I don't care about the duplicates, so I thought a nice way to store all of this would be to throw it into a Set type.", "However there is a problem, sometimes for the same id the descriptions can vary slightly like this,"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["IPI00110753"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Tubulin alpha-1A chain", "tag": "none", "senID": 5}, {"text": "Tubulin alpha-1 chain", "tag": "none", "senID": 6}, {"text": "Alpha-tubulin 1", "tag": "none", "senID": 7}, {"text": "Alpha-tubulin isotype M-alpha-1", "tag": "none", "senID": 8}]}, {"text": ["(Note this example is taken from the uniprot protein database) "], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "uniprot protein database", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.uniprot.org/uniprot/P68369"}]}, {"text": ["Now I don't care if the descriptions vary.", "Initially it might seem like I could just throw them away (because I could look them up in a database later).", "However I can't do this because there is a chance that the protein database I am using will not contain a listing for a certain identifier.", "If this happens I will want to be able to display the human readable description to the biologists so they know roughly what protein they are looking at."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["I am currently solving this problem by using a dictionary type.", "However I don't really like this solution because it uses a lot of memory (I have a lot of these ID's).", "This is only an intermediary listing of them.", "There is some additional processing the ID's go through before they are placed in the database so I would like to keep my data-structure smaller."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["I have two questions really.", "First, will I get a smaller memory footprint using the Set type (over the dictionary type) for this, or should I use a sorted list where I check every time I insert into the list to see if the ID exists, or is there a third solution that I haven't thought of?", "If the Set type is the better answer how do I key it to look at just the first element of the tuple instead of the whole thing? "], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["Thank you for reading my question, \nTim"], "childNum": 1, "tag": "p", "senID": 13, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}, {"text": ["Update"], "childNum": 1, "tag": "p", "senID": 14, "childList": [{"text": "Update", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["based on some of the comments I received let me clarify a little.", "Most of what I do with data-structure is insert into it.", "I only read it twice, once to annotate it with additional information,* and once to do be inserted into the database.", "However down the line there may be additional annotation that is done before I insert into the database.", "Unfortunately I don't know if that will happen at this time. "], "childNum": 0, "tag": "p", "senID": 15, "childList": []}, {"text": ["Right now I am looking into storing this data in a structure that is not based on a hash-table (ie.", "a dictionary).", "I would like the new structure to be fairly quick on insertion, but reading it can be linear since I only really do it twice.", "I am trying to move away from the hash table to save space.", "Is there a better structure or is a hash-table about as good as it gets?"], "childNum": 0, "tag": "p", "senID": 16, "childList": []}, {"text": ["*The information is a list of Swiss-Prot protein identifiers that I get by querying uniprot."], "childNum": 0, "tag": "p", "senID": 17, "childList": []}]