[{"text": ["Python progression path - From apprentice to guru"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've been learning, working, and playing with Python for a year and a half now.", "As a biologist slowly making the turn to bio-informatics, this language has been a the very core of all the major contributions I have made in the lab.", "I more or less fell in love with the way Python permits me to express beautiful solutions and also with the semantics of the language that allows such a natural flow from thoughts to workable code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["What I would like to know is your answer to a kind of question I have seldom seen in this or other forums.", "This question seems central to me for anyone on the path to Python improvement but who wonders what his next steps should be."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Let me sum up what I do NOT want to ask first ;)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "I don't want to know how to QUICKLY learn Python", "tag": "none", "senID": 4}, {"text": "Nor do I want to find out the best way to get acquainted with the language", "tag": "none", "senID": 5}, {"text": "Finally, I don't want to know a 'one trick that does it all' approach.", "tag": "none", "senID": 6}]}, {"text": ["What I do want to know your opinion about, is:"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["What are the steps YOU would recommend to a Python journeyman, from apprenticeship to guru status (feel free to stop wherever your expertise dictates it), in order that one IMPROVES CONSTANTLY, becoming a better and better Python coder, one step at a time.", "Some of the people on SO almost seem worthy of worship for their Python prowess, please enlighten us :)"], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "What are the steps YOU would recommend to a Python journeyman, from apprenticeship to guru status (feel free to stop wherever your expertise dictates it), in order that one IMPROVES CONSTANTLY, becoming a better and better Python coder, one step at a time. Some of the people on SO almost seem worthy of worship for their Python prowess, please enlighten us :)", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["The kind of answers I would enjoy (but feel free to surprise the readership :P ), is formatted more or less like this:"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"tag": "ul", "num": 9, "lis": [{"text": "Read this (eg: python tutorial), pay attention to that kind of details", "tag": "none", "senID": 10}, {"text": "Code for so manytime/problems/lines of code", "tag": "none", "senID": 11}, {"text": "Then, read this (eg: this or that book), but this time, pay attention to this", "tag": "none", "senID": 12}, {"text": "Tackle a few real-life problems", "tag": "none", "senID": 13}, {"text": "Then, proceed to reading Y.", "tag": "none", "senID": 14}, {"text": "Be sure to grasp these concepts", "tag": "none", "senID": 15}, {"text": "Code for X time", "tag": "none", "senID": 16}, {"text": "Come back to such and such basics or move further to...", "tag": "none", "senID": 17}, {"text": "(you get the point :)", "tag": "none", "senID": 18}]}, {"text": ["I really care about knowing your opinion on what exactly one should pay attention to, at various stages, in order to progress CONSTANTLY (with due efforts, of course).", "If you come from a specific field of expertise, discuss the path you see as appropriate in this field."], "childNum": 0, "tag": "p", "senID": 19, "childList": []}, {"text": ["EDIT: Thanks to your great input, I'm back on the Python improvement track!", "I really appreciate!"], "childNum": 0, "tag": "p", "senID": 20, "childList": []}]