[{"text": ["What cross-platform GUI libraries are simple, lightweight, and have minimal dependencies?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've written a small command line utility in Python (ljdump if you're curious).", "I originally wrote it for a technical audience who is comfortable with editing textual config files and running Python scripts from the command line.", "With Python, I don't have to worry about cross-platform concerns very much."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "ljdump", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://hewgill.com/ljdump/"}]}, {"text": ["I would like to make this more accessible and provide a simple UI for people for whom any interaction with the command line feels like an alien world.", "I'm looking for just one dialog box with a couple of input fields, a couple of buttons, and some place to put status."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I'm open to any language, but languages (other than Python, perhaps) that require another heavyweight runtime wouldn't be ideal.", "I'm thinking something like wxWidgets and C++ would be an acceptable way to do this.", "If I were to use wxWidgets and Python, what more would a normal Win32 end user need to install to make this go?"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "wxWidgets", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://wxwidgets.org"}]}, {"text": ["Are there any better options?", "Qt?", "TkInter?", "(I suspect TkInter doesn't run natively on OS X and requires an X server."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit: I'm looking at some of the related questions on the right and I think it would be useful to consider my primary requirement to be minimal dependencies."], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "Edit", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "minimal dependencies", "childNum": 0, "tag": "em", "childList": []}]}, {"text": ["GUI Programming APIs has some good info on a number of alternatives."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "GUI Programming APIs", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/610/gui-programming-apis"}]}, {"text": ["Edit 2: It occurs to me that a dead-simple GUI could be to implement an http server in a Python script (there exist libraries to help with that), and fire up the user's preferred browser in a platform-specific way, pointing to localhost and whatever port the server happens to be listening on.", "That would certainly be sufficient for my needs.", "Any thoughts on that?"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "Edit 2", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}]