[{"text": ["What non web-oriented Python frameworks exist?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm looking for a good framework on which to base my applications development."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In PHP I use Symfony, in ActionScript PureMVC, they are all MVC frameworks."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "Symfony", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Symfony"}, {"href": "http://en.wikipedia.org/wiki/PureMVC", "text": "PureMVC", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["I'm looking for a Python framework being oriented towards general purpose application development, not web application.", "I mean, just applications, services, daemons and so on.", "Sometimes I have not a real view to implement, just an RPC service.", "Other times I have to code for a serial port, or implement a command scheduler, or whatever."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "a Python framework being oriented towards general purpose application development", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["What is the best open source software I can think of as a standard base for my needs?", "Why do you think your suggestion will fulfill my requirements over its competitors?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["EDIT:"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "EDIT:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["For \"general purpose\" I mean not being strongly bounded to be with or without a GUI, being a daemon or a command-line application, being multiprocess/multithread or not.", "Being general, giving a good architecture structure, not being a particular tool."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "strongly", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["EDIT 2:"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "EDIT 2:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I'd want to explain that the question is about the eventual existence of one or more \"frameworks\" not being bounded to any particular use case, but being able to give a good and well standardized startup structure/architecture, with some best practices applied, being a guideline, something being able to guide the architecture planning of the application itself, not of their behavior regarding tasks to perform."], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "eventual existence", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["I think this question is not so subjective, maybe wrong exposed because of my English, but I suppose it is legal :)"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]