[{"text": ["How to maintain long-lived python projects w.r.t.", "dependencies and python versions?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["short version: how can I get rid of the multiple-versions-of-python nightmare ?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["long version: over the years, I've used several versions of python, and what is worse, several extensions to python (e.g.", "pygame, pylab, wxPython...).", "Each time it was on a different setup, with different OSes, sometimes different architectures (like my old PowerPC mac)."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "extensions", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Nowadays I'm using a mac (OSX 10.6 on x86-64) and it's a dependency nightmare each time I want to revive script older than a few months.", "Python itself already comes in three different flavours in /usr/bin (2.5, 2.6, 3.1), but I had to install 2.4 from macports for pygame, something else (cannot remember what) forced me to install all three others from macports as well, so at the end of the day I'm the happy owner of seven (!", ") instances of python on my system. "], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "/usr/bin", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "seven", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["But that's not the problem, the problem is, none of them has the right (i.e.", "same set of) libraries installed, some of them are 32bits, some 64bits, and now I'm pretty much lost."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["For example right now I'm trying to run a three-year-old script (not written by me) which used to use matplotlib/numpy to draw a real-time plot within a rectangle of a wxwidgets window.", "But I'm failing miserably: py26-wxpython from macports won't install, stock python has wxwidgets included but also has some conflict between 32 bits and 64 bits, and it doesn't have numpy... what a mess !"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Obviously, I'm doing things the wrong way.", "How do you usally cope with all that chaos ?"], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "you", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}]