[{"text": ["How to insert arrays into a database?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["In my previous question a lot of users wanted me to give some more data to toy with.", "So I got working on exporting all my data and processing it with Python, but then I realized: where do I leave all this data? "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "In my previous question", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/3684484"}]}, {"text": ["Well I decided the best thing would be to stick them in a database, so at least I don't have to parse the raw files every time.", "But since I know nothing about databases this is turning out to be quite confusing.", "I tried some tutorials to create a sqlite database, add a table and field and try to insert my numpy.arrays, but it can't get it to work. "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "to parse the raw files", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://cid-0e685da213fd5935.skydrive.live.com/redir.aspx?page=browse&resid=E685DA213FD5935!148&type=6&authkey=WOUgehAzQ!o%24&Bsrc=EMSHGM&Bpub=SN.Notifications"}]}, {"text": ["Typically my results per dog look like this: \n"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "", "childNum": 0, "tag": "img", "pos": 0, "childList": []}]}, {"text": ["So I have 35 different dogs and each dog has 24 measurement.", "Each measurement itself has an unknown amount of contacts.", "Each measurement consists out of a 3D array (248 frames of the whole plate [255x63]) and a 2D array (the maximal values for each sensor of the plate [255x63]).", "Storing one value in a database wasn't a problem, but getting my 2D arrays in there didn't seem to work."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["So my question is how should I order this in a database and insert my arrays into it?"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]