[{"text": ["Which programming language to choose?", "(for a specific problem/domain, details inside)"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I am building a trading portfolio management system that is responsible for production, optimization, and simulation of non-high frequency trading portfolios (dealing with 1min or 3min bars of data, not tick data). "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I plan on employing Amazon web services to take on the entire load of the application."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I have four choices that I am considering as language."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Here is the scope of the extremes of the project scope.", "This isn't how it will be, maybe ever, but it's within the scope of the requirements:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "Weekly simulation of 10,000,000 trading systems.", "tag": "none", "senID": 5}, {"text": "(Each trading system is expected to have its own data mining methods, including feature selection algorithms which are extremely computationally-expensive. Imagine 500-5000 features using wrappers. These are not run often by any means, but it's still a consideration)", "tag": "none", "senID": 6}, {"text": "Real-time production of portfolio w/ 100,000 trading strategies", "tag": "none", "senID": 7}, {"text": "Taking in 1 min or 3 min data from every stock/futures market around the globe (approx 100,000)", "tag": "none", "senID": 8}, {"text": "Portfolio optimization of portfolios with up to 100,000 strategies. (rather intensive algorithm)", "tag": "none", "senID": 9}]}, {"text": ["Speed is a concern, but I believe that Java can handle the load."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["I just want to make sure that Java CAN handle the above requirements comfortably.", "I don't want to do the project in C++, but I will if it's required."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["The reason C# is on there is because I thought it was a good alternative to Java, even though I don't like Windows at all and would prefer Java if all things are the same."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["Python - I've read somethings on PyPy and pyscho that claim python can be optimized with JIT compiling to run at near C-like speeds... That's pretty much the only reason it is on this list, besides that fact that Python is a great language and would probably be the most enjoyable language to code in, which is not a factor at all for this project, but a perk."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["To sum up:"], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "real time production", "tag": "none", "senID": 15}, {"text": "weekly simulations of a large number of systems", "tag": "none", "senID": 16}, {"text": "weekly/monthly optimizations of portfolios", "tag": "none", "senID": 17}, {"text": "large numbers of connections to collect data from", "tag": "none", "senID": 18}]}, {"text": ["There is no dealing with millisecond or even second based trades.", "The only consideration is if Java can possibly deal with this kind of load when spread out of a necessary amount of EC2 servers."], "childNum": 0, "tag": "p", "senID": 19, "childList": []}, {"text": ["Thank you guys so much for your wisdom."], "childNum": 0, "tag": "p", "senID": 20, "childList": []}]