[{"text": ["Is there a reason I should be dissuaded from using an alternative templating engine in my Django app?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've done a few small-ish Django projects, and each time I've been struck by the apparent limitations of Django's templating language.", "Just as a random example, I was shocked to learn that if, in the context of a template, I had a variable bar and a dict foo, I couldn't access foo[bar] unless I wrote my own filter to do it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I've read that the reason for this is because Django was created for environments where the people designing the pages were not programmers.", "I understand that. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["But let's say that's not a problem for me.", "Is there a reason why I should stick with Django's templating language, rather than switching over to something with a lot more power, like Mako (where you can even execute arbitrary Python expressions)? "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I had the opportunity to use Mako for a school project a while back, and I really loved the power of it.", "For example, as part of the project, we had to make a big table, where building each row and cell was fairly complex.", "Yet, I could make my template look something like:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n &lt;table&gt;\n    % for foo in foos:\n        ${makerow(row)}\n    % endfor\n&lt;/table&gt;\n\n&lt;%def name=\"makerow(row)\"&gt;\n    &lt;tr&gt;\n        # Blah blah blah (possibly a call to makecell somewhere)\n    &lt;/tr&gt;\n&lt;/%def&gt;\n</code>\n</pre>\n", "senID": 5}, {"text": ["Maybe this is a violation of separation of presentation and logic, but boy is it nice and clean.", "Subroutines!", "Abstraction!", "Good stuff."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["And a follow-up question: If using an alternative templating language isn't frowned upon by the Django community, does anyone have any to suggest?", "Like I said, I really like Mako, but it's literally the only one I've used other than Django's."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]