[{"text": ["How to make virtual organisms learn using neural networks?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm making a simple learning simulation, where there are multiple organisms on screen.", "They're supposed to learn how to eat, using their simple neural networks.", "They have 4 neurons, and each neuron activates movement in one direction (it's a 2D plane viewed from the bird's perspective, so there are only four directions, thus, four outputs are required).", "Their only input are four \"eyes\".", "Only one eye can be active at the time, and it basically serves as a pointer to the nearest object (either a green food block, or another organism)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Thus, the network can be imagined like this:\n"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "", "childNum": 0, "tag": "img", "pos": 0, "childList": []}]}, {"text": ["And an organism looks like this (both in theory and the actual simulation, where they really are red blocks with their eyes around them):"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"src": "http://i.stack.imgur.com/inCNp.png", "tag": "img", "senID": 4}, {"text": ["And this is how it all looks (this is an old version, where eyes still didn't work, but it's similar):"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"src": "http://i.stack.imgur.com/FD9K0.png", "tag": "img", "senID": 6}, {"text": ["Now that I have described my general idea, let me get to the heart of the problem..."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["But, there is a big problem.", "I think that this isn't a good approach, because they don't actually learn anything!", "Only those that had their initial weights randomly set to be beneficial will get a chance of eating something, and then only them will have their weights strengthened!", "What about those that had their connections set up badly?", "They'll just die, not learn."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["How do I avoid this?", "The only solution that comes to mind is to randomly increase/decrease the weights, so that eventually, someone will get the right configuration, and eat something by chance.", "But I find this solution to be very crude and ugly.", "Do you have any ideas?"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["EDIT:\nThank you for your answers!", "Every single one of them was very useful, some were just more relevant.", "I have decided to use the following approach:"], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "EDIT:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}]