[{"text": ["Python tutorial for total beginners?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've recently been given a group of five 16/17 year old students to mentor through a extra-curricular software project.", "The only trouble is, they have never done any form of coding / scripting.", "This in itself makes me feel nervous.", "After much agonising I settled on getting them to use Python as its free and there appears to be a lot of useful information online. "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "never", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["I myself have never used any python or even done any scripting, so I'll be learning it alongside the students.", "This fact doesn't really bother me so much as Im a professional and what kind of pro can't learn a new language ?!", "... right!", "What does concern me is that the students have no rounding in software theory, techniques or practices so Ill have to point them in the direction of a good tutorial."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Does anyone know of a good python tutorial for (total) beginners that contains elements of theory and software techniques?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["EDIT"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "EDIT", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Conclusion...\nGenerally the scheme went very well.", "There was an initial hurdle to overcome by explaining syntax... oddly enough the hardest thing for the students to grasp was the enforced indenting of python.", "If I were to do it again I would probably choose a language where blocks of code were clearly delineated with { } as I think that the students might better be able to grasp the program's structure and flow. "], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "Conclusion...", "childNum": 1, "tag": "em", "pos": 0, "childList": [{"text": "Conclusion...", "tag": "strong"}]}, {"text": "Conclusion...", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["If anyone gets a chance to do something similar I would highly recommend it as it is great for reinforcing just how much you know yourself!", "Not to mention the challenges in improving your communication skills.", "I found that I was better able to communicate technical concepts to my (non-technical) manager in a much clearer and concise way.", "Students have a great way of saying 'I don't understand' something I don't think I've ever heard my manager say!"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]