[{"text": ["When is it (not) appropriate to bundle dependencies with an application?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Summary"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Summary", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I recently had a conversation with the creator of a framework that one of my applications depends on.", "During that conversation he mentioned as a sort of aside that it would make my life simpler if I just bundled his framework with my application and delivered to the end user a version that I knew was consistent with my code.", "Intuitively I have always tried to avoid doing this and, in fact, I have taken pains to segment my own code so that portions of it could be redistributed without taking the entire project (even when there was precious little chance anyone would ever reuse any of it).", "However, after mulling it over for some time I have not been able to come up with a particularly good reason why I do this.", "In fact, now that I have thought about it, I'm seeing a pretty compelling case to bundle all my smaller dependencies.", "I have come up with a list of pros and cons and I'm hoping someone can point out anything that I'm missing."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "why", "childNum": 0, "tag": "em", "pos": 3, "childList": []}, {"text": "all", "childNum": 0, "tag": "em", "pos": 4, "childList": []}]}, {"text": ["Pros"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Pros", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 3, "lis": [{"text": "Consistency of versions means easier\ntesting and troubleshooting.", "tag": "none", "senID": 4}, {"text": "Application may reach a wider\naudience since there appear to be\nfewer components to install.", "tag": "none", "senID": 5}, {"text": "Small tweaks to the dependency can\nmore easily be made downstream and\ndelivered with the application,\nrather than waiting for them to\npercolate into the upstream code base.", "tag": "none", "senID": 6}]}, {"text": ["Cons"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "Cons", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 3, "lis": [{"text": "More complex packaging process to include\ndependencies.", "tag": "none", "senID": 8}, {"text": "User may end up with multiple copies\nof a dependency on their machine.", "tag": "none", "senID": 9}, {"text": "Per bortzmeyer's response, there are potential security concerns with not being able to upgrade individual components.", "tag": "none", "senID": 10}]}, {"text": ["Notes"], "childNum": 1, "tag": "p", "senID": 11, "childList": [{"text": "Notes", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["For reference, my application is written in Python and the dependencies I'm referencing are \"light\", by which I mean small and not in very common use.", "(So they do not exist on all machines or even in all repositories.", ")  And when I say \"package with\" my application, I mean distribute under my own source tree, not install with a script that resides inside my package, so there would be no chance of conflicting versions.", "I am also developing solely on Linux so there are no Windows installation issues to worry about."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["All that being said, I am interested in hearing any thoughts on the broader (language-independent) issue of packaging dependencies as well.", "Is there something I am missing or is this an easy decision that I am just over-thinking?"], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["Addendum 1"], "childNum": 1, "tag": "p", "senID": 14, "childList": [{"text": "Addendum 1", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["It is worth mentioning that I am also quite sensitive to the needs of downstream packagers.", "I would like it to be as straightforward as possible to wrap the application up in a distribution-specific Deb or RPM."], "childNum": 0, "tag": "p", "senID": 15, "childList": []}]