[{"text": ["Alternatives to ApacheBench for profiling my code speed"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've done some experiments using Apache Bench to profile my code response times, and it doesn't quite generate the right kind of data for me.", "I hope the good people here have ideas."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Specifically, I need a tool that"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "Does HTTP requests over the network (it doesn't need to do anything very fancy)", "tag": "none", "senID": 3}, {"text": "Records response times as accurately as possible (at least to a few milliseconds)", "tag": "none", "senID": 4}, {"text": "Writes the response time data to a file without further processing (or provides it to my code, if a library)", "tag": "none", "senID": 5}]}, {"text": ["I know about ab -e, which prints data to a file.", "The problem is that this prints only the quantile data, which is useful, but not what I need.", "The ab -g option would work, except that it doesn't print sub-second data, meaning I don't have the resolution I need."], "childNum": 2, "tag": "p", "senID": 6, "childList": [{"text": "ab -e", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "ab -g", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["I wrote a few lines of Python to do it, but the httplib is horribly inefficient and so the results were useless.", "In general, I need better precision than pure Python is likely to provide.", "If anyone has suggestions for a library usable from Python, I'm all ears."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["I need something that is high performance, repeatable, and reliable."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["I know that half my responses are going to be along the lines of \"internet latency makes that kind of detailed measurements meaningless.", "\" In my particular use case, this is not true.", "I need high resolution timing details.", "Something that actually used my HPET hardware would be awesome."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["Throwing a bounty on here because of the low number of answers and views."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}]