[{"text": ["Framework/CMS suggestions for enterprise website & intranet (I've got to convince the president its solid!"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Dear stack overflow community,"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I've been given the task of overhauling a couple of websites for a large corporation I'm working for, as well as developing an internal intranet site for content management and document storage within the organization."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["My \"problem\" is this: They want me to use a framework/set of languages/technologies that I can prove to them are \"stable, enterprise-ready technologies with a proven track record."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The spec's \"big picture\" really isn't too complicated: Implement an enterprise-class CMS for management of each division's web pages that deal mostly with product information and documentation (i.e.", "a simpler version of www.linksys.com)."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["As an open-source programmer, I'd like to use Python with TurboGears and build it from scratch, but I can't really find a way to prove to the president that TurboGears has a huge enterprise track record.", "Zope seems to have a lot of enterprise usage, but it looks a bit bloated to me.", "Django could be an option, but doesn't seem as flexible as TurboGears."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I'd rather not use PHP, but Drupal has a very nice resume with the \"right\" names under it (AOL, Sony, MTV); plus it could save me building many of the CMS components from scratch."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Rails might be another option, but I'm not too familiar with it (and as a Python/PHP programmer, Ruby's syntax drives me crazy)."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["What would the S.O.", "community suggest for a project like this?", "I'm sure many of you have faced the same dilemma.", "What ended up working/not working for you?", "As I said before, my first choice would be Python, second would be PHP, third would be Rails."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Thank you,\nSeth"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]