[{"text": ["Seeking advice on choosing a framework for web development in python"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm yet another absolute beginner trying to get to grips with web development with python.", "I'm at a stage where I'm feeling a bit paralyzed by the Big Framework Questions: should I use one at all and, if so, which one is most appropriate given my circumstances."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I've read a lot of great responses to similar questions on this site that were really useful in guiding my first steps. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["In previous posts on similar topics, many people have recommended Django.", "So far, I've gone through the tutorials for several of the popular frameworks that I've seen recommended here - Django, pylons, cherrypy, webpy, and a couple others from the python.org website - and am at the stage of feeling completely overwhelmed by the possible combinations of frameworks, python modules, apache modules, middleware options, etc.", "I haven't immediately 'taken' to any of them and am not sure which is/are worth spending a bit more time with, given my particular circumstances.", "I wondered if someone might be able to give me some advice. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Here are my constraints, considerations and background:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 8, "lis": [{"text": ["This isn't for work I have a lot of flexibility in terms of hardware/software/languages/etc.", "However, I would prefer to invest the time to learn how to do things in a safe, sensible, scalable way."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["A :+:big:+: motivation for these projects is to learn more python and to brush up on my MySQL skills.", "I wouldn't want a framework to get in the way of my blossoming relationships with python and MySQL!"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["I'm a linux girl, running apache.", ":)"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Staying with my current host provider (also running apache) them isn't crucial, but it would be highly convenient.", "I got a very simple test site working with mod_python, but I've since realised that I need to be a bit careful about the apache module I use if I want to stay with cheap hosting.", "After some heartache and tears, I've now got a test site working with fastcgi using Beaker for sessions and MyDQLdb to talk to my database.", "It works both on my local test environment and on my host provider, but at this stage, I'm quite happy to consider alternatives!"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["I have a quirky, ad hoc programming background - tiny bits of Fortran, C++ and Perl, some python for little around-the-home projects, a couple years of programming with an in-house scripting language for a job, reasonable familiarity with MySQL, basic html and css.", "I've never formally studied programming or software engineering, so very much appreciate good documentation and examples that don't assume too much!", "I've tended to take a procedural approach and am only just taking baby steps in object-oriented-land, so I still find some of the python examples a bit difficult to follow.", "(I often need to look at PHP tutorials for complete beginners to get the basic idea before launching into the python, which feels a little perverse as I don't know PHP.", ")  I've never developed for the web before."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["The project I have in mind involves lots of user interaction.", "The kind of things I'm interested in doing are closer to, say the flash-card hosting at http://flashcarddb.com to an out-of-the-box news website, blog or forum.", "Part of it is an adaptation of some code that ran on the command line that I'm trying to get going on the web.", "The MySQL database already exists.", "It will be a reasonable-sized project, and I'd like to make sure it's easy to expand, should I get carried away."], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "http://flashcarddb.com", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://flashcarddb.com"}]}, {"text": ["At this stage, the main thing that's looking annoying tedious is generating forms, validating data and doing all the stuff required to make the user experience smooth, pretty and cross-browser compatible.", "(I can make a simple form work, get the results and make the appropriate database query, but trying to make this look and feel nice is another matter entirely.", ")  The UI stuff is what gives me the fear - in past projects, making nice user interfaces has taken more time than anything else but is what I'm least interested in doing.", "With a web application, I'm assuming that I'll eventually want to invoke ajax and am dreading the fiddleyness of css and javascript.", "PHP seems like it has some generic stuff like the php form builder class to make this a little less painful; I've not yet found anything quite that easy (for me) to plug in and run with for python, but I'm not even sure if what I'm looking for is a module, a framework, or a pipe dream."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["I'm happy to throw my test script out the window at this stage if that's the sensible thing to do.", "I felt I had to start from basics to get my head around how the web worked and what a framework might actually do for me.", "I'm also happy to carry on and just add on to what I've started and add in little bits and pieces when/if I see the need.", "It's easy to change gears now, but if I get deep into the project and find I've made the wrong decision and have to rewrite from the ground up, I would weep.  "], "childNum": 0, "tag": "p", "senID": 12, "childList": []}]}, {"text": ["Any advice about how to proceed in general - or frameworks in particular - would be most appreciated.", "I still don't know what I don't know, so would greatly value advice from anyone who has done this kind of thing before!", "I'd also welcome any advice people might have on good online resources that may not have come up using obvious Google search terms.  "], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["I do apologise for my cluelessness about all this - and apologies if this isn't an appropriate question for StackOverflow.", "I've found answers to various questions on StackOverflow before and really value it as a resource, but I'm not sure if this question might be deemed too subjective or repetitive!"], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"text": ["Many thanks!"], "childNum": 0, "tag": "p", "senID": 15, "childList": []}]