[{"text": ["What tools can be used to produce beautiful documentation for a Python project?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm working on an open-source project called python-graph.", "We've come to the point where our APIs are stabilising and we've realised that we need some user docs.", "We already have automatically generated Epydoc API reference documents, however I want to I want to create something more useful for beginner programmers who find the auto-generated doc formats somewhat impenetrable. "], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "python-graph", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/python-graph/"}, {"text": "Epydoc API reference documents", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.linux.ime.usp.br/~matiello/python-graph/docs/"}]}, {"text": ["I'd like our documentation to be accessible to first-time programmers - especially undergraduate level and people from a non-mathematical background. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Mark Pilgrim seems to create some of the best documentation i've ever read.", "We want to make a document that works much the same way that his online \"Dive into Python\" project works. "], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Dive into Python", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://diveintopython.org/getting%5Fto%5Fknow%5Fpython/index.html"}]}, {"text": ["My question: How did he do this?", "Is there a content management system which is geared towards building documents like this?", "Is this LaTeX, and if so how he get the code highlighting so perfect?", "Furthermore, is there a way that we can reference code externally?", "I'd want to ensure that every example code we put into our docs is automatically tested for validity as our APIs evolve. "], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "My question", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Thanks"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]