[{"text": ["Existence of a table generation framework for experiments"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Bounty is for the name of a software package for generating tables and running experiments with particular parameters.", "That is it!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I am running experiments on computer programs with a number of variables whose effect I am measuring.", "For each run, I record the time, the precision and the recall. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Are there any frameworks that exist that can help me with running tests and generating tables?", "I am currently using the Python CSV library to generate basic tables.", "However, things get complicated depending on how many variables you want to change, since the table format may have to be different."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "running tests and generating tables?", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["For an illustration of various formats see http://spreadsheets.google.com/pub?key=trRdDhrzIc0xH-CRuP0Ml6g&amp;output=html.", "There are probably more formats that I am not aware of."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://spreadsheets.google.com/pub?key=trRdDhrzIc0xH-CRuP0Ml6g&amp;output=html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://spreadsheets.google.com/pub?key=trRdDhrzIc0xH-CRuP0Ml6g&output=html"}]}, {"tag": "ul", "num": 7, "lis": [{"text": "I would prefer it to be written in Python, but frameworks in other languages (esp. Java/C++ as I know them) would be acceptable", "tag": "none", "senID": 5}, {"text": "This bounty is ", "tag": "none", "senID": 6}, {"text": "Also, I need the answer within ", "tag": "none", "senID": 7}, {"text": "I've actually (finally) written my own framework, but I need to compare it against others.", "tag": "none", "senID": 8}, {"text": "Bounties are still valid for community wiki questions", "tag": "none", "senID": 9}, {"text": "This question is not about generating test data. It simply has to call the test function with appropriate arguments.", "tag": "none", "senID": 10}, {"text": "I am not just looking for a general tool like Matlab/Excel unless you can demonstrate that it has the functionality or provide the name of a plugin with suitable requirements.", "tag": "none", "senID": 11}]}]