[{"text": ["Looking for library/tool to visualise multi-dimensional data"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'm using Python in an attempt to analyse a large chunk of empiric measurements.", "In essence, I've two functions transforming the empiric data which also takes 3 'count' parameters - and returns a sequence of floats in each configuration.", "I'm expecting (hoping) to see some interesting patterns emerge when appropriate parameters are selected.", "I anticipate that the patterns might be relative between sequences returned for each function - and/or relate to patterns of some kind in the parameters.", "In case it's relevant, the 3 'count' parameters roughly correspond to:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "A 'window size' on the underlying data over which summary statistics are calculated", "tag": "none", "senID": 2}, {"text": "A number of consecutive windows used to compute a single summary statistic (i.e. the trade-off between greater spatial or greater temporal accuracy)", "tag": "none", "senID": 3}, {"text": "An 'minimum age' - an offset into history of the underlying data.", "tag": "none", "senID": 4}]}, {"text": ["The summary statistics (which generate the resulting sequences of floats for each parameter configuration) are non-trivial but will be independently sensitive to all three parameters."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I'm interested in visualisation techniques - suited to RAD/ad-hoc enquiry that will help me experiment with this multi-dimensional data."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["So far, I've tinkered with MatPlotLib but find being restricted generating two graphs of 2/3 dimensions in the style of batch processing makes investigation very tedious.", "Ideally, I'd find a tool that would allow me to visualise more than two dimensions... perhaps allowing me to switch real-time between dimensions in an interactive GUI."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "MatPlotLib", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://matplotlib.sourceforge.net/"}]}, {"text": ["I'd really appreciate hints from any visualisation gurus as to suitable tools I should investigate - ideally to integrate with my existing Python functions - or in other languages.", "I'd especially like to hear any anecdotes of success with similar visualisation problems."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["EDIT to add: One possible approach I'm considering is to use animation on 2 or 3D plots (to capture another dimension... leaving 1 or 2 for manual selection)... though I've found no good tools to help me achieve this, yet."], "childNum": 2, "tag": "p", "senID": 9, "childList": [{"text": "EDIT to add", "childNum": 1, "tag": "em", "pos": 0, "childList": [{"text": "EDIT to add", "tag": "strong"}]}, {"text": "EDIT to add", "childNum": 0, "tag": "strong", "childList": []}]}]