[{"text": ["Do many Python libraries have relatively low code quality?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Edit: Since this question was asked a lot of improvement has happened in the standard Python scientific libraries (which was the targeted area).", "For example the numpy project has made a big effort to improve the docstrings.", "One can still argue if it would have been possible to address these issues continuously right from the start."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I have this somewhat heretic question: Why do so many Python libraries have messy code and don't follow standard best practices?", "Or do you think that this observation is absolutely not true?", "How does the situation compare to other languages?", "I am interested in your take on this."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Some reasons why I have the impression that quality is lacking:"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Some reasons why I have the impression that quality is lacking:", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 5, "lis": [{"text": ["The docstrings are often completely missing or incomplete, even for the public API.", "It is painful when a method takes *args and **kwargs but does not document which values can be given."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "*args", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "**kwargs", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Bad Python coding practices, like adding new attributes outside of __init__.", "Things like this make the code hard to read (or to maintain)."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "__init__", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Hardly any libraries follow the PEP8 coding conventions.", "Sometimes the conventions are not even consistent in a single file."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["The overall design is messy, with no clear API.", "It seems that not nearly enough refactoring is done."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Poor unittest coverage."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}]}, {"text": ["Don't get me wrong, I absolutely love Python and its ecosystem.", "And even though I struggled with these libraries they generally get the job done and I am grateful for that.", "But I also think that in the end tons of developer time are wasted because of these issues.", "Maybe that is because Python gives you so much freedom that it is very easy to write bad code."], "childNum": 3, "tag": "p", "senID": 9, "childList": [{"text": "I absolutely love Python and its ecosystem", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "they generally get the job done and I am grateful for that", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "Python gives you so much freedom that it is very easy to write bad code", "childNum": 0, "tag": "em", "pos": 3, "childList": []}]}]