[{"text": ["Python crypt module -- what's the correct use of salts?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["First, context: I'm trying to create a command-line-based tool (Linux) that\nrequires login.", "Accounts on this tool have nothing to do with\nsystem-level accounts -- none of this looks at /etc/passwd."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I am planning to store user accounts in a text file using the same format (roughly) as /etc/passwd."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Despite not using the system-level password files, using crypt seemed\nto be a good practice to use, as opposed to storing passwords in\ncleartext.", "(While crypt is certainly better than storing passwords in\ncleartext, I'm open to other ways of doing this."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["My crypt knowledge is based on this:\nhttp://www.python.org/doc/2.5.2/lib/module-crypt.html"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://www.python.org/doc/2.5.2/lib/module-crypt.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/doc/2.5.2/lib/module-crypt.html"}]}, {"text": ["The documentation seems to ask for something that isn't possible: \"it\nis recommended to use the full crypted password as salt when checking\nfor a password."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Huh?", "If I'm creating the crypted password (as in, when creating a user\nrecord) how can I use the crypted password as a salt?", "It\ndoesn't exist yet.", "(I'm assuming that you must use the same salt for creating and checking a password."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["I've tried using the plaintext password as a salt.", "This does\nwork, but has two problems; one easily overcome, and one serious:"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["1) The first two letters of the plaintext password are included in the\ncrypted password.", "You can fix this by not writing the first two\ncharacters to the file:"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"code": "<pre>\n<code>\n user_record = '%s:%s:%s' % (user_name, crypted_pw[2:], user_type)\n</code>\n</pre>\n", "senID": 9}, {"text": ["2) By using the plaintext password as the salt, you would seem to be\nreducing the amount of entropy in the system.", "Possibly I'm\nmisunderstanding the purpose of the salt."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["The best practice I've been able to derive is to use the first two\ncharacters from the username as the salt.", "Would this be appropriate,\nor is there something I've missed that makes that a bad move?"], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["My understanding of a salt is that it prevents pre-computing password\nhashes from a dictionary.", "I could use a standard salt for all\npasswords (such as my initials, \"JS,\") but that seems to be less of a\nburden for an attacker than using two characters from each user's username."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}]