[{"text": ["Game map from Code"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["It's a long one so you might want to get that cup of tea/coffee you've been holding off on ;)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I run a game called World of Arl, it's a turn based strategy game akin to Risk or Diplomacy.", "Each player has a set of cities, armies and whatnot.", "The question revolves around the display of these things.", "Currently the map is created using a background image with CSS positioning of team icons on top of that to represent cities.", "You can see how it looks here: WoA Map"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "WoA Map", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://woarl.com/map/turn%5F32%5Fnormal.html"}]}, {"text": ["The background image for the map is located here: Map background and created in Omnigraffle.", "It's not designed to draw maps but I'm hopelessly incompetent with photoshop and this works for my purposes just fine."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "Map background", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://woarl.com/map/images/theMap.jpg"}, {"text": "Omnigraffle", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.omnigroup.com/applications/omnigraffle/"}]}, {"text": ["The problem comes that I want to perform such fun things as pathfinding and for that I need to have the map somehow stored in code.", "I have tried using PIL, I have looked at incorporating it with Blender, I tried going \"old school\" and creating tiles as from many older games and finally I tried to use SVG.", "I say this so you can see clearly that it's not through lack of trying that I have this problem ;)"], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "PIL", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.pythonware.com/products/pil/"}, {"text": "Blender", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.blender.org/"}]}, {"text": ["I want to be able to store the map layout in code and both create an image from it and use it for things such as pathfinding.", "I'm using Python but I suspect that most answers will be generic.", "The cities other such things are stored already and easily drawn on, I want to store the layout of the landmass and features on the landmass."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["As for pathfinding, each type of terrain has a movement cost and when the map is stored as just an image I can't access the terrain of a given area.", "In addition to pathfinding I wish to be able to know the terrain for various things related to the game, cities in mountains produce stone for example."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Is there a good way to do this and what terms should I have used in Google because the terms I tried all came up with unrelated stuff (mapping being something completely different most of the time)."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Edit 2:\nArmies can be placed anywhere on the map as can cities, well, anywhere but in the water where they'd sink, drown and probably complain (in that order)."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["After chatting to somebody on MSN who made me go over the really minute details and who has a better understanding of the game (owing to the fact that he's played it) it's occurring to me that tiles are the way to go but not the way I had initially thought.", "I put the bitmap down as it is now but also have a data layer of tiles, each tile has a given terrain type and thus pathfinding and suchlike can be done on it yet at the same time I still render using Omnigraffle which works pretty well."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["I will be making an editor for this as suggested by Adam Smith.", "I don't know that graphs will be relevant Xynth but I've not had a chance to look into them fully yet."], "childNum": 2, "tag": "p", "senID": 10, "childList": [{"text": "Adam Smith", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/users/66634/adam-smith"}, {"text": "Xynth", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/users/62014/xynth"}]}, {"text": ["I really appreciate all those that answered my question, thanks."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}]