[{"text": ["Django memory usage going up with every request"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I moved my first Django project from DjangoEurope to Webfaction, and that started an issue looking like a memory leak.", "With every single request memory usage of the server process goes up about 500kb.", "It never goes down.", "This goes on until Webfaction kills it for using too much memory."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I can clearly see this when I refresh the Django's admin interface in my browser (although this happens with every single page, not only with admin interface - I though admin interface would be a nice test case, because there are no my code directly there).", "With every browser reload the memory usage goes up couple hundreds kilobytes."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I test the memory using a command suggested by Webfaction:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n ps -u publica -o rss,etime,pid,command\n</code>\n</pre>\n", "senID": 4}, {"text": ["More about my setup:"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "More about my setup:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 4, "lis": [{"text": "Django 1.1 (stable)", "tag": "none", "senID": 6}, {"text": "Default Webfaction Django setup using Apache and mod_wsgi", "tag": "none", "senID": 7}, {"text": ["DEBUG"], "childNum": 0, "tag": "code", "senID": 8, "childList": []}, {"text": "MySQLdb 1.2.2 from Webfaction, but after hearing it had some problems I tried version 1.2.3c. Didn't help.", "tag": "none", "senID": 9}]}, {"text": ["Edit: I created an empty Django project - default Django configuration plus django.contrib.admin and fresh empty database (tried both with mysql and postgresql).", "I started reloading Django admin in my browser and watched memory usage.", "At first I saw the problem occurring - memory usage grew after every reload.", "But then it stabilized and stopped growing.", "That's consistant with how my original project behaved on Django Europe.", "Unfortunately on Webfaction it never seems to stabilize (or at least not within limits of memory available to my account).", "Any advice? "], "childNum": 2, "tag": "p", "senID": 10, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "django.contrib.admin", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}]