[{"text": ["Fitting data to distributions?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I am not a statistician (more of a researchy web developer) but I've been hearing a lot about scipy and R these days.", "So out of curiosity I wanted to ask this question (though it might sound silly to the experts around here) because I am not sure of the advances in this area and want to know how people without a sound statistics background approach these problems. "], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "scipy", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.scipy.org/"}, {"text": "R", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.r-project.org/"}]}, {"text": ["Given a set of real numbers observed from an experiment, let us say they belong to one of the many distributions out there (like Weibull, Erlang, Cauchy, Exponential etc.", "), are there any automated ways of finding the right distribution and the distribution parameters for the data?", "Are there any good tutorials that walk me through the process? "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Real-world Scenario:\nFor instance, let us say I initiated a small survey and recorded information about how many people a person talks to every day for say 300 people and I have the following information:"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Real-world Scenario:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n 1 10\n2 5\n3 20\n...\n...\n</code>\n</pre>\n", "senID": 4}, {"text": ["where X Y tells me that person X talked to Y people during the period of the survey.", "Now using the information from the 300 people, I want to fit this into a model.", "The question boils down to are there any automated ways of finding out the right distribution and distribution parameters for this data or if not, is there a good step-by-step procedure to achieve the same?"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]