[{"text": ["algorithm for list identification and parsing"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I have data which in theory is a list, but historically has been input by the user as a free form text field.", "Now I need to separate each item of the list so that each element can be analysed."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Simplified examples of my data as input by users:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n one, two, three, four, five \n\none. two. three, four. five.\n\n\"I start with one, then do two, maybe three and four then five\"\n\none  \ntwo  \nthree  \nfour  \nfive.  \n\none, two. three four five\n\none two three four - five\n\n\"not even a list, no list-elements here! but list item separators may appear. grrr\"\n</code>\n</pre>\n", "senID": 3}, {"text": ["So, that's more or less what the data looks like.", "In reality a list item could be several words long.", "I need to process these lists (of which there are thousands) such that I end up arrays like this:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n array[0] = \"one\"  \narray[1] = \"two\"  \narray[n] = n\n</code>\n</pre>\n", "senID": 5}, {"text": ["I accept that sometimes my algorithm will completely fail to parse the list, I don't need a 100% success rate, 75% would be good.", "False positives are going to be very expensive for me so I would rather reject a list completely than generate a list that does not contain real data - assume some users type in meaningless gibberish."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["I have some ideas around trying to identify which separator(s) is being used and how regularly data is separated in relation to the size of the content."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["I prefer Java or Python, however any solution would be welcome :-)"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}]