[{"text": ["A replacement for python's httplib?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I have a python client which pushes a great deal of data through the standard library's httlib.", "Users are complainging that the application is slow.", "I suspect that this may be partly due to the HTTP client I am using."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Could I improve performance by replacing httplib with something else? "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I've seen that twisted offers a HTTP client.", "It seems to be very basic compared to their other protocol offerings. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["PyCurl might be a valid alternative, however it's use seems to be very un-pythonic, on the other hand if it's performance is really good then I can put up with a bit of un-pythonic code."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["So if you have experience of better HTTP client libraries of python please tell me about it.", "I'd like to know what you thought of the performance relative to httplib and what you thought of the quality of implementation."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["UPDATE 0: My use of httplib is actually very limited - the replacement needs to do the following:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"code": "<pre>\n<code>\n conn = httplib.HTTPConnection(host, port)\nconn.request(\"POST\", url, params, headers)\ncompressedstream = StringIO.StringIO(conn.getresponse().read())\n</code>\n</pre>\n", "senID": 7}, {"text": ["That's all: No proxies, redirection or any fancy stuff.", "It's plain-old HTTP.", "I just need to be able to do it as fast as possible."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["UPDATE 1: I'm stuck with Python2.4 and I'm working on Windows 32.", "Please do not tell me about better ways to use httplib - I want to know about some of the alternatives to httplib."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]