[{"text": ["Is this method of file locking acceptable?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["We have 10 Linux boxes that must run 100 different tasks each week.", "These computers work at these tasks mostly at night when we are at home.", "One of my coworkers is working on a project to optimize run time by automating the starting of the tasks with Python.", "His program is going to read a list of tasks, grab an open task, mark that task as in progress in the file, and then once the task is finished mark the task as complete in the file.", "The task files will be on our network mount."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["We realize it is not recommended to have multiple instances of a program accessing the same file, but we don't really see any other option.", "While he was looking for a way of preventing 2 computers from writing to the file at the same time, I came up with a method of my own, which seemed easier to implement than the methods we found online.", "My method is to check if the file exists, wait a few seconds if it doesn't, and then temporarily move the file if it does.", "I wrote a script to test this method:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n #!/usr/bin/env python\n\nimport time, os, shutil\nfrom shutil import move\nfrom os import path\n\n\nfh = \"testfile\"\nfhtemp = \"testfiletemp\"\n\n\nwhile os.path.exists(fh) == False:\n    time.sleep(3)\n\nmove(fh, fhtemp)\nf = open(fhtemp, 'w')\nline = raw_input(\"type something: \")\nprint \"writing to file\"\nf.write(line)\nraw_input(\"hit enter to close file.\")\nf.close()\nmove(fhtemp, fh)\n</code>\n</pre>\n", "senID": 3}, {"text": ["In our tests this method has worked, but I was wondering if we might have some problems that we aren't seeing by using this.", "I realize that disaster could result from two computers running exists() at the same time.", "It's unlikely that two computers would get to that point at the same time since the tasks are anywhere between 20 minutes and 8 hours."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]