[{"text": ["How to design an application in a modular way?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I am looking for pointers, suggestions, links, warnings, ideas and even anecdotical accounts about\"how to design an application in a modular way\".", "I am going to use python for this project, but advice does not need to necessarily refer to this language, although I am only willing to implement a design based on OOP."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "I am looking for pointers, suggestions, links, warnings, ideas and even anecdotical accounts about\"how to design an application in a modular way\". I am going to use python for this project, but advice does not need to necessarily refer to this language, although I am only willing to implement a design based on OOP.", "childNum": 1, "tag": "strong", "pos": -1, "childList": [{"text": "\"how to design an application in a modular way\"", "tag": "em"}]}, {"text": "\"how to design an application in a modular way\"", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Here's some context to understand where I come from and what I am trying to achieve..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "hr", "senID": 3}, {"text": ["My project will be a small application that will consume web services and display the results in a variety of ways, including:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "notification popup containing just the result of the call", "tag": "none", "senID": 5}, {"text": "tab in the main window of the application with graphics plotted from retrieved raw-data", "tag": "none", "senID": 6}, {"text": "buffer of messages (visible on domand) where results from various services will pile up", "tag": "none", "senID": 7}]}, {"text": ["The application will be released as free (as-in-speech) software, and for this reason I would like to make it really easy for other devs to write plugins/modules that will extend the functionality of the main application without needing to change the core code."], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "make it really easy for other devs to write plugins/modules", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["At this point in time, plugins should essentially enable a developer to activate a new webservice, by defining the provider, the data manipulation (if any) and the way the data will be presented to the user."], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "plugins should essentially enable a developer to activate a new webservice, by defining the provider, the data manipulation (if any) and the way the data will be presented to the user", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I have extensive experience in developing with drupal which has a powerful modular approach, but that also follows a non-object-oriented design, so I suspect that for python, drupal design might not be the optimal solution."], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "drupal", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://drupal.org/"}]}, {"text": ["If this is of any importance - the core will be natively developed for GNU/Linux."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["Thank you in advance for your time!"], "childNum": 0, "tag": "p", "senID": 12, "childList": []}]