[{"text": ["Could someone kindly explain to me exactly how \"binary\" numbers relate to my everyday programming?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I'll admit it - i'm a \"lowly web programmer\" who is trying very hard to develop a much deeper understanding of programming as a whole.", "I understand the textbook definition of \"Binary\", but what I don't understand is exactly how it applies to my day to day programming? "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The concept of \"binary numbers\" vs .. well... \"regular\" numbers, is completely lost on me despite my best attempts to research and understand the concept. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I am someone who originally taught myself to program by building stupid little adventure games in early DOS Basic and C, and now currently does most (er, all) of my work in PHP, javascript, Rails, and other \"Web\" languages.", "I find that so much of this logic is abstracted out in these higher level languages that I ultimately feel I am missing many of the tools I need to continue progressing and writing better code. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If anyone could point me in the direction of a good, solid practical learning resource... or explain it here, it would be massively appreciated."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I'm not so much looking for the 'definition' (i've read the wikipedia page a few times now), but more some direction on how I can incorporate this newfound knowledge of exactly what binary numbers are into my day to day programming, if at all.", "I'm primarily writing in PHP these days, so references to that language specifically would be very helpful. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Thanks in advance to everyone. "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["EDIT As pointed out.. binary is a representation of a number, not a different system altogether..", "So to revise my question, what are the benefits (if any) of using binary representation of numbers rather than just... numbers. "], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "EDIT", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}]