[{"text": ["How to safely write to a file?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Imagine you have a library for working with some sort of XML file or configuration file.", "The library reads the whole file into memory and provides methods for editing the content.", "When you are done manipulating the content you can call a write to save the content back to file.", "The question is how to do this in a safe way."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "write", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["Overwriting the existing file (starting to write to the original file) is obviously not safe.", "If the write method fails before it is done you end up with a half written file and you have lost data."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "write", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["A better option would be to write to a temporary file somewhere, and when the write method has finished, you copy the temporary file to the original file."], "childNum": 3, "tag": "p", "senID": 3, "childList": [{"text": "temporary", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "write", "childNum": 0, "tag": "code", "childList": []}, {"text": "copy", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["Now, if the copy somehow fails, you still have correctly saved data in the temporary file.", "And if the copy succeeds, you can remove the temporary file."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["On POSIX systems I guess you can use the rename system call which is an atomic operation.", "But how would you do this best on a Windows system?", "In particular, how do you handle this best using Python?"], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "rename", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "Python", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}, {"text": ["Also, is there another scheme for safely writing to files?"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]