[{"text": ["Most Important Python Idioms"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["This question is inspired by several back-and-forths I've had recently about techniques that are or are not optimal for python programming.", "I may know other languages, but I am still learning in python.", "A wonderfully helpful comment was just recently posted by MikeD on a suboptimal answer of mine here that mentioned the operator module and Guido van Rossum's discussion of lisp-isms in python."], "childNum": 4, "tag": "p", "senID": 1, "childList": [{"text": "MikeD", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/users/370585/miked"}, {"href": "http://stackoverflow.com/questions/3282823/python-get-key-with-the-least-value-from-a-dictionary/3282889#3282889", "text": "here", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://docs.python.org/library/operator.html#", "text": "the operator module", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://www.artima.com/weblogs/viewpost.jsp?thread=98196", "text": "Guido van Rossum's discussion of lisp-isms in python", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["So, my question is what are the most common idioms that python programmers can be aware of so that their every-day code doesn't use well-documented-ly deprecated techniques that result in suboptimal code.", "I have a feeling many of these will deal with loop and iteration structures, or not blowing out memory by copying things unnecessarily, but some may not.", "I'm not talking about things that are common to all languages, like cacheing the results of an expression rather than calling the expression within a tight loop, I want to know just things for python.", "And not (necessarily) odd-ball things that one almost never runs into.", "I want my 80/20 effort maximized so I don't learn improper technique."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "what are the most common idioms that python programmers can be aware of so that their every-day code doesn't use well-documented-ly deprecated techniques that result in suboptimal code", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Most everyday-useful list wins the blue ribbon."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]