[{"text": ["Looking for a PHP and/or Python RAD"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I am looking for RAD like environment for PHP and/or Python free or not does not matter."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It should have a visual environment where one can use a point and click interface so that it is possible to select objects with mouse and move them around."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I have looked at Delphi4PHP.", "The RAD part is fantastic, but I don't like the framework on which it is based VCL4PHP (vcl4php.sourceforge.net) is crappy.", "Just to deploy a simple Hello world application we will have to deploy 40MB of that framework.", "That is just stupid....."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I looked at Eclipse but it is only a code IDE.", "Does not have a visual way of designing a page/window.", "Did I miss any plugin that supports this feature?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I was suggested to give NetBeans IDE a close look so I also looked that up, but did not find what I wanted."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I have also looked up following but none of these are true RAD:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "NuSphere PHPEd", "tag": "none", "senID": 7}, {"text": "VS PHP for Visual Studio ", "tag": "none", "senID": 8}, {"text": "PHP Designer (not a designer by any means just a plain old IDE)", "tag": "none", "senID": 9}]}, {"text": ["I have not been able to find any descent Python RAD tool also."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["I have looked up Yes Software's Code Charge Studio (www.yessoftware.com) but it cannot be used to develop complicated applications like say for example an Accounting System or an Inventory Management App, etc..", "It is useful but for very simple apps.", "Making changes to Visual part (referred as components by this people) is a nightmare.", "Finally it does not support Python."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}]