[{"text": ["Is it best for multiple specialization or single specialization?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've noticed a lot about jobs being posted that require the applicant to know several languages or technologies.", "Especially I find this with web development.", "I don't really like this considering the point that the more you specialize in several things the less you actually know about each one.", "I recognize that this is good for the bottom line when you can pay one person to do many things, but is it worth it for inferior service which isn't really their fault?", "A good read is research like this."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "this", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.whatsbestnext.com/2010/03/the-more-you-multitask-the-worse-you-get-at-multitasking/"}]}, {"text": ["It shows that the more you multitask the worse quality work you do significantly. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Here's my question.", "I would really like to only specialize in a few things, because I like to be good at what I do and I don't want to lie when I tell someone I can do what they want.", "Will being more specialized in a few things make it harder for me to find a job then if I worked in many technologies?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["A second point.", "My father is a DBA, he tells me that I would be shocked at the number of people who only learn enough of something to trick the employer they know it and then learn it after being hired.", "He then told me maybe if I needed to I should do the same.", "I don't like it and only want to apply at jobs I confidently know how to do.", "I see this as the right thing, yet I have trouble finding jobs while people who lie find them easier.", "Is this something I'm always going to have to deal with, will specializing more in a few things be better for me in the long run?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Interesting things I guess, just wanted to know from experienced developers.", "I'm 21 and specialize in html/css, javascript, and python.", "I also know some lisp stuff but just dabbling. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Thanks guys"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]