[{"text": ["Why does java/javascript/python force the use of () after a method name, even if it takes no arguments?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["One of my most common bugs is that I can never remember whether something is a method or a property, so I'm constantly adding or removing parentheses."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So I was wondering if there was good logic behind making the difference between calling on an object's properties and methods explicit."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Obviously, it allows you to have properties and methods that share the same name, but I don't think that comes up much."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The only big benefit I can come up with is readability.", "Sometimes you might want to know whether something is a method or a property while you're looking at code, but I'm having trouble coming up with specific examples when that would be really helpful.", "But I am a n00b, so I probably just haven't encountered such a situation yet.", "I'd appreciate examples of such a situation."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Also, are there other languages where the difference isn't explicit?  "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Anyways, if you could answer, it will help me be less annoyed every time I make this mistake ^-^."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["UPDATE:\nThanks everyone for the awesome answers so far!", "I only have about a week's worth of js, and 1 day of python, so I had no idea you could reference functions without calling them.", "That's awesome.", "I have a little more experience with java, so that's where I was mostly coming from... can anyone come up with an equally compelling argument for that to be the case in java, where you can't reference functions?", "Aside from it being a very explicit language, with all the benefits that entails :). "], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]