[{"text": ["Send commands between two computers over the internet"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I wish to control my computer (and usb devices attached to the computer) at home with any computer that is connected to the internet.", "The computer at home must have a program installed that receives commands from any other computer that is connected to the internet.", "I thought it would be best if I do this with a web interface as it would not be necessary to install software on that computer.", "For obvious reasons it would require log in details."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Extra details: The main part of the project is actually a device that I will develop that connects to the computer's usb port.", "Sorry if it was a bit vague in my original question.", "This device will perform simple functions such as turning lights on etc.", "At first I will just attempt to switch the lights remotely using the internet.", "Later on I will add commands that can control certain aspects of the computer such as the music player.", "I think doing a full remote desktop connection to control my device is therefore not quite necessary.", "Does anybody know of any open source projects that can perform these functions?"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Extra details", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["So basically the problem is sending encrypted commands from a web interface to my computer at home.", "What would be the best method to achieve this and what programming languages should I use?", "I know Java, Python and C quite well, but have very little experience with web applications, such as Javascript and PHP."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I have looked at web chat examples as it is sort of similar concept to what I wish to achieve, except the text can be replaced with commands.", "Is this a viable solution or are there better alternatives?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Thank you"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]