[{"text": ["Big picture questions regarding Django, Java, Python, HTML and web-site development in general"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I am trying to get a handle on the state of the art regarding web site development and have several questions.", "Maybe I'll end up finding most of the answers on my own.", "I come from a background of C++ and Windows development, and generally I am befuddled by what seems to be the ad-hoc nature of web development."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I focussed in on Django, after online research of it and Ruby (on Rails).", "From what I read, ROR tries to do everything for you behind the scenes and so therefore is slow and unscalable (and overhyped and not ready for prime time).", "So I have gotten into Django - downloaded Python and Django, the source from a complete Django site, got it running, and so forth."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["And the first thing that surprises me about Django, is that there does not seem to be any innovation to speak of regarding actual presentation.", "All the innovation would concern  database issues, business logic, reusability of code, etc - but not actually anything new regarding innovative visual controls or graphics for a web-site.", "When you build a Django view or template, it will still be making extensive reference to html from what I can see (And presumably also Javascript - but I haven't actually even seen any Javascript in Django templates yet.", ")  "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["And I would have thought previously that html might be analagous to assembler, so a conventional application developer from years past might know and occasionally even use a little assembler, but generally would hardly ever use it, whereas from what I can see, html (and  also CSS and javascript) still have to be mastered and written continually by every web developer, whether they're using Django or anything else.", "Is that a true statement?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["There is one site in particular that would to me as an end user represent the state of the art for web sites and I would be curious as to what the foundations of such a site might be.", "That site is chess.com,  and there are all sorts of facilities for playing chess online with other users, user customization of their account with various graphical effects and so on.", "Is it most likely Java applets they're using for a site like that?", "How relevant would Django be for a such a site.", "Would Django be used in conjunction with something like Flash or even Java applets?", "Also when a site like chess.com is ported to a mobile device, what is used to write it - the same development tools as for the desktop or something completely different (Yes, I have a lot of catching up to do."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Are there in fact complete websites written solely in Java, perhaps using very high level Java API's?", "Why would someone say (as I read somewhere) that they despised Java so that is why they had gotten into Ruby on Rails and Django."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["And regarding Python (and also PHP) what is the justification for their existence?", "First of all, Python is much, much slower than say C++, being interpreted.", "Why are websites written in Python or PHP - is platform independence the sole issue here.", "I am incredulous that application development is much faster in Python than C++ (aside from the garbage collection issue - is that what the primary reason for Python is - garbage collection.", ") "], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["So anyway, a bunch of newbie questions - will probably end up answering most of them myself if they're not answered here.", "Maybe they're relevant to someone else though."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}]