[{"text": ["What is a way for a web browser to communicate with a hardware device?"], "tag": "h2", "senID": 0}, {"text": ["I have a data acquisition hardware device attached to a PC via USB that I'd like to send some information and settings, acquire some data, and then retrieve the acquired data on the client and send it to the server.", "The plan is to use a web portal to communicate with the device attached to the client PC.", "I was planning on writing a DLL to talk to the device.", "My environment on the client is Windows using IE as the browser.", "The server side is Windows or Linux.", "What is the best way to communicate from a web browser client to a client-side device?"], "tag": "p", "senID": 1}, {"text": ["Clarification: The first goal is to allow the client PC to send acquisition settings to the device.", "The settings may be manually entered at the client or may come from the server.", "The second goal is to get the acquired data to the server's database.", "I don't need to display the acquired data at the client."], "tag": "p", "senID": 2}, {"text": ["The hardware device has a CPU but very limited memory.", "The protocol to communicate with the device is undetermined but I may access the device like a USB drive."], "tag": "p", "senID": 3}, {"text": ["Please respond with one method per answer so people can vote on indenpendent answers."], "tag": "p", "senID": 4}, {"text": ["As with all StackOverflow Poll type Q&amp;As, please make certain your answer is NOT listed already before adding a new answer"], "tag": "p", "senID": 5}, {"tag": "ul", "num": 3, "lis": [{"text": "If it already exists, vote that one up so we see what the most popular answer is, rather than duplicating an existing entry.", "tag": "none", "senID": 6}, {"text": "If you see a duplicate, vote it down so the top entries have only one of each model listed.", "tag": "none", "senID": 7}, {"text": "If you have interesting or additional information to add, use a comment to the entry it applies to rather than creating a duplicate.", "tag": "none", "senID": 8}]}]