[{"text": ["Do you work from code examples and snippets?", "How do you organize them?", "Find them?"], "tag": "h2", "senID": 0}, {"text": ["Succint version: "], "tag": "p", "senID": 1}, {"text": ["Do you have any suggestions about a repository where I can collect valuable C# / SQL / JavaScript / jQuery snippets and examples - and find them later?", "If so, please forward me a link!"], "tag": "p", "senID": 2}, {"text": ["Loquacious version:"], "tag": "p", "senID": 3}, {"text": ["I have a crappy memory.", "Did I mention that already?", "Stop me if I repeat myself.", "Stop me if I repeat myself."], "tag": "p", "senID": 4}, {"text": ["I've had to invent ways to compensate for my poor recall. "], "tag": "p", "senID": 5}, {"text": ["In a former life, my development environment provided a way to write a longish comment about each object in the app, which was stored in the library with the object.", "I wrote a lot of methods, and each had a comment describing the method's purpose.", "I created a tool that allowed me to search through those comments, presenting matching methods in a list.", "If the method name didn't suffice, I could double-click to see the source code.", "All my methods had a header that explained what it did and how it worked, and provided a usage example or two."], "tag": "p", "senID": 6}, {"text": ["Once found, it was easy to apply.", "Select the usage example, copy and paste into whatever you're coding, and alter the details to fit."], "tag": "p", "senID": 7}, {"text": ["This made my working life work.", "I encapsulated the tricky stuff in methods and had a means to find them -- when my crappy memory (did I mention that already?", ") failed me. "], "tag": "p", "senID": 8}, {"text": ["Now I'm in .NET, and objects have no convenient place for a descriptive comment, unless I embed them in the source.", "I've seen numberless code snippets in books and web sites that I have never captured and cannot reproduce.", "Sigh."], "tag": "p", "senID": 9}, {"text": ["Do you retain and organize code snippets, so you can refer to them later?"], "tag": "p", "senID": 10}, {"text": ["If so, how?", "Do you have a code repository of some kind?", "How do you keep track of those useful examples?"], "tag": "p", "senID": 11}, {"text": ["I'm on the verge of undertaking to write my own repository, to keep track of the fabulous C#, SQL, jQuery code, etc that I create or come across. "], "tag": "p", "senID": 12}, {"text": ["Seriously.", "If there are sites or applications that makes it easy to save examples and snippets, tag them perhaps, and FIND them later -- please post the link."], "tag": "p", "senID": 13}, {"text": ["Thanks, Hoytster"], "tag": "p", "senID": 14}]