[{"text": ["What's the most unsound program you've had to maintain?"], "tag": "h2", "senID": 0}, {"text": ["I periodically am called upon to do maintenance work on a system that was built by a real rocket surgeon.", "There's so much wrong with it that it's hard to know where to start.  "], "tag": "p", "senID": 1}, {"text": ["No, wait, I'll start at the beginning:  in the early days of the project, the designer was told that the system would need to scale, and he'd read that a source of scalability problems was traffic between the application and database servers, so he made sure to minimize this traffic.", "How?", "By putting all of the application logic in SQL Server stored procedures."], "tag": "p", "senID": 2}, {"text": ["Seriously.", "The great bulk of the application functions by the HTML front end formulating XML messages.", "When the middle tier receives an XML message, it uses the document element's tag name as the name of the stored procedure it should call, and calls the SP, passing it the entire XML message as a parameter.", "It takes the XML message that the SP returns and returns it directly back to the front end.", "There is no other logic in the application tier."], "tag": "p", "senID": 3}, {"text": ["(There was some code in the middle tier to validate the incoming XML messages against a library of schemas.", "But I removed it, after ascertaining that 1) only a small handful of messages had corresponding schemas, 2) the messages didn't actually conform to these schemas, and 3) after validating the messages, if any errors were encountered, the method discarded them.", "\"This fuse box is a real time-saver - it comes from the factory with pennies pre-installed!", "\")"], "tag": "p", "senID": 4}, {"text": ["I've seen software that does the wrong thing before.", "Lots of it.", "I've written quite a bit.", "But I've never seen anything like the steely-eyed determination to do the wrong thing, at every possible turn, that's embodied in the design and programming of this system."], "tag": "p", "senID": 5}, {"text": ["Well, at least he went with what he knew, right?", "Um.", "Apparently, what he knew was Access.", "And he didn't really understand Access.", "Or databases."], "tag": "p", "senID": 6}, {"text": ["Here's a common pattern in this code:"], "tag": "p", "senID": 7}, {"code": "<pre>\nSELECT @TestCodeID FROM TestCode WHERE TestCode = @TestCode\n\nSELECT @CountryID FROM Country WHERE CountryAbbr = @CountryAbbr\n\nSELECT Invoice.*, TestCode.*, Country.*\n   FROM Invoice\n   JOIN TestCode ON Invoice.TestCodeID = TestCode.ID\n   JOIN Country ON Invoice.CountryID = Country.ID\n   WHERE Invoice.TestCodeID = @TestCodeID AND Invoice.CountryID = @CountryID\n</pre>\n", "senID": 8}, {"text": ["Okay, fine.", "You don't trust the query optimizer either.", "But how about this?", "(Originally, I was going to post this in What's the best comment in source code you have ever encountered?", "but I realized that there was so much more to write about than just this one comment, and things just got out of hand.", ")  At the end of many of the utility stored procedures, you'll see code that looks like the following:"], "tag": "p", "senID": 9}, {"code": "<pre>\n-- Fix NULLs\nSET @TargetValue = ISNULL(@TargetValue, -9999)\n</pre>\n", "senID": 10}, {"text": ["Yes, that code is doing exactly what you can't allow yourself to believe it's doing lest you be driven mad.", "If the variable contains a NULL, he's alerting the caller by changing its value to -9999.", "Here's how this number is commonly used:"], "tag": "p", "senID": 11}, {"code": "<pre>\n-- Get target value\nEXEC ap_GetTargetValue @Param1, @Param2, OUTPUT @TargetValue\n-- Check target value for NULL value\nIF @TargetValue = -9999\n    ...\n</pre>\n", "senID": 12}, {"text": ["Really."], "tag": "p", "senID": 13}, {"text": ["For another dimension of this system, see the article on thedailywtf.com entitled I Think I'll Call Them \"Transactions\".", "I'm not making any of this up.", "I swear."], "tag": "p", "senID": 14}, {"text": ["I'm often reminded, when I work on this system, of Wolfgang Pauli's famous response to a student:  \"That isn't right.", "It isn't even wrong."], "tag": "p", "senID": 15}, {"text": ["This can't really be the very worst program ever.", "It's definitely the worst one I've worked"], "tag": "p", "senID": 16}]