[{"text": ["Binary Search in Python"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Is there a library function that performs binary search on a list/tuple and return the position of the item if found and 'False' (-1, None, etc.", ") if not?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I found the functions bisect_left/right in the bisect module, but they still return a position even if the item is not in the list.", "That's perfectly fine for their intended usage, but I just want to know if an item is in the list or not (don't want to insert anything)."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "bisect module", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/bisect.html"}]}, {"text": ["I thought of using bisect_left and then checking if the item at that position is equal to what I'm searching, but that seems cumbersome (and I also need to do bounds checking if the number can be larger than the largest number in my list).", "If there is a nicer method I'd like to know about it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Edit To clarify what I need this for: I'm aware that a dictionary would be very well suited for this, but I'm trying to keep the memory consumption as low as possible.", "My intended usage would be a sort of double-way look-up table.", "I have in the table a list of values and I need to be able to access the values based on their index.", "And also I want to be able to find the index of a particular value or None if the value is not in the list."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Edit", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Using a dictionary for this would be the fastest way, but would (approximately) double the memory requirements."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I was asking this question thinking that I may have overlooked something in the Python libraries.", "It seems I'll have to write my own code, as Moe suggested."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]