[{"text": ["Can I run a Python script as a service (in Windows)?", "How?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I am sketching the architecture for a set of programs that share various interrelated objects stored in a database.", "I want one of the programs to act as a service which provides a higher level interface for operations on these objects, and the other programs to access the objects through that service."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I am currently aiming for Python and the Django framework as the technologies to implement that service with.", "I'm pretty sure I figure how to daemonize the Python program in Linux.", "However, it is an optional spec item that the system should support Windows.", "I have little experience with Windows programming and no experience at all with Windows services."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Can I run Python programs as a Windows service (i. e. run it automatically without user login)?", "I won't necessarily have to implement this part, but I need a rough idea how it would be done in order to decide whether to design along these lines."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Edit: Thanks for all the answers so far, they are quite comprehensive.", "I would like to know one more thing:How is Windows aware of my service?", "Can I manage it with the native Windows utilities?Basically, what is the equivalent of putting a start/stop script in /etc/init.d?"], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "Edit: Thanks for all the answers so far, they are quite comprehensive. I would like to know one more thing:How is Windows aware of my service? Can I manage it with the native Windows utilities?Basically, what is the equivalent of putting a start/stop script in /etc/init.d?", "childNum": 1, "tag": "i", "pos": -1, "childList": [{"text": "How is Windows aware of my service? Can I manage it with the native Windows utilities?", "tag": "b"}]}, {"text": "How is Windows aware of my service? Can I manage it with the native Windows utilities?", "childNum": 0, "tag": "b", "pos": -1, "childList": []}]}]