[{"text": ["Getting a job in the games industry as a developer, just knowing a game engine"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I recently enrolled in a community college for games developement.", "But I am skeptical about the curriculum.", "I have no experience in the gaming industry so I wouldn't be able to tell whether it's a good investment or not.", "So I am asking you."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I don't want to get too much into the details of all the classes I am taking so I will try to be brief.", "By the time I graduate, I should have a understanding of how a game engine works.", "I will be working with the Unreal Engine to develop a Multiplayer game from scratch.", "So in the process of my final project,  I will learn how to work within the Unreal Engine, learn Python and learn how to use its API to connect to a remote server and build game mechanics.", "Overall I will also recieve an associates degree in game development.", "I learn C++ but not C. The director said he was trying to implement C in the program as well."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Unreal Engine", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Unreal_Engine"}]}, {"text": ["What I notice is I will not learn how to build a 3D game engine from scratch.", "They do not teach any artificial intelligence (AI).", "I will not learn how to work with the graphics card using a graphics API such as DirectX or OpenGL.", "I know building a game engine from scratch is a little complex, but at the same time the track is requiring me to take some advanced mathematics courses such as calculus and geometry 1 and 2.", "I also got to take a physics class.", "I just think that's a little much for just learning how to use the Unreal Engine but not actually build one or try to learn the anatomy of a games engine."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Is this good enough to possibly land my a job in the industry?", "If I left anything out or was not detail, please feel free to ask more questions."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I do learn data structures and algorithms."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]