[{"text": ["As a Java programmer learning Python, what should I look out for?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["Much of my programming background is in Java, and I'm still doing most of my programming in Java.", "However, I'm starting to learn Python for some side projects at work, and I'd like to learn it as independent of my Java background as possible - i.e.", "I don't want to just program Java in Python.", "What are some things I should look out for?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["A quick example - when looking through the Python tutorial, I came across the fact that defaulted mutable parameters of a function (such as a list) are persisted (remembered from call to call).", "This was counter-intuitive to me as a Java programmer and hard to get my head around.", "(See here and here if you don't understand the example."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "here", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/1132941/least-astonishment-in-python-the-mutable-default-argument"}, {"href": "http://stackoverflow.com/questions/2335160/what-is-the-scope-of-a-defaulted-parameter-in-python", "text": "here", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Someone also provided me with this list, which I found helpful, but short.", "Anyone have any other examples of how a Java programmer might tend to misuse Python...?", "Or things a Java programmer would falsely assume or have trouble understanding?"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "this", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://dirtsimple.org/2004/12/python-is-not-java.html"}]}, {"text": ["Edit: Ok, a brief overview of the reasons addressed by the article I linked to to prevent duplicates in the answers (as suggested by Bill the Lizard).", "(Please let me know if I make a mistake in phrasing, I've only just started with Python so I may not understand all the concepts fully.", "And a disclaimer - these are going to be very brief, so if you don't understand what it's getting at check out the link."], "childNum": 3, "tag": "p", "senID": 4, "childList": [{"text": "Edit", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "just", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "very", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"tag": "ul", "num": 5, "lis": [{"text": "A static method in Java does not translate to a Python classmethod", "tag": "none", "senID": 5}, {"text": "A switch statement in Java translates to a hash table in Python", "tag": "none", "senID": 6}, {"text": "Don't use XML", "tag": "none", "senID": 7}, {"text": "Getters and setters are evil (hey, I'm just quoting :) )", "tag": "none", "senID": 8}, {"text": "Code duplication is often a necessary evil in Java (e.g. method overloading), but not in Python", "tag": "none", "senID": 9}]}, {"text": ["(And if you find this question at all interesting, check out the link anyway.", ":) It's quite good."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}]