[{"text": ["Why do we need tuples in Python (or any immutable data type)?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["I've read several python tutorials (Dive Into Python, for one), and the language reference on Python.org - I don't see why the language needs tuples."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Tuples have no methods compared to a list or set, and if I must convert a tuple to a set or list to be able to sort them, what's the point of using a tuple in the first place?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Immutability?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Why does anyone care if a variable lives at a different place in memory than when it was originally allocated?", "This whole business of immutability in Python seems to be over emphasized."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["In C/C++ if I allocate a pointer and point to some valid memory, I don't care where the address is located as long as it's not null before I use it."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Whenever I reference that variable, I don't need to know if the pointer is still pointing to the original address or not.", "I just check for null and use it (or not)."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["In Python, when I allocate a string (or tuple) assign it to x, then modify the string, why do I care if it's the original object?", "As long as the variable points to my data, that's all that matters."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"code": "<pre>\n<code>\n &gt;&gt;&gt; x='hello'\n&gt;&gt;&gt; id(x)\n1234567\n&gt;&gt;&gt; x='good bye'\n&gt;&gt;&gt; id(x)\n5432167\n</code>\n</pre>\n", "senID": 8}, {"text": ["x still references the data I want, why does anyone need to care if its id is the same or different?"], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "x", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}]