[{"text": ["Are there statistical studies that indicates that Python is \"more productive\"?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["If I do a google search with the string  \"python productive\" the first results is a page http://www.ferg.org/projects/python_java_side-by-side.html claiming that \"python is more productive of Java\".", "Many Python programmers that I have talked with claim that Python is \"more productive\", and most of them report the arguments listed in the above cited article."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.ferg.org/projects/python_java_side-by-side.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.ferg.org/projects/python_java_side-by-side.html"}]}, {"text": ["The article could be summarized in these stametements:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["But the article does not reports any statisticals evidences that support the hypothesis that a more terse code could be developed (not written) in lesser time."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Do you know if there any article that reports statistical evidences that Python is more productive of something else?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Update:"], "childNum": 0, "tag": "h2", "senID": 5, "childList": []}, {"text": ["I'm not interested in adovacy arguments.", "Please do not tell why something should be more productive of something else.", "I'm interested in studies that measures that the use of something is related or not related to the productivity."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "should", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["I'm interested in statisticals evidences.", "If you claim that the productivity depends from many other factors then there should be a statistical study that proves that the language choiche is not statistically correlated to the productivity."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]