[[{"text": ["Cython is a pretty cool tool in itself, well worth learning, and is surprisingly close to the Python syntax.", "If you do any scientific computing with Numpy, then Cython is the way to go because it integrates with Numpy for fast matrix operations."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Cython is a superset of Python language.", "You can throw any valid Python file at it, and it will spit out a valid C program.", "In this case, Cython will just map the Python calls to the underlying CPython API.", "This results in perhaps a 50% speedup because your code is no longer interpreted."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["To get some optimizations, you have to start telling Cython additional facts about your code, such as type declarations.", "If you tell it enough, it can boil the code down to pure C. That is, a for loop in Python becomes a for loop in C. Here you will see massive speed gains.", "You can also link to external C programs here."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Using Cython code is also incredibly easy.", "I thought the manual makes it sound difficult.", "You literally just do:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n $ cython mymodule.pyx\n$ gcc [some arguments here] mymodule.c -o mymodule.so\n</code>\n</pre>\n", "senID": 4}, {"text": ["and then you can import mymodule in your Python code and forget entirely that it compiles down to C. "], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "import mymodule", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["In any case, because Cython is so easy to setup and start using, I suggest trying it to see if it suits your needs.", "It won't be a waste if it turns out not to be the tool you're looking for."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["ctypes is your best bet for getting it done quickly, and it's a pleasure to work with as you're still writing Python!"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "ctypes", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["I recently wrapped an FTDI driver for communicating with a USB chip using ctypes and it was great.", "I had it all done and working in less than one work day.", "(I only implemented the functions we needed, about 15 functions)."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "FTDI", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.ftdichip.com/"}]}, {"text": ["We were previously using a third-party module, PyUSB, for the same purpose.", "PyUSB is an actual C/Python extension module.", "But PyUSB wasn't releasing the GIL when doing blocking reads/writes, which was causing problems for us.", "So I wrote our own module using ctypes, which does release the GIL when calling the native functions."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "PyUSB", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://bleyer.org/pyusb/"}]}, {"text": ["One thing to note is that ctypes won't know about #define constants and stuff in the library you're using, only the functions, so you'll have to redefine those constants in your own code."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "#define", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Here's an example of how the code ended up looking (lots snipped out, just trying to show you the gist of it):"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n from ctypes import *\n\nd2xx = WinDLL('ftd2xx')\n\nOK = 0\nINVALID_HANDLE = 1\nDEVICE_NOT_FOUND = 2\nDEVICE_NOT_OPENED = 3\n\n...\n\ndef openEx(serial):\n    serial = create_string_buffer(serial)\n    handle = c_int()\n    if d2xx.FT_OpenEx(serial, OPEN_BY_SERIAL_NUMBER, byref(handle)) == OK:\n        return Handle(handle.value)\n    raise D2XXException\n\nclass Handle(object):\n    def __init__(self, handle):\n        self.handle = handle\n    ...\n    def read(self, bytes):\n        buffer = create_string_buffer(bytes)\n        count = c_int()\n        if d2xx.FT_Read(self.handle, buffer, bytes, byref(count)) == OK:\n            return buffer.raw[:count.value]\n        raise D2XXException\n    def write(self, data):\n        buffer = create_string_buffer(data)\n        count = c_int()\n        bytes = len(data)\n        if d2xx.FT_Write(self.handle, buffer, bytes, byref(count)) == OK:\n            return count.value\n        raise D2XXException\n</code>\n</pre>\n", "senID": 5}, {"text": ["Someone did some benchmarks on the various options."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "some benchmarks", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://tungwaiyip.info/blog/2009/07/16/ctype%5Fperformance%5Fbenchmark"}]}, {"text": ["I might be more hesitant if I had to wrap a C++ library with lots of classes/templates/etc.", "But ctypes works well with structs and can even callback into Python."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "callback", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/ctypes.html#callback-functions"}]}], [{"text": ["I'll throw another one out there: SWIG"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "SWIG", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.swig.org/Doc1.3/Python.html"}]}, {"text": ["It's easy to learn, does a lot of things right, and supports many more languages so the time spent learning it can be pretty useful."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you use SWIG, you are creating a new python extension module, but with SWIG doing most of the heavy lifting for you."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Personally, I'd write an extension module in C. Don't be intimidated by Python C extensions -- they're not hard at all to write.", "The documentation is very clear and helpful.", "When I first wrote a C extension in Python, I think it took me about an hour to figure out how to write one -- not much time at all."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you have already a library with a defined  API, I'll think ctypes it's the best option, as you only have to do a little initialization and then more or less call the library the way you're used to."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I think Cython or creating an extension module in C (which it's not very difficult) are more useful when you've need need new code, e.g.", "calling that library and do some complex, time-consuming tasks, and then passing the result to Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Another approach, for simple programs, is directly do a different process (compiled externally), outputting the result to standard output and call it with subprocess module.", "Sometimes it's the easiest approach."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For example, if you make a console C program that works more or less that way"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n $miCcode 10\nResult: 12345678\n</code>\n</pre>\n", "senID": 4}, {"text": ["You could call it from Python"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n &gt;&gt;&gt; import subprocess\n&gt;&gt;&gt; p = subprocess.Popen(['miCcode', '10'], shell=True, stdout=subprocess.PIPE)\n&gt;&gt;&gt; std_out, std_err = p.communicate()\n&gt;&gt;&gt; print std_out\nResult: 12345678\n</code>\n</pre>\n", "senID": 6}, {"text": ["With a little string formating, you can take the result in any way you want.You can also capture the standard error output, so it's quite flexible."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Warning: a Cython core developer's opinion ahead."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I almost always recommend Cython over ctypes.", "The reason is that it has a much smoother upgrade path.", "If you use ctypes, many things will be simple at first, and it's certainly cool to write your FFI code in plain Python, without compilation, build dependencies and all that.", "However, at some point, you will almost certainly find that you have to call into your C library a lot, either in a loop or in a longer series of interdependent calls, and you would like to speed that up.", "That's the point where you'll notice that you can't do that with ctypes.", "Or, when you need callback functions and you find that your Python callback code becomes a bottleneck, you'd like to speed it up and/or move it down into C as well.", "Again, you cannot do that with ctypes.", "So you have to switch languages at that point and start rewriting parts of your code, potentially reverse engineering your Python/ctypes code into plain C, thus spoiling the whole benefit of writing your code in plain Python in the first place."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["With Cython, OTOH, you're completely free to make the wrapping and calling code as thin or thick as you want.", "You can start with simple calls into your C code from regular Python code, and Cython will translate them into native C calls, without any additional calling overhead, and with an extremely low conversion overhead for Python parameters.", "When you notice that you need even more performance at some point where you are making too many expensive calls into your C library, you can start annotating your surrounding Python code with static types and let Cython optimise it straight down into C for you.", "Or, you can start rewriting parts of your C code in Cython in order to avoid calls and to specialise and tighten your loops algorithmically.", "And if you need a fast callback, just write a function with the appropriate signature and pass it into the C callback registry directly.", "Again, no overhead, and it gives you plain C calling performance.", "And in the much less likely case that you really cannot get your code fast enough in Cython, you can still consider rewriting the truly critical parts of it in C (or C++ or Fortran) and call it from your Cython code naturally and natively.", "But then, this really becomes the last resort instead of the only option."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So, ctypes is nice to do simple things and to quickly get something running.", "However, as soon as things start to grow, you'll most likely come to the point where you notice that you'd better used Cython right from the start."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["ctypes is great when you've already got a compiled library blob to deal with (such as OS libraries).", "The calling overhead is severe, however, so if you'll be making a lot of calls into the library, and you're going to be writing the C code anyway (or at least compiling it), I'd say to go for cython.", "It's not much more work, and it'll be much faster and more pythonic to use the resulting pyd file."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "ctypes", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://python.net/crew/theller/ctypes/"}, {"text": "cython", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.cython.org/"}]}, {"text": ["I personally tend to use cython for quick speedups of python code (loops and integer comparisons are two areas where cython particularly shines), and when there is some more involved code/wrapping of other libraries involved, I'll turn to Boost.Python.", "Boost.Python can be finicky to set up, but once you've got it working, it makes wrapping C/C++ code straightforward."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Boost.Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.boost.org/doc/libs/1%5F41%5F0/libs/python/doc/index.html"}]}, {"text": ["cython is also great at wrapping numpy (which I learned from the SciPy 2009 proceedings), but I haven't used numpy, so I can't comment on that."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "numpy", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://numpy.scipy.org/"}, {"href": "http://conference.scipy.org/proceedings/SciPy2009/", "text": "SciPy 2009 proceedings", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["There's also one possibility to use GObject Introspection for libraries that are using GLib."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "GObject Introspection", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://live.gnome.org/GObjectIntrospection"}, {"href": "http://developer.gnome.org/glib/", "text": "GLib", "childNum": 0, "tag": "a", "childList": []}]}]]