[[{"text": ["A quick try revealed that PySide was compatible with my PyQt applications with minor or no modifications at all.", "Seems to be in a pretty good shape already."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Just discovered PySide today.", "I am developing closed-source software using the commercial PyQt license.", "I tested PySide on some of my code.", "Replace PyQt4 by PySide everywhere and the code works as is.", "Only exceptions are pyqtSIGNAL and pyqtsignature, recent additions to PyQt4 which I (unfortunately) use to some extent.", "I will probably try to run my existing code (now roughly 17.000 lines) with PySide and see what happens.", "So far I am impressed."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["There's basically three pivot points that I think about when it comes to PyQt vs. PySide."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Longevity:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["PySide is still being updated and maintained, commercial support is\navailable.", "With Nokia's future somewhat in question it is difficult to say what the future of PySide is."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["PyQt is still being developed and maintained, commercial support is available.", "I could be wrong, but I'm pretty sure its maintained by one guy - or at most a small consulting firm.", "They've got a good track record and don't appear to be going away any time soon.", "But, at the same time, lets hope he/they don't get hit by a bus."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]}, {"text": ["Activity:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["PySide is being actively developed, there seems to be community support. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["PyQt is being actively developed, and has a good + long track record."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]}, {"text": ["License:"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["PySide is distributed under LGPL license"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["PyQt is distributed under GPL license with an option for commercial support"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]}, {"text": ["The license issue alone got me to switch to PySide, but everyone has different criteria."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}], [{"text": ["Haven't used it yet, but from their site I gather that it is not yet production ready.", "(Only supports Linux/X11 for starters.", ")  But they claim that a goal of their first release is to be API compatible with PyQt, you just need to change your imports."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So for now it's probably best to develop for PyQt.", "It'll be easy to switch in the future."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Update: As mentioned in the comments, this is no longer the case.", "PySide is ready for use."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Update:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["One thing is if you are developing for mobile platforms, PySide has started on a Python version of the Mobility APIs.", "PyQt doesn't seem to have anything going on on that sector. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["PyQt is licensed via GPL or the PyQT commercial license.", "PyQt supports Python 3.x.", "PySide is licensed via LGPL but does not support Python 3.x (asthough this support is expected to make it in the future."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["A recent caveat that's come up is that Nokia has sold Qt.", "This puts PySide's development in a bit of limbo.", "PySide was started by and is primarily developed by Nokia, so if Nokia is moving away from Qt then that makes PySide's future uncertain."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Nokia has sold Qt.", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pcpro.co.uk/news/365767/nokia-sells-off-qt-development-platform"}]}], [{"text": ["What about licenses and license incompatibilities between the two?", "Some care to explain briefly what you are allowed to do with one and the other?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]