[[{"text": ["I do not work in the gaming industry, but i do know quite a few people who had taken a similar degree at Aalborg University in Denmark (This is a 5-year Masters Degree) and they have problems getting jobs in the gaming industry."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I would recommend going for a broader education like software-engineer and do game programming in your spare time.", "You wont get any education in game engines unless you have the possibility to do it in semester projects (we had).", "This way you will come out with an education that can be used widely in the industry along with the gaming industry."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["but thats just my 2 cents"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I work in the game industry and recently had a long discussion with several engineers here about the quality of a \"game development\" degree."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My opinion and I believe a more prevalent opinion than ten years ago is that a well educated generalist who has a passion for games but no real experience with existing game engines aside from their own hobby work is preferable to someone who has been school in the use of a single engine without consideration for its inner workings."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So, my advice - get a good CS degree from a good school and try and spend as much of your own time on hobby game projects as you can, contribute to open source game development efforts and make some demos.", "If you can prove you're good at several aspects of making games (and there are many many aspects these days) and if you have a good solid CS education to back up your passion then you'll be in a lot better shape than just knowing how to use Unreal."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Companies such as Blizzard typically require a 4-year degree in computer science or equivalent for their entry level game programming positions.", "It is likely your best bet (and widest range of career options down the road) will be to transfer to a 4-year school and get a Bachelor's in Computer Science."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Typically if you have built a demo on your own time, that helps get you a job over the other 4-year candidates.", "Are you familiar with Gamasutra or Gamedev?", "They will be a good help for you."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["edit: also, there's a lot out there besides programming in the game industry.", "Game designing, art, public relations, etc."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["edit2: Building a game from scratch means building all the code yourself from DirectX on up and not using (ie) the Unreal engine or other engines - you design the engine."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "design", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["edit3:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["To sample some of the top game company hiring practices, what they are looking for today, April 2, 2010, I went and grabbed some jobs from EA, Bungee, Lucasarts, and Blizzard for some current game dev positions, finding what appeared to be the least-qualified programming position, because you would be starting there right out of college (presumably)."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "today, April 2, 2010", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Summarized, the commonalities of what these companies look for is experience, passion for games, strong math and algorithm skills, and strong C++ or Java. "], "childNum": 4, "tag": "p", "senID": 6, "childList": [{"text": "experience", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "passion for games", "childNum": 0, "tag": "em", "childList": []}, {"text": "strong math and algorithm skills", "childNum": 0, "tag": "em", "childList": []}, {"text": "strong C++ or Java", "childNum": 0, "tag": "em", "childList": []}]}, {"tag": "ul", "num": 4, "lis": [{"text": ["For experience, your game-dev AS will provide some of that.", "University coursework almost as a rule isn't like a real product."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "almost", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Passion for games, no one can teach you. "], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Strong theoretical skills, you will probably need from a formal education.", "In my opinion, that's the best technical benefit from formal education; the theoretical knowledge that is centered there. "], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "my", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Strong C++/Java - some of that comes from formal education, most of that comes from your personal projects and study."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}]}, {"text": ["Most other nuts-and-bolts knowledge can be absorbed on your own time.", "The abstract end of software engineering, artificial intelligence - not game AI, but the broader field which game AI comes from -, computer organization/architecture, operating system theories, etc, those typically are impossible to find at Hastings or Barnes and Nobles.", "You will probably not find that information in an AS degree.", "You will hopefully find it in a BS degree to some degree.", "In a good BS program, it will have a MS/PhD program as well, and that will dramatically increase the academic culture to a quality untouchable by other schools (experience speaking here.", "-.-)."], "childNum": 2, "tag": "p", "senID": 11, "childList": [{"text": "Most", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "hopefully", "childNum": 0, "tag": "em", "pos": 3, "childList": []}]}, {"text": ["I also want to point out the communication ability these jobs look for.", "It is worth people's while to take some soft and gooshy humanities courses to work on communication skills, especially communication to those notoriously ambiguous non-programmers.", ":)"], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["EA"], "childNum": 0, "tag": "h2", "senID": 13, "childList": []}, {"text": ["This is the least stringent of the requirements of the jobs I glanced at - the only one that didn't say 4-year degree up front:"], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"code": "<pre>\n<code>\n Primary Responsibilities: \n\n•Development of new games and related features \n•Contribute to the evolvement of our existing games \n•Maintain detailed design documentation throughout the project cycle \nKey Requirements: \n\n•Strong programming knowledge across several languages and platforms including ActionScript 3, Java and/or C++. \n•Solid understanding of algorithms, physics and math. \n•A natural feeling for and understanding of good gameplay mechanics. \n•A wish to learn and share knowledge and experience with other team members. \n•Someone who is open for input and enjoys working in an iterative and agile process. \n•Specific Flash/AS3 knowledge is a plus. \n•Relevant game development and/or demo-scene experience is a plus. \n•Most important of all, you need to love games! \nDesired: \n\n•Experience in relevant game development and/or demo-scene \n•Computer Science degree or related discipline\n</code>\n</pre>\n", "senID": 15}, {"text": ["Bungee"], "childNum": 0, "tag": "h2", "senID": 16, "childList": []}, {"text": ["Of the two jobs listed at the moment, this one did not require a 4-year degree.", "The other one did."], "childNum": 0, "tag": "p", "senID": 17, "childList": []}, {"code": "<pre>\n<code>\n GUI Engineer\nBungee Labs, an Orem, Utah based company, is looking for an experienced GUI developer to be part of the design, development and release of a next-generation service platform as a Service (PaaS) offering. The candidate will be working within a highly talented motivated team of fellow software engineers. Bungee employees are well rewarded for their expertise, drive, initiative, accomplishments and teamwork. \n\nRequirements\nExperience building GUI tools\nExperience writing GUI software\nExperience building custom controls\nProficient in C++ and / or Java\nExperience building Web programs\nMinimum 5 years of experience\n</code>\n</pre>\n", "senID": 18}, {"text": ["Blizzard ##"], "childNum": 0, "tag": "h2", "senID": 19, "childList": []}, {"text": ["Blizzard typically requires 4-year degree or equivalent (I've watched their jobs page for a few years now off and on). "], "childNum": 0, "tag": "p", "senID": 20, "childList": []}, {"text": ["This is the 'associate sw engineer' position, which is the entry-level developer."], "childNum": 0, "tag": "p", "senID": 21, "childList": []}, {"code": "<pre>\n<code>\n Associate Software Engineer\nTeam: Next-Gen MMO\n\nBlizzard Entertainment is looking for a talented and enthusiastic software engineer to work on its next-generation massively multiplayer game. This position is for a software engineer who will focus on network communication and database design and implementation.\nRequirements\nStrong C/C++ programming Skills\nFamiliarity with implementing client/server architecture\nExcellent spoken and written communication skills\nA passion for games\nPluses\nNetworking experience in TCP/IP and UDP protocols\nFluency in procedural SQL programming (MySQL, PL/SQL)\nFamiliarity with relational database architectures\nExperience with code optimization\nMMORPG Gaming Experience\nBS or MS in computer science, mathematics or equivalent experience\nCode samples are required. Please include samples of your work along with your resume and cover letter.\nJob Status: Full-time Permanent\n</code>\n</pre>\n", "senID": 22}, {"text": ["LucasArts"], "childNum": 0, "tag": "h2", "senID": 23, "childList": []}, {"text": ["There didn't seem to be a low-end position open."], "childNum": 0, "tag": "p", "senID": 24, "childList": []}, {"code": "<pre>\n<code>\n The Network Engineer focuses on multiplayer game programming for Xbox360 &amp; PS3. \nProvide technical expertise in network game development and technologies in support of our game development cycle.\nReliably create good quality, performance-minded code.\nProvide a complete task list and schedule for responsible work. These should be complete and accurate. Assist less experienced engineers with the creation of their task lists and schedules. Inform others when the schedule is at risk.\nAssist in the sharing of ideas and exploration of new practices to continually improve the quality of game development within the Company.\nProvide leadership and insight to help the team avoid and overcome obstacles as they arise during development.\nProvide coaching skills to help develop less experienced engineers.\nMaintain a professional attitude during all stages of development.\nExcel as a team member and strive to maximize team and departmental performance.\nRequirements    \n\nB.Sc. Degree in Computer Science preferred, or equivalent game experience.\n3+ years experience in the area of Network Engineering &amp; Multiplayer engineering specifically for console games. \nPrior programming experience on xbox360 or PS3 is a must.\nBroad understanding of computer and game networking systems, including DNS, NAT, firewall, security methods, peer-to-peer and client server models.\nstrong C++ programming skills/experience required.\nShipped at least one title on the target consoles.\nAbility to work independently and to be self-directing required.\nExcellent team and communication skills required.\nPassion for making and playing innovative games.\n</code>\n</pre>\n", "senID": 25}], [{"text": ["I would personally be very cautious about the path that you are taking.", "IMHO, most \"game programming\" degrees are a risky proposition. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Most software developers in the gaming industry are first and foremost software developers.", "They just happen to work on games, and happen to use certain APIs/SDKs which are the engine (e.g., Unreal) or the underlying GFX framework (e.g., DirectX)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It is, in my opinion, far more important to come to such a role with a well-rounded understanding of computer science and development than it is to come with knowledge of a specific engine. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Yes, it's nice to have some of the knowledge of the engine, but you can learn that from a book, and by the time you're graduating there'll be other engines and other paradigms.", "Hell, for all you know, in four years from now Bungee will be developing a facebook version of Halo where master chief tends to a farm. "], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Hell, for all you know, in four years from now Bungee will be developing a facebook version of Halo where master chief tends to a farm.", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["Companies like EA hire their share of CS grads.", "Most of their products were created by CS grads.", "So clearly, not having a gaming degree is not a problem."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["On the other hand, if you have a gaming degree rather than a CS degree, you are going to have a much harder time getting a job outside the gaming industry (and many people don't stay in that industry their entire lives).", "Many employers will look at this degree as a \"lesser degree\" or a \"less serious degree\"."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["There are some useful courses on game design.", "For example, the late Randy Pausch at CMU's Entertainment Technology Center established some very useful coursework there, but not all programs teach on that level and you can learn that stuff from other sources."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["If you can still switch to a more general CS degree, I would personally do that.", "Think about yourself at 40.", "Focusing on a gaming degree at your age is like getting a tramp-stamp... You may come to regret it. "], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["If you're serious about getting into game development, your best avenue might be to create a popular web-based game, a social-media based game, or an iPhone game.", "These today are the few types of games that can still be created by a single individual.", "Success can also demonstrate that you've got something beyond programming skills - anyone can program in an engine but not everyone can design a game.", "These mediums actually carry the benefit of being able to track how many people play them and of some (limited) monetary reward.", "If you do create a successful game, you might have a better chance at getting hired at one of the social gaming or iPhone studios regardless of your degree."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["I work in the games industry.", "Commercial game programming is hard, and not much matters except whether you can do it.", "If you can, build something to prove it.", "The demand is so high that not much else will matter.", "If you can't, nothing else will help."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "hard", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["The two year degree will kick-start your career, but it won't be enough on its own to make you competitive.", "Most programmers I have worked with began programming very young and still teach themselves regularly.", "But the game industry is big and with some experience you may find a job at a smaller company, or as a junior designer, technical artist, or assistant producer.", "Any of these would be a great place to continue learning and practicing game programming.", "When you are ready, you will find there is always room for another capable game programmer."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Edit: Also, I went the 4-year CS degree route, and I can confirm that employers prefer that.", "If you have the patience, it is probably better for you.", "It will mean self-learning rather than college learning for specific technologies, but you will need to be a self-learner eventually anyways.", "The tech will be completely different every five years.", "A strong foundation in CS and math will help."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I think most of these third party game courses are not worth it: do you REALLY need someone else to teach you the basics?", "You will learn more by writing a simple game like pong from start to finish on a platform like python/pygame.", "Those courses are good I guess if you need really basic 'introduction' stuff.", "Nothing gets you a job in games faster than having your own stuff completed and out there.", "As advised here: go for the computing/maths degree and work on small/micro game projects in the meantime.", "Be aware that corporate gaming jobs have high risk of suckage."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If I was starting out today I'd release a few free iphone games during uni... Good luck and try and work for yourself if possible.", "There is a WEALTH of good introductory (online/offline) books out there, which will likely teach you more!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["A debate topic might be what language/API/platform to build your first projects with ;)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The problem with 'going large' without having done a few smaller projects is that you miss out on the foundational stuff and get caught up in complexity and specialised into oblivion."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Assuming you're creative, the degree you describe should provide you access to many \"Game Designer\" positions."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Game Designers are the ones who assemble the levels in the game.", "They work on top of the engines made by programmers and take models, environmental art, etc.", "and combining them with logic and fine tune it all to produce a finished experience.", "Sometimes this involves some light scripting."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you want to be a game programmer, you will likely have to further your education a bit...", "BUT!", "Being a game designer (or tester for that matter) is an excellent foot in the door at any game company.", "It may pay less than programming positions, but it's arguably more fun and social."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Good luck!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["A gaming degree is only 2 years, and you will gain 3 years of additional real world experience which is vital for any programmer.", "You learn important stuff like working with other people (other than programmers) like artists whose demands sometimes are very out-of-this-world, and clients who don't know various concepts like technical limitations and game balance."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "gain 3 years of additional real world experience which is vital for any programmer", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["There are various APIs, engines and languages you will learn, these include:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 12, "lis": [{"text": "Graphics APIs: DirectX, OpenGL", "tag": "none", "senID": 2}, {"text": "Engines: Ogre3D, Crystal Space, Unreal", "tag": "none", "senID": 3}, {"text": "Utilities: SDL, SFML, Boost", "tag": "none", "senID": 4}, {"text": "Database: MySQL, SQLite", "tag": "none", "senID": 5}, {"text": "Sound: FMOD, Audiere", "tag": "none", "senID": 6}, {"text": "Physics: PhysX, Bullet", "tag": "none", "senID": 7}, {"text": "Shaders: HLSL, GLSL and Cg", "tag": "none", "senID": 8}, {"text": "Console: PS3 Cell Dev, Chidori PS3 Engine, XNA", "tag": "none", "senID": 9}, {"text": "Mobile: iPhone SDK, J2ME", "tag": "none", "senID": 10}, {"text": "Forms: Win32, COM, .NET, wxWidgets, FLTK", "tag": "none", "senID": 11}, {"text": "Scripting: Lua, XML and Python", "tag": "none", "senID": 12}, {"text": "Other APIs: Flash AS, Silverlight, Unity3D, Haxe, O3D, Ajax, PHP and HTML", "tag": "none", "senID": 13}]}, {"text": ["The lists of APIs will always change, but that's the fact of the software industry.", "You will need to consistently update and improve your skills.", "Besides learning those programming related topics, you will need certain skills like:"], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Game design and balance", "tag": "none", "senID": 15}, {"text": "Creating tools for designers and artists to use", "tag": "none", "senID": 16}, {"text": "Maya, 3DSMax, Blender", "tag": "none", "senID": 17}, {"text": "Photoshop", "tag": "none", "senID": 18}]}, {"text": ["Designers and artists sometimes fail to follow certain specifications, you may need these skills to be able to edit or convert their models.", "That's all the stuff you'll learn from a gaming degree.", "Thus, not only do game programmers need to know system stuff but stuff like Mathematics, Physics, Networking, Database and Information Systems, Data Structures and Algorithms, and especially Communication all come into play."], "childNum": 0, "tag": "p", "senID": 19, "childList": []}, {"text": ["Furthermore, game programming is hardcore.", "From experience, about 1/2 months nearing a release, I've worked at least 15 hours a day without weekends.", "Once a game programmer, you'll find other programming disciplines pretty trivial.", "What I really like about game programming is that we go on outings (for example, a military base to see how a gun works, or a real world test of vehicular physics), and in my opinion, that's more rewarding, more exciting and more fun than a software engineer."], "childNum": 1, "tag": "p", "senID": 20, "childList": [{"text": "game programming is hardcore", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Lastly, for the video games industry, you need a good portfolio:"], "childNum": 1, "tag": "p", "senID": 21, "childList": [{"text": "you need a good portfolio", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 3, "lis": [{"text": ["3D game.", "It doesn't need to be fantastic like Final Fantasy.", "You only need a simple game like an FPS or a simple Puzzle Adventure or a simple Strategy game."], "childNum": 1, "tag": "p", "senID": 22, "childList": [{"text": "3D game.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["2D game.", "A shooter game, a Super Mario clone, Bomberman, Pacman would be sufficent to show that you have an understanding of concept."], "childNum": 1, "tag": "p", "senID": 23, "childList": [{"text": "2D game.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["But it really depends on what kind of game programming job you want.", "For example, an AI programmer should showcase more impressive concepts like Fuzzy Logic and Neural Network.", "While a Graphics programmer should showcase HDR, Post FXs like motion blur, Depth of Field, Shadow Mapping, Ray Tracing and Parallax mapping."], "childNum": 2, "tag": "p", "senID": 24, "childList": [{"text": "it really depends on what kind of game programming job you want", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "HDR", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/High_dynamic_range_rendering"}]}]}, {"text": ["In the video game industry, degrees don't matter much, it's just to level the playing field (i.e.", "some recruiters will not hire someone without a degree).", "In a nutshell, game programming is very rewarding and I have never once regretted choosing this path."], "childNum": 1, "tag": "p", "senID": 25, "childList": [{"text": "game programming is very rewarding", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}], [{"text": ["There's no reason that you can't do DirectX in your spare time.", "I'm taking a CS degree, but I do more challenging things in my spare time than in my formal education."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think that many hope their \"game degrees\" will make them shoe-ins for game jobs, but that's not really the case.", "While I've seen a few fantastic Full Sail and Digipen grads, most are not fantastic.", "Like anything, you'll get out of your program what you put into it.", "If you do the minimum required to get an A, you probably won't get a game job.", "You've got to push the boundaries somehow, and you've got to be able to show the game companies that you really went above and beyond."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["What exact course you plot for yourself depends on what you want to do.", "The most glamorous work is often the graphics, rendering, full-screen effects, yadda yadda.", "I find that all so tedious, but it's definitely the case that the graphics programmers get all of the members-of-their-preferred-gender.", "Linear algebra is key.", "You'll want to understand at least basic calculus and as much geometry and trigonometry as you can get your hands on.", "You're going to need to go outside of the curriculum, more than likely, as the interview questions you'll face on these topics are going to be important to get right."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Working in games is a lot of work, as the other responses mention, but you're your own commander.", "You're going to need to brace for a lot of demands, but more importantly you'll need to prepare to take care of yourself in the face of these demands.", "School may make you think that you're prepared (OMFG we did 3 hours of classes a day and then like 10 hours on our game!", "), but there's really no comparison."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["To be honest, also, a large part of your introduction is going to be based on how cool your final project is, how well it shows, and if you can speak intelligently about what is complicated under the pretty."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I don't entirely agree with the \"more hours less money,\" btw.", "I make a good bit of kit, and while I haven't exactly shopped around for the best paycheck other industries aren't offering what I'm pulling in.", "Then again, I've been doing it for nigh-on 14 years now so maybe that speaks to it.", "I've worked a lot of hours in the past, and probably will again, but I also stand up for my own needs and I'm not afraid to go home when I'm tired.", "I just dig closing, and it takes a lot of work, and when the team comes together there's nothing like it.", "(I've worked on big sellers and not-big sellers, good games and bad games."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Recap: do what you love.", "If you want to make games, do that.", "Make games outside of school.", "Most companies will probably prefer a BS degree, but if you show something that indicates you know more than your classmates then you have a shot.", "Plus, you've got to persevere; in this economy there are more game developers than there are jobs, so you're competing with people who've actually made games for a living.", "You're going to need something special to shine through the piles of resumes on the HR desk."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Short answer: C++ is fine.", "Also, take the maths courses; they'll be WAY more useful."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Longer answer: Regarding C, if you are handy with C++, C will be no problem.", "Same thing, pretty much, just a few new annoyances.", "(I had to \"teach\" one of my less experienced colleagues C a couple of years ago, so that he could extend a C library we were using.", "He was already a good C++ programmer... so it took about 5 minutes.", "Seriously, it's no big deal."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As for 3D APIs and the like... any place targeting multiple platforms will have some kind of wrapper over the underlying API; any place targeting one platform will be leaving the hardware-specific bits to the people more experienced with that kind of thing.", "(How did they become more experienced?", "Probably by having picked it up as they went along, or by learning it in their spare time whilst studying a non-video-games-related course."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Unless you are actually working on the platform-specific parts -- and, anywhere that doesn't suck, the number of people doing this will be fairly small -- then lack of D3D/OpenGL/blah knowledge won't be a problem, because you'll never see the API that drives the whole thing, just the wrapper that you're using."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Provided you have a good grasp of the usual 3D maths stuff, and you're OK writing state machines, then you should be alright.", "If you really insist on doing graphics, spending time writing interesting shaders and the like will stand you in better stead than any number of \"anatomy of a game engine\" type courses.", "When trying this out on your own, you'll have to get to grips with a lot of API (D3D/OpenGL) muck, but you're unlikely to see any of that when working on the majority of titles for the reasons given above, so it's not worth paying too much attention.", "When doing the same thing commercially, the underlying API and the performance characteristics will be different."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["(I worked in video games for N years.", "When I first started, I'd never written anything like a game... not once a problem.", "I know how to program, so I just picked up how people structure them in general as I went along.", "I rued my youthful avoidance of my maths courses on a weekly basis, though."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["With this knowledge, you may be able to find the job.", "Unreal Engine is popular.", "But there are no warranties. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "may", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["If you want to be able to build an engine yourself, this is another story.", "Try to take apart the Sauerbraten engine, or Quake 3 engine (Sauerbraten will be easier to comprehend).", "Try to make your own first-person shooter game.", "This should give you enough practical experience."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Sauerbraten", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://sauerbraten.org/"}]}]]