[[{"text": ["I lurvvv PyCharm.", "I started using it about 3 months ago and I haven't looked back, and I've tried Eclipse/PyDev, Vim and textmate.", "The JetBrains Ruby IDE also happens to be my favorite Ruby IDE, and same for their Java intelliJ IDE .... they're all great products."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "lurvvv", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 7, "lis": [{"text": "It inspects imports/modules, and lets you quickly jump to definitions and usages.", "tag": "none", "senID": 1}, {"text": "Works well with virtualenv (point the project's python interpreter to the one in your virtualenv folder)", "tag": "none", "senID": 2}, {"text": "Works well with django templates", "tag": "none", "senID": 3}, {"text": "Very customizable", "tag": "none", "senID": 4}, {"text": "Good source control integration", "tag": "none", "senID": 5}, {"text": "KICK ASS diff tool", "tag": "none", "senID": 6}, {"text": "Also great for Javascript development.", "tag": "none", "senID": 7}]}, {"text": ["My setup:"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"senID": 9}], [{"text": ["I played with a little bit tonight and would say it shows promise.", "The integrated debugger and the Django console work really well (almost like Visual Studio) and it's definitely ahead of other Python IDEs I have tried.", "It managed to analyze my existing project code (including offering refactoring suggestions) but I noticed a few problems with the code completion and had trouble configuring my Python project path(s).", "The application also feels a little \"odd\" and out of place on Windows but most cross-platform applications do."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I plan to keep an eye on it and dedicate some real time to using it once the beta release happens this summer."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I &lt;3 PyCharm!", "It does all the stuff that I always wanted a Python/Django IDE to do.", "And best of all, is that it has an integration with most popular CVS out there.", "I have great feeling about this project.", "It make me wander why anyone thought about doing an IDE like this?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Great job JetBrains!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I've been using PyCharm for django development on google app engine and it's great.", "The debugger is very useful compared to any other IDE out there.", "Code completion, refactoring, version control, auto-import and all the other things you would expect from a fully featured IDE is there and is great.", "There are still a few bugs that I've noticed but nothing that really stops me from using it on a daily basis.", "It definitely helps you be more efficient at programming and saves you from wasting time on stupid bugs."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I've used it only a bit, but it was very handy for walking through the Django tutorial.", "Reasonable auto-complete (both Python and HTML), good visualization of project structure, and built-in Django integration (start up the server and view the server log right in the IDE).", "Also integrated debugger, which I miss (my other IDE is Scite)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Really love their products for keyboard tricks and code refactoring/analysis tools (as in Resharper/IntelliJ/RubyMine)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And yes, PyCharm looks really promising as well.", "Hoping to switch to it after release.", "Especially if they support Mako templates (as they consider to do)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["P.S.", "Currently using PyDev in Aptana Studio, sometimes VIM.", "And missing tons of things that JetBrains used to bring into IDEs."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'm sure it will be fine if you put the time into learning how to use it.", "I don't have the time currently so I'm going back to eric IDE for now.", "If I get time I might look at it some more."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Eric IDE is terrible.", "Wing IDE is great, and PyCharm is looking good."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["What I don't like in PyCharm:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["Typing is too slow.", "When I type the word print, the letters n and t appear slowly (about 100 ms after I finished typing).", "This huge latency is not acceptable for me, I need a snappy editor, which is faster than I type.", "I have a fast enough machine with plenty of RAM."], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "print", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "n", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "t", "childNum": 0, "tag": "code", "pos": 3, "childList": []}]}, {"text": ["Can't syntax-highlight Ruby, Perl, PHP etc.", "code -- not even with a plugin.", "Good editors have syntax highlighting for several dozen languages."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]}], [{"text": ["Is it just me or it feels ugly?", "I'm on windows 7 and the whole application feels unnatural."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["See also this 2010-10-16 message by Carlos Daniel Ruvalcaba Valenzuela that appeared on the wingide-users mailing list.", "It describes some differences between WingIDE and PyCharm."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "2010-10-16 message", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wingware.com/pipermail/wingide-users/2010-October/008473.html"}]}]]