[[{"text": ["Django powers over 80% of Python-coded web sites, according to some estimates.", "While it's definitely way more powerful than you need, there is something to be said for just going with the flow."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "is", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["At the other extreme, bare Werkzeug (with WSGI) is quite usable... and Flask is not much more than that (plus Jinja2, but that's quite OK for templating after all).", "Me, I'd go for this."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Take a look at web.py and bottle - both small enough to be simple, and obfuscate complexity enough to make your development rapid."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Alternatively, there is Hyde (see github) that generates static pages for you - depending on how dynamic the data you're displaying is."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Here's a list of Python web frameworks: http://wiki.python.org/moin/WebFrameworks - each of them can be used to build such a site, the choice mostly depends on personal preferences."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://wiki.python.org/moin/WebFrameworks", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/WebFrameworks"}]}, {"text": ["If I needed the site up and running in 10 minutes I'd probably use Zope 2 - it's well suited for the model you're describing (semi-structured CMS-ish content with bits of coding here and there)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Otherwise I'd use repoze.bfg or Pylons (Werkzeug must be similar but I don't have any experience with it).", "I'd only consider Django if I was planning to use its automatic admin or third-party modules - otherwise it feels a bit affected by \"Not Invented Here\" syndrome which forces you into Django-way of doing things once you chose it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you want to showcase yourself as a python webdeveloper, then I think the answer is clearly Django.", "It is the one that is used most throughout the web.", "If you want to just build a quick website that shows your engineering chops in something other then webdesign/coding then I highly recommend Flask.", "It is amazingly simple to get up-and-running.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["An example of when less is more, take a look at RstBlog.", "You can see it in action."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "RstBlog", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://github.com/mitsuhiko/rstblog"}, {"text": "in action", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://lucumr.pocoo.org/"}]}]]