[[{"text": ["Yes, and there are also statistical studies that prove that dogs are more productive than cats.", "Both are equally valid.", ";-)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["by popular demand, here are a couple of \"studies\" - take them with a block of salt!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["and Jeff Atwood's musings are interesting as well"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Jeff Atwood's musings", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.codinghorror.com/blog/archives/000365.html"}]}, {"text": ["the issues of programmer productivity are far more complex than what language is being used.", "Productivity among programmers can vary wildly, and is affected by the problem domain plus many other factors.", "Thus no \"study\" can ever be \"definitive\".", "See Understanding Software Productivity and Productivity Variations Among Software Developers and Teams for additional information."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "Understanding Software Productivity", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.usc.edu/dept/ATRIUM/Papers/Software_Productivity.html"}, {"href": "http://forums.construx.com/blogs/stevemcc/archive/2008/03/27/productivity-variations-among-software-developers-and-teams-the-origin-of-quot-10x-quot.aspx", "text": "Productivity Variations Among Software Developers and Teams", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Finally, the right tool for the right job is still the rule.", "No exceptions."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "the right tool for the right job", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["Yes, there's an excellent paper by Lutz Prechelt on this subject:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["An Empirical Comparison of Seven Programming Languages"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "An Empirical Comparison of Seven Programming Languages", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://page.mi.fu-berlin.de/prechelt/Biblio//jccpprt_computer2000.pdf"}]}, {"text": ["Of course, this paper doesn’t “prove” the superiority of any particular language.", "But it probably comes as close as any scientific study can come to the truth.", "On the other hand, the data of this study is very dated, and in the fast-developing world of software engineering this actually plays an important role since both the languages and the tools have vastly improved over time."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "can", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["All evidence is anecdotal."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You can't ever find published studies that show the general superiority of one language over another because there are too many confounds:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "Individual programmers differ greatly in ability", "tag": "none", "senID": 2}, {"text": "Some tasks are more amenable to a given language/library than others (what constitues representative set of tasks?)", "tag": "none", "senID": 3}, {"text": "Different languages have different core libraries", "tag": "none", "senID": 4}, {"text": "Different languages have different tool chains", "tag": "none", "senID": 5}, {"text": "Interaction of two or more of the above (e.g. familiarity of programmer X with tools Y)", "tag": "none", "senID": 6}, {"text": "etc. the list goes on and on and on", "tag": "none", "senID": 7}]}, {"text": ["Even though you can design experiments to control for some of these, the variability still requires a huge amount of statistical power to get any meaningful result, and no one ever does studies where like 1000 programmers do the exact same task in different languages, so there's never anything definitive."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["The upshot is, each of us knows what the best languages/tools are, and so we can advocate them without fear of being shot down by a published study.", ":)"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}], [{"text": ["General claims about productivity do not necessarily make sense.", "A good software engineer (or project manager) knows what language to pick based on the nature of the project, the requirements of the customer, and the skills of his team."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There is generally no \"one language to rule them all\", though there are clearly languages that are better for certain domains.", "I would not write distributed enterprise applications or device drivers in perl, or games in prolog, but there are great uses for them."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Productivity also depends on tool support (e.g., are there good Python IDEs?", "), on skills, and on the possibility for practitioners to mess up.", "I am generally wary of functional programming in the hands of the average programmer. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If Python automates or simplifies tasks that Java developers building the same applications would frequently have to do, then yes, it may be more productive, but any evidence you get would still be anecdotal."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You can't measure it, but if you're experienced with Java, and then you learn python and try to do stuff with it, you will realize it by yourself. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It's one of those things that can't be quantified, and frankly even if there was a statistical study, I wouldn't be convinced by it.", "You can bring a Java guru and a python newbie and give them a task that is better done with java (maybe because there's a specific library or even built-in functionality for it), and maybe in that case the Java guru will be \"more productive\" than the python newbie."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "maybe", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Some people mention IDEs, in my opinion, you can be productive with python even without an IDE, specially without a beast like Eclipse.", "You don't have cheked exceptions in python, so you don't need a tool to help you deal with that.", "Because everything in python is dynamic, you don't have \"virtual\" methods (although you can mimic them if you really want), so you don't need a tool to help you deal with writing stubs and whatnot.", "etc.", "Many things in Java that require an IDE are simply not applicable to python.", "The only useful thing an IDE in python would do is auto-complete and maybe an interactive shell in the same editor window."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["OK, here's the thing about the \"terse\" argument: Java has so much clutter overhead, i.e.", "public static void main!", "System.stdout.writeln (or what the hell was it?", "), remind me again how do you get input from the user?", "Yea, there's no specific way, you always end up writing a wrapper class around it!!", "Remind me again how do you read a file?", "which library do you have to import?", "oh, go read the API docs and browse through tons of stream readers and writers, while in python, it's just open('filename').", "You can run through all lines of a text file by simply: for line in open('filename'):."], "childNum": 3, "tag": "p", "senID": 3, "childList": [{"text": "always", "childNum": 0, "tag": "em", "pos": 4, "childList": []}, {"text": "open('filename')", "childNum": 0, "tag": "code", "pos": 7, "childList": []}, {"text": "for line in open('filename'):", "childNum": 0, "tag": "code", "pos": 8, "childList": []}]}, {"text": ["In Java there's so much overhead of words it just clutters your mind and diverts your attention from your main task.", "This overhead is a real hindrance, there's only about 7 items you could hold in your short term memory, for line in file fills one item; how many items do you need to fill if you use Java IOStream classes for that task?", "How many slots do you have left for thing related to the actual task you're doing?"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "for line in file", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["I think it really is going to depend on the programmer and what you want to do.", "It's subjective.", "Someone who is a Java God will outperform someone who is only good at python.", "Any study that tries to blanketly state that will be far too broad in what it tries to accomplish."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It's a poorly-conceived question, and as such can't be meaningfully answered.", "If you came to me with a project proposal and asked me what language would be the most productive, the last thing in the world I would look at was a \"scientific\" comparison of how random programmers did implementing an algorithm in different languages."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "last thing in the world", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["I'd ask:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "What does the software have to do?", "tag": "none", "senID": 2}, {"text": "What technical constraints are there on the software?", "tag": "none", "senID": 3}, {"text": "Who will develop the software?", "tag": "none", "senID": 4}, {"text": "What methodology will they use?", "tag": "none", "senID": 5}, {"text": "How will the software be supported?", "tag": "none", "senID": 6}, {"text": "Who will maintain the software?", "tag": "none", "senID": 7}]}, {"text": ["At some stage of the game, I'd rely on \"non-scientific\" or \"anecdotal\" evidence to guide my decision-making.", "I don't need a scientific study to tell me that I shouldn't be developing device drivers in a scripting language.", "Nor do I need one to tell me that a team of C++ programmers is probably going to be able to implement a small project in C++ faster than they'd be able to in Python."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["If at any point in this process, I reached for a study that demonstrated that some developers implemented a specific algorithm in Python twice as fast as other developers implemented it in Java, you'd fire me and get someone else to run the project, if you had any brains."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}], [{"text": ["I think the point about IDEs is a particularly strong one.", "For example, is there a Python IDE on par with Eclipse, offering the same refactoring capabilities?", "Conversely, does an IDE with strong refactoring capabilities promote less intelligent up-front design?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This just highlights the difficulty (or, rather the futility) of declaring one language more/less productive than another."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Well, the very same google search points also a link to an interview to GvR, where he explain the reasons for the productivity gain.", "He lists, in particular:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "interview to GvR", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.artima.com/intv/speed.html"}]}, {"tag": "ul", "num": 4, "lis": [{"text": "terser language, hence less typing", "tag": "none", "senID": 1}, {"text": "built-in data types", "tag": "none", "senID": 2}, {"text": "duck typing", "tag": "none", "senID": 3}, {"text": "rich set of standard libraries", "tag": "none", "senID": 4}]}, {"text": ["About the first point, some further data comes from Code Complete, where Python has an index of 6 equivalent lines of C code , while Java and C++ are on 2.5."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Whatever those numbers mean, something I personally like very much with python is the idea of pythonicity.", "Once you get it, the language is very coherent, and rarely you get the feeling that it gets in your way.", "This helps really a lot in focusing on the problem, instead of the implementation, and therefore achieving an higher development speed."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["I think there are cases where one or the other may be more productive, but the question I always ask is how would this language perform on a mixed team involving people who were not good at programming and would cause more problems than they solve, people who think they know everything and like to write tricky code using all the neat language features available, family oriented programmers who just want to go home at 5:00, etc."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I keep hearing these phrases like \"if the programmer wants to shoot himself in the foot, let him\", as though the speaker has never been on a team."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["When on a project team like the one I just described, I would not consider a language that allowed me to \"Shoot myself in the foot\" if it also meant that any of my teammates could also shoot me in the foot."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The thing is, by definition most projects will either fail or, eventually, be maintained by a team of widely varying talents--so as far as I'm concerned, I have to assume that of all non-trivial projects."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]