[[{"text": ["I don't know where that \"Stackless is 10% faster\" on the Wiki came from, but then again I've never tried to measure those performance numbers.", "I can't think of what Stackless does to make a difference that big."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Stackless is an amazing tool with several organizational/political problems."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The first comes from history.", "Christian Tismer started talking about what eventually became Stackless about 10 years ago.", "He had an idea of what he wanted, but had a hard time explaining what he was doing and why people should use it.", "This is partially because his background didn't have the CS training regarding ideas like coroutines and because his presentations and discussion are very implementation oriented, which is hard for anyone not already hip-deep in continuations to understand how to use it as a solution to their problems."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For that reason, the initial documentation was poor.", "There were some descriptions of how to use it, with the best from third-party contributors.", "At PyCon 2007 I gave a talk on \"Using Stackless\" which went over quite well, according to the PyCon survey numbers.", "Richard Tew has done a great job collecting these, updating stackless.com, and maintaining the distribution when new Python releases comes up.", "He's an employee of CCP Games, developers of EVE Online, which uses Stackless as an essential part of their gaming system."], "childNum": 3, "tag": "p", "senID": 3, "childList": [{"text": "Using Stackless", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://dalkescientific.com/StacklessPyCon2007-Dalke.pdf"}, {"text": "stackless.com", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://stackless.com"}, {"text": "CCP Games", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://ccpgames.com/"}]}, {"text": ["CCP games is also the biggest real-world example people use when they talk about Stackless.", "The main tutorial for Stackless is Grant Olson's \"Introduction to Concurrent Programming with Stackless Python\", which is also game oriented.", "I think this gives people a skewed idea that Stackless is games-oriented, when it's more that games are more easily continuation oriented."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Introduction to Concurrent Programming with Stackless Python", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://members.verizon.net/olsongt/stackless/why_stackless.html"}]}, {"text": ["Another difficulty has been the source code.", "In its original form it required changes to many parts of Python, which made Guido van Rossum, the Python lead, wary.", "Part of the reason, I think, was support for call/cc that was later removed as being \"too much like supporting a goto when there are better higher-level forms.", "\" I'm not certain about this history, so just read this paragraph as \"Stackless used to require too many changes."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Later releases didn't require the changes, and Tismer continued to push for its inclusion in Python.", "While there was some consideration, the official stance (as far as I know) is that CPython is not only a Python implementation but it's meant as a reference implementation, and it won't include Stackless functionality because it can't be implemented by Jython or Iron Python."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["There are absolutely no plans for \"significant changes to the code base\".", "That quote and  reference hyperlink from Arafangion's (see the comment) are from roughly 2000/2001.", "The structural changes have long been done, and it's what I mentioned above.", "Stackless as it is now is stable and mature, with only minor tweaks to the code base over the last several years. "], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "significant changes to the code base", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["One final limitation with Stackless - there is no strong advocate for Stackless.", "Tismer is now deeply involved with PyPy, which is an implementation of Python for Python.", "He has implemented the Stackless functionality in PyPy and considers it much superior to Stackless itself, and feels that PyPy is the way of the future.", "Tew maintains Stackless but he isn't interested in advocacy.", "I considered being in that role, but couldn't see how I could make an income from it."], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "PyPy", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://codespeak.net/pypy/dist/pypy/doc/"}]}, {"text": ["Though if you want training in Stackless, feel free to contact me!", ":)"], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "contact me", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mailto%3adalke@dalkescientific.com"}]}], [{"text": ["If I recall correctly, Stackless was slated for inclusion into the official CPython, but the author of stackless told the CPython folks not to do so, because he planned to do some significant changes to the code base - presumeably he wanted the integration done later when the project was more mature."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'm also interested in the answers here.", "I've played a bit with Stackless and it looks like it would be a good solid addition to standard Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PEP 219 does mention potential difficulties with calling Python code from C code, if Python wants to change to a different stack.", "There would need to be ways to detect and prevent this (to avoid trashing the C stack).", "I think this is tractable though, so I'm also wondering why Stackless must stand on its own."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]