[[{"text": ["For nginx/mod_wsgi, ensure you read:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://blog.dscpl.com.au/2009/05/blocking-requests-and-nginx-version-of.html"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://blog.dscpl.com.au/2009/05/blocking-requests-and-nginx-version-of.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://blog.dscpl.com.au/2009/05/blocking-requests-and-nginx-version-of.html"}]}, {"text": ["Because of how nginx is an event driven system underneath, it has behavioural characteristics which are detrimental to blocking applications such as is the case with WSGI based applications.", "Worse case scenario is that with multiprocess nginx configuration, you can see user requests be blocked even though some nginx worker processes may be idle.", "Apache/mod_wsgi doesn't have this issue as Apache processes will only accept requests when it has the resources to actually handle the request.", "Apache/mod_wsgi will thus give more predictable and reliable behaviour."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The author of nginx mod_wsgi explains some differences to Apache mod_wsgi in this mailing list message."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "in this mailing list message", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://osdir.com/ml/web.nginx.english/2008-05/msg00451.html"}]}], [{"text": ["The main difference is that nginx is built to handle large numbers of connections in a much smaller memory space.", "This makes it very well suited for apps that are doing comet like connections that can have many idle open connections.", "This also gives it quite a smaller memory foot print."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["From a raw performance perspective, nginx is faster, but not so much faster that I would include that as a determining factor."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Apache has the advantage in the area of modules available, and the fact that is pretty much standard.", "Any web host you go with will have it installed, and most techs are going to be very familiar with it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Also, if you use mod_wsgi, it is your wsgi server so you don't even need cherrypy."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Other than that, the best advice I can give is try setting up your app under both and do some benchmarking, since no matter what any one tells you, your mileage may vary."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["One thing that CherryPy's webserver has going for it is that it's a pure python webserver (AFAIK), which may or may not make deployment easier for you.", "Plus, I could see the benefits of using it if you're just using a server for WSGI and static content."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["(shameless plug warning:  I wrote the WSGI code that I'm about to mention)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Kamaelia will have WSGI support coming in the next release.", "The cool thing is that you'll likely be able to either use the pre-made one or build your own using the existing HTTP and WSGI code."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Kamaelia", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.kamaelia.org/Home"}]}, {"text": ["(end shameless plug)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["With that said, given the current options, I would personally probably go with CherryPy because it seems to be the simplest to configure and I can understand python code moreso than I can understand C code."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["You may do best to try each of them out and see what the pros and cons of each one are for your specific application though."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]]