[[{"text": ["Speaking as a game developer, the games industry loves Lua because it's so lightweight.", "The size of Lua's runtime, its performance and memory usage, are an incredible combination compared to other languages.", "Game developers are highly paranoid (whether or not justifiably) about these things, which partly explains why Python, Ruby etc haven't been used much as game scripting languages."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "loves", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["It's also trivial to embed, and highly portable (with all the different console platforms around, this is extremely important)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As a result, Lua is the choice of the games industry, but that doesn't necessarily mean that's all it's good for."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I would also say WoW used it because it was already popular among game developers, not the other way around.", "However, because WoW uses Lua to allow extensibility or customisation, rather than just as an internal technology, it certainly raised Lua's profile outside the game development community."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Languages rarely become popular simply on the merits of their technical features.", "Ruby languished for a decade, more or less, before people noticed it because of Rails.", "Lua would be a complete unknown without WoW's programming APIs.", "Lua is no more a \"gaming\" language than Ruby is a \"web\" language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Lua is a great scripting language: it is extensible, it is simple to learn, and provides the basic primitives such that programmers can use OOP or functional programming (in the same league as Scheme and Javascript).", "It is one of the few scripting languages with support for coroutines, which help a lot when doing multi-threading programming."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In my tests (and I am an addict when it comes to programming languages) ... Lua is the fastest dynamic language I ever worked with.", "It is also very small, and can be embedded easily in a C/C++ application."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think that Lua has all the qualities of a scripting language used for coding game logic.", "And game shops experiment with all kinds of technologies, from Lisp to Haskel, and Lua just happens to be a good compromise between flexibility and speed."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Lua is also not appropriate for web applications for a number of reasons ... lack of libraries, and (most annoying for me) a total lack of unicode support (although Ruby has this same flaw, and few people are complaining ... but still, it matters)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Last time I looked at Lua (just before falling in love with Python), this was version 4.0, 5.0 there too, there were a ton of Lua distributions around: Each with its own set of libraries."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "ton", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["What makes Lua a game language?", "Without a standard library that can actually do stuff I would want to do, it is limited to areas where this isn't much of a problem: Embedded scripting languages.", "You're not supposed to be able to do stuff to anything but your embedding application (game, editor/IDE, etc.", "), and a lack of standard library is a plus here!"], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "do", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "do", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "supposed", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}], [{"text": ["I'm surprised that no one has mentioned the Big Three of network security yet.", "Lua is used as an embedded language in nmap, snort, and wireshark.", "Writing a Wireshark packet dissector is an exercise in concision.", "A carelessly written dissector will really slow you down when you have a few hundred thousand packets to load.", "Lua is fast, as many have said already."], "childNum": 6, "tag": "p", "senID": 0, "childList": [{"text": "Lua", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}, {"text": "nmap", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "snort", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "wireshark", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "Lua", "childNum": 0, "tag": "strong", "pos": 4, "childList": []}, {"text": "fast", "childNum": 0, "tag": "em", "childList": []}]}], [{"text": ["Just to correct David Locke's post, in which he wrote:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python is distributed under it's own license and even clarifies:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "it's own license", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/download/releases/2.5.2/license/"}]}], [{"text": ["Lua was used in games LONG before WoW, and had a good reputation in the industry in those times as well.", "The reason why Lua is picked for games is because it's very lightweight, and simple to learn.", "Ruby and Python are more powerful languages, but to achieve that they lost speed and a bit of simplicity."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It's not a question of which language is \"better\".", "It's a question of which language best suits you needs.", "Ruby became a web language because of Rails, but it's a more than decent general purpose language as well.", "It would just never be useful in games because it's dog slow."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python is used in some big games, but not as often as Lua."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "is", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["It's just a matter of asking yourself which language you would like to use most, although I think that Lua will require a lot of scaffolding code to get a web application properly working."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Adobe also chose Lua for writing Lightroom plug-ins."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I haven't done anything complicated with it yet, but so far, so good..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["and as I have since been told/discovered, most of Lightroom is written in Lua."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["From your link:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In short, Lua is designed to be a small simple language for the scripting of applications.", "There's nothing wrong with this, and it's an excellent language for its intended purpose.", "But for writing applications entirely in Lua, it's a nightmare."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I've been fond of Lua since 2002 - 6 years now.", "It's foremost publicity comes via games, but they are in no way the \"the\" thing of the language.", "Lua wasn't even created with games in mind."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, games do benefit from all the goodies of Lua; high performance, good productivity, small footprint, very high portability.", "One reason why Lua's been big there is that unlike desktop world, game scripts don't traditionally need to be backwards compatible."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["To me personally, Lua is about the merger of Lua and C(++).", "It's about two languages working together, and bringing more onto the table than any single language does.", "Objective-C is like two languages baked in one (bad, because brain needs to jump line-by-line instead of by source file).", "C++ and C# will by definition not gain the dynamicity benefits of dynamic languages."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I know some people behind the Kepler effort; they sure are using it and there's support.", "You won't be alone.", ":) Welcome."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Think about what is required to actually make a game; I think it's actually a compliment to the language.", "Graphics programming (lots of heavy 3D math), interface programming, physics simulation (again, hardcore math), AI, and all running at 60 Hz.", "And on a console, you pretty much have to pack your own OS; there's no 'malloc' or 'fopen', you need to provide memory allocation, IPC, sometimes even a scheduler.", "And your own scripting environment, including all the interface between the core and the VM (you're not just running scripts on top of a framework that somebody else ships, you have to build your own).", "And Lua is perfect for this, because of the reasons mentioned before."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "And", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["So unless you're some kind of badass kernel hacker, you don't get to call game development a task for \"kids\" :)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Although a little off-topic, it's interesting to make the comparison with the (lastest) upcoming replacement to TeX called \"LuaTeX\", which will have a Lua interpreter built-in.", "It was chosen for all the same reasons quoted above that the game industry (apparently) like it for: lightweight and flexible, so it's not dragging a huge swathe of code into a program that is mainly looking for \"just a scripting language\" in which to implement algorithms and perform calculations."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Lua works great as an embedded language in a larger project and it's a lot easier to teach to non-programmers.", "This makes it a good tool in game development, as you can have game designers with close to no knowledge of general programming techniques testing and modifying AI and quest scripts and the like."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Add to this its performance profile (both memory and speed-wise) and its permissive license (you can basically do whatever you want with the interpreter) and you'll see why it's such a hit."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "and", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Actually, LUA was widely used for game scripting way before Blizzard used it for World of Warcraft GUI modding."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["One of the best graphical adventures of all times, Grim Fandango, was fully scripted in LUA. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["On a related note, the newly released MMORPG Warhammer Online also uses a mixture of XML and LUA for it's graphical user interface."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["To add to the amount of applications embedding Lua you can now add VLC."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "VLC", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/VLC_media_player"}]}], [{"text": ["Lua is popular because is it very quick to achieve simple tasks.", "I've been looking at LOVE, which is game framework built using Lua, and you really can get up and running with just a few lines of code.", "You don't need any special IDE (any text editor will do), and your code is not bogged down with a whole bunch of package, class and import declarations.", "Best of all your game will run on Windows, MacOS and Linux without any changes."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "I've been looking at LOVE", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.brighthub.com/hubfolio/matthew-casperson/blog/archive/2010/08/10/making-2d-games-with-lua-and-love.aspx"}]}, {"src": "http://i.stack.imgur.com/oGunE.jpg", "tag": "img", "senID": 1}], [{"text": ["Lua is a scripting language, I've actually only seen/used it in the lighttpd and MySQL (MySQL Proxy) areas.", "I've personally played with it when experimenting with the MySQL proxy."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "lighttpd", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://lighttpd.org"}, {"text": "MySQL Proxy", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://forge.mysql.com/wiki/MySQL_Proxy"}]}, {"text": ["I never heard of it as a game language.", "I think Lua was primarily written to be embedded in other languages and to still offer great performance.", "Due to its nature (compiled bytecode), it's also platform independent which is sometimes a huge advantage."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Some people also think of Lua as a configuration language since its syntax is pretty elegant and simple and suitable for configuration files."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["As for stand-alone, I wouldn't know how to get started.", "I'd have to research this as well.", "If you are just doing it for the sake of research and learning, then it's great - but I wouldn't do it just because it's possible."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["To Till and Tanoku: Lua is not an acronym, it just means moon in Portuguese (coming from Brasil)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Lua is used in many applications beside games.", "For example in SciTE, a lightweight text editor.", "It is also used a lot in embedded platforms.", "A number of applications using Lua are listed in the Lua wiki and Wikipedia.", "Indeed, the fact it is very portable (runs on nearly all platforms, including game consoles from Xbox to NDS), lightweight yet powerful, fast and easy to integrate to C or C++ code (and other languages as well), and with a user-friendly syntax (important to be used by game designers or other non IT professionals) makes it a first choice as scripting language."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "applications using Lua", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.lua.org/uses.html"}]}], [{"text": ["A non-game example of the use of Lua : rewriting DNS answers with the PowerDNS name server."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "rewriting DNS answers", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mailman.powerdns.com/pipermail/pdns-users/2008-June/005471.html"}]}], [{"text": ["The Python Software Foundation License (PSFL) is a BSD-style, permissive free software license which is compatible with the GNU General Public License (GPL).", "Its primary use is for distribution of the Python project software.", "Unlike the GPL the Python license is not a copyleft license, and allows modifications to the source code, as well as the construction of derivative works, without making the code open-source.", "The PSFL is listed as approved on both FSF's approved licenses list, and OSI's approved licenses list."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["tl;dr PSFL != GPL"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I just want to underscore a point that's been made here already.", "The three things that make Lua more attractive to a game developer than other interpreted languages are:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["As the others had said, Lua is chosen primarily because of how lightweight it is.", "The popularity of World of Warcraft has certainly helped Lua become more known to the general public, but it has been in use for a long time.", "Other prominent games that uses Lua are Neverwinter Nights, Everquest 2, and most recently, Crysis."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Check out the Squeezebox Duet and Harmony 1100 from Logitech.", "Both use Lua, and with the Duet you can even write your own plugins in Lua."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Having used Lua extensively, I see why it's not used more often in non-game projects.", "Its dynamic nature and default global scoping doesn't play well for writing large applications.", "It can be done, but you'll have to be aware of those 2 issues and program around them (your own typing scheme and global guards). "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["For some background on the history of Lua in game development check out the slides from the GDC 2010 tutorial \"Lua in Game Dev\": http://kore.net/company/luagamedev.html."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://kore.net/company/luagamedev.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://kore.net/company/luagamedev.html"}]}], [{"text": ["Lua is not used for game engines, games have always been made with C++ simply because its fast.", "Even with the evolution of programing C++ still remains the industry leader, its because programmers can create far more sophisticated game centric algorithms."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Lua is used only as a form of scripting to make mod makers lives easier, though some recent game titles do utilize Lua but not completely the core of the game engine still remains C++.", "It is because its a corporate world and nothing runs directx faster than C++ just try creating an example dx code in another non MS language your guaranteed to run into trouble."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Personally hate Lua its a dirty code to work with, it maybe simple but simple doesn't mean better result and if you have modded any games made with Lua you would quickly realize how messy it is.", "With Lua the simple things will always seem simple."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It is also one of the easiest programming languages to hack you can practically copy paste physical actions within games into a text editor and see its code.", "Thus anyone can write injection code that can screw stuff up if you catch the drift.", "No mmo's don't use lua the companies would be screwed in the rear end.", "Game UI has almost always been done in XML."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["As for still other uses: there's also the Kepler Project for developing webapps, working with any webserver that supports (F)CGI, and even has it's own webserver written entirely in Lua.", "An example project using kepler is the Sputnik wiki engine.", "Another free-standing web project is the Nanoki wiki engine (which in fact only needs Lua and luasocket to be present)."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Kepler Project", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.keplerproject.org/"}, {"text": "Sputnik wiki engine", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://sputnik.freewisdom.org/"}, {"text": "Nanoki wiki engine", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://alt.textdrive.com/nanoki/"}]}, {"text": ["As such a claim as \"Lua is not apt for web programming\" is untrue."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["There are a few unique technical advantages of LUA as mentioned by others.", "1.", "Easy embedding.", ": C++ or C functions doesn't have to be in a shared library!", "This is extremely useful for fast prototyping."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["These advantages make LUA a very decent choice for configuration and prototyping (and thus game programming)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]