[[{"text": ["I can't really give a definitive answer, because by the time I interviewed at Google in 2004 Python was already prominent at Google."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Indeed, there's one apparently attractive explanation that I can definitely deny: it's not that Google uses Python because it employs so many prominent Pythonistas -- rather, most \"prominent Pythonista\" googlers joined Google, at least in part, because we knew about Python's prominence there (possible exceptions include Peter Norvig and Jeremy Hylton, but historically Google's choice of Python predated even them)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["That's definitely why I first got interested (my publisher let me know about the large amount of copies of my book that Google was purchasing -- at first, I thought of it as a good opportunity to sell my freelance consulting service...;-), how I was later able to convince Guido to join us, and, I believe, part of the motivation for such Pythonistas as Greg Stein, Wesley Chun, Fredrik Lundh, Thomas Wouters, Collin Winters, Jeffrey Yasskin, ..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It all got started, I believe, because the very earliest Googlers (Sergey, Larry, Craig, ...) made a good engineering decision: \"Python where we can, C++ where we must\" -- they used (a subset of) C++ for the parts of the software stack where very low latency and/or tight control of memory were crucial, and Python, allowing more rapid delivery and maintenance of programs, for other parts.", "At the time, late '90s, the choice for the latter role was essentially between Python and Perl: other scripting languages were either unripe (I don't think Ruby was around yet, for example) or had other issues and limitations.", "Perl was more mature (especially in terms of its ecosystem of available add-ons via CPAN), but Python was deemed to be more readable and maintainable, and interfacing to C++ libraries (via SWIG) was easier."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Java came in later, covering an intermediate niche -- and more recently of course Go was developed (though I don't believe there's much production work in it yet, as it's still evolving and maturing).", "Some specialized languages such as sawzall are also in the mix for very specific tasks, and of course Javascript is very important for browser-side work."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "sawzall", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://labs.google.com/papers/sawzall.html"}]}, {"text": ["Other languages, incuding the ones that Greg mentioned back in '06, are either \"kind of accidental\" or used for other specific tasks (e.g., Objective C for clients on iPhones or Macs) -- e.g., when Google hired its first system administrators, those employees inevitably came with very strong mastery of Perl and Bash, and often used either of those languages to develop some complex internal system; recoding those in Python (for easier deployment and maintainability) has often happened.", "Others (such as C#) may have been in the mix temporarily due to acquisitions, but, again, recoding in one of the \"main Google languages\" is always a pretty high priority (in C#'s case, recoding would typically be mostly in Java, as the two languages address similar areas in terms of levels of abstraction)."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I have not read the whole article and I don't know how representative it is but maybe this answers your question: Python at Google."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Python at Google", "tag": "a", "pos": 0, "childList": [{"text": "Python at Google", "tag": "strong"}], "childNum": 1, "href": "http://panela.blog-city.com/python_at_google_greg_stein__sdforum.htm"}, {"text": "Python at Google", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["Ok I read most of it, unfortunately it gives not that much insight but I think it is still an interesting article.", "Maybe most important:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "that", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Not to forget that Guido van Rossum the creator of Python is working for Google since 2005 ;)"], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "Guido van Rossum", "tag": "a", "pos": 0, "childList": [{"text": "Guido van Rossum", "tag": "strong"}], "childNum": 1, "href": "http://en.wikipedia.org/wiki/Guido_van_Rossum"}, {"text": "Guido van Rossum", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["I also found this quote but I cannot verify it:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["If you subscribe to Paul Graham's idea that succinctness == power (i.e.", "If I can write code in language X in 10 lines to accomplish what you took 100 lines of language Y, my language is more powerful)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Paul Graham's", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.paulgraham.com/power.html"}]}, {"text": ["These days hardware is cheap, meatware is expensive.", "I know that I can write a lot more, faster, better AND clearer in Python than I can in other languages, simply because the batteries tend to be included.", "Sure, it may be slower but are you really going to notice the difference between .5 seconds and .005 seconds?"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "hardware is cheap, meatware is expensive", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.google.com/View?id=dcsvntt2_25wpjvbbhk"}]}, {"text": ["In a more real-world example, if Google developers write a program in Python where they never have to worry about garbage collection, and Company X writes a program in C++ and they spend 10% of their time tracking down bugs related to memory allocation, guess who's done faster - even if the C++ shop manages to write the rest of their code just as fast."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So yes, I'd say it is a competitive advantage to code in Python."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I was reading about Unladen-Swallow, a project that aims to improve the performance of CPython.", "While browsing through their discussion board I stumbled across this discussion, where Collin Winter (Google employee and Python core developer) answers on the claim that Google employees are being discouraged from using Python for new projects:"], "childNum": 4, "tag": "p", "senID": 0, "childList": [{"text": "Unladen-Swallow", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/unladen-swallow/"}, {"text": "this discussion", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://groups.google.com/group/unladen-swallow/browse_thread/thread/4edbc406f544643e?pli=1"}, {"text": "claim", "childNum": 0, "tag": "em", "childList": []}, {"text": "Google employees are being discouraged from using Python for new projects", "childNum": 0, "tag": "strong", "childList": []}]}]]