[[{"text": ["I have tried app engine for my small quake watch application\nhttp://quakewatch.appspot.com/"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://quakewatch.appspot.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://quakewatch.appspot.com/"}]}, {"text": ["My purpose was to see the capabilities of app engine, so here are the main points:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But overall I think it is excellent for creating apps which do not need lot of background processing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Edit:\nNow task queues can be used for running batch processing or scheduled tasks"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "task queues", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/appengine/docs/python/taskqueue/"}]}, {"text": ["Edit:\nafter working/creating a real application on GAE for a year, now my opnion is that unless you are making a application which needs to scale to million and million of users, don't use GAE.", "Maintaining and doing trivial tasks in GAE is a headache due to distributed nature, to avoid deadline exceeded errors, count entities or do complex queries requires complex code, so small complex application should stick to LAMP."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit:\nModels should be specially designed considering all the transactions you wish to have in future, because entities only in same entity group can be used in a transaction and it makes the process of updating two different groups a nightmare e.g.", "transfer money from user1 to user2 in transaction is impossible unless they are in same entity group, but making them same entity group may not be best for frequent update purposes....\nread this http://blog.notdot.net/2009/9/Distributed-Transactions-on-App-Engine"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "http://blog.notdot.net/2009/9/Distributed-Transactions-on-App-Engine", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://blog.notdot.net/2009/9/Distributed-Transactions-on-App-Engine"}]}], [{"text": ["I am using GAE to host several high-traffic applications.", "Like on the order of 50-100 req/sec.", "It is great, I can't recommend it enough."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My previous experience with web development was with Ruby (Rails/Merb).", "Learning Python was easy.", "I didn't mess with Django or Pylons or any other framework, just started from the GAE examples and built what I needed out of the basic webapp libraries that are provided."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you're used to the flexibility of SQL the datastore can take some getting used to.", "Nothing too traumatic!", "The biggest adjustment is moving away from JOINs.", "You have to shed the idea that normalizing is crucial."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Ben"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["One of the compelling reasons I have come across for using Google App Engine is its integration with Google Apps for your domain.", "Essentially it allows you to create custom, managed web applications that are restricted to the (controlled) logins of your domain. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Most of my experience with this code was building a simple time/task tracking application.", "The template engine was simple and yet made a multi-page application very approachable.", "The login/user awareness api is similarly useful.", "I was able to make a public page/private page paradigm without too much issue.", "(a user would log in to see the private pages.", "An anonymous user was only shown the public page."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I was just getting into the datastore portion of the project when I got pulled away for \"real work\"."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I was able to accomplish a lot (it still is not done yet) in a very little amount of time.", "Since I had never used Python before, this was particularly pleasant (both because it was a new language for me, and also because the development was still fast despite the new language).", "I ran into very little that led me to believe that I wouldn't be able to accomplish my task.", "Instead I have a fairly positive impression of the functionality and features. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["That is my experience with it.", "Perhaps it doesn't represent more than an unfinished toy project, but it does represent an informed trial of the platform, and I hope that helps."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["there is a fully working reddit clone with source code and we are using to build the registration software for PyCon 2009 (beta)."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "reddit clone", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://web2py.appspot.com/reddish"}, {"href": "http://mdp.cti.depaul.edu/appliances", "text": "source code", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://web2py.appspot.com/web2conf", "text": "PyCon 2009", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["The \"App Engine running Django\" idea is a bit misleading.", "App Engine replaces the entire Django model layer so be prepared to spend some time getting acclimated with App Engine's datastore which requires a different way of modeling and thinking about data. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think App Engine is pretty cool for small projects at this point.", "There's a lot to be said for never having to worry about hosting.", "The API also pushes you in the direction of building scalable apps, which is good practice."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["app-engine-patch"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": "Google have promised an SLA and pricing model by the end of 2008.", "tag": "none", "senID": 2}, {"text": "Requests must complete in 10 seconds, sub-requests to web services required to complete in 5 seconds. This forces you to design a fast, lightweight application, off-loading serious processing to other platforms (e.g. a hosted service or an EC2 instance).", "tag": "none", "senID": 3}, {"text": "More languages are coming soon! Google won't say which though :-). My money's on Java next.", "tag": "none", "senID": 4}]}], [{"text": ["This question has been fully answered.", "Which is good.", "But one thing perhaps is worth mentioning.", "The google app engine has a plugin for the eclipse ide which is a joy to work with. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you already do your development with eclipse you are going to be so happy about that. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["To deploy on the google app engine's web site all I need to do is click one little button - with the airplane logo - super. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I used GAE to build http://www.muspy.com"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.muspy.com", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.muspy.com"}]}, {"text": ["It's a bit more than a toy project but not overly complex either.", "I still depend on a few issues to be addressed by Google, but overall developing the website was an enjoyable experience."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you don't want to deal with hosting issues, server administration, etc, I can definitely recommend it.", "Especially if you already know Python and Django."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I used GAE to build a simple application which accepts some parameters, formats and send email.", "It was extremely simple and fast.", "I also made some performance benchmarks on the GAE datastore and memcache services (http://dbaspects.blogspot.com/2010/01/memcache-vs-datastore-on-google-app.html ).", "It is not that fast.", "My opinion is that GAE is serious platform which enforce certain methodology.", "I think it will evolve to the truly scalable platform, where bad practices simply not allowed."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I used GAE for my flash gaming site, Bearded Games.", "GAE is a great platform.", "I used Django templates which are so much easier than the old days of PHP.", "It comes with a great admin panel, and gives you really good logs.", "The datastore is different than a database like MySQL, but it's much easier to work with.", "Building the site was easy and straightforward and they have lots of helpful advice on the site."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Bearded Games", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.beardedgames.com/"}]}], [{"text": ["I used GAE and Django to build a Facebook application.", "I used http://code.google.com/p/app-engine-patch as my starting point as it has Django 1.1 support.", "I didn't try to use any of the manage.py commands because I assumed they wouldn't work, but I didn't even look into it.", "The application had three models and also used pyfacebook, but that was the extent of the complexity.", "I'm in the process of building a much more complicated application which I'm starting to blog about on http://brianyamabe.com."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "http://code.google.com/p/app-engine-patch", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://code.google.com/p/app-engine-patch"}, {"text": "http://brianyamabe.com", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://brianyamabe.com"}]}], [{"text": ["Take a look the the sql game, it is very stable and actually pushed traffic limits at one point so that it was getting throttled by Google.", "I have seen nothing but good news about App Engine, other than hosting you app on servers someone else controls completely."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "sql game", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mysqlgame.appspot.com/"}]}]]