[[{"text": ["1) The memory overhead is the main one, as described in other answers.", "You also pay the compilation cost, which can be prohibitive if you aren't selective.", "From the user reference:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "user reference", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://psyco.sourceforge.net/psycoguide/module-psyco.html"}]}, {"text": ["2) Performance can actually be harmed by Psyco compilation.", "Again from the user guide (\"known bugs\" section):"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "\"known bugs\"", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://psyco.sourceforge.net/psycoguide/tutknownbugs.html"}]}, {"text": ["3) Finally, there are some relatively obscure situations where using Psyco will actually introduce bugs.", "Some of them are listed here."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "listed here", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://psyco.sourceforge.net/psycoguide/bugs.html#bugs"}]}], [{"text": ["See also the caveats section.", "For a hard example, I noticed that my web app with Cheetah-generated templates and DB I/O gained no appreciable speedup."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "caveats section", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://psyco.sourceforge.net/psycoguide/node25.html"}]}], [{"text": ["When using pyglet I found that I couldn't use psyco on the entire app without making my app non-functional.", "I could use it in small sections of math-heavy code, of course, but it wasn't necessary, so I didn't bother."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also, psyco has done strange things with my profiling results (such as, well, not alter them at all from the non-psyco version).", "I suspect it doesn't play nice with the profiling code. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I just don't really use it unless I really want the speed, which is not all that often.", "My priority is algorithm optimization, which generally results in nicer speedups."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["It also depends where your bottleneck is.", "I am mostly doing web apps and there the bottlenecks are probably more IO and database.", "So you should know where to optimize."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also beware that maybe you first should think about your code instead of directly throwing psyco at it.", "So I agree with Devin, that algorithm optimizations should come first and they might have a smaller chance of unwanted sideeffects."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["One should never rely on some magic bullet to fix your problems.", "Using psyco to make a slow program faster is usually not necessary.", "Bad algorithms can be rewritten, and parts that require speed could be written in another language.", "Of course, your question asks why we don't use it for the speed boost anyways, and there's a bit of overhead when you use psyco.", "Psyco uses memory, and those two lines just sorta feel like overhead when you look at them.", "As for my personal reason on why I don't use psyco, it's because it doesn't support x86_64, which I see as the new up and coming architecture (especially with 2038 approaching sooner or later).", "My alternative is pypy, but I'm not entirely fond of that either."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "require", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "feel", "childNum": 0, "tag": "em", "pos": 4, "childList": []}]}], [{"text": ["Quite simply: \"Because the code already runs fast enough\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["A couple of other things:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]