[[{"text": ["There are a couple of differences that I can think of; just thoughtstreaming here, in no particular order:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I have the feeling that trying to address these points by bolting features or DSLs onto a general-purpose programming language doesn't work.", "At least, I have yet to see a convincing implementation of it.", "There is RuSH (Ruby shell), which tries to implement a shell in Ruby, there is rush, which is an internal DSL for shell programming in Ruby, there is Hotwire, which is a Python shell, but IMO none of those come even close to competing with Bash, Zsh, fish and friends."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Actually, IMHO, the best current shell is Microsoft PowerShell, which is very surprising considering that for several decades now, Microsoft has continually had the worst shells evar.", "I mean, COMMAND.COM?", "Really?", "(Unfortunately, they still have a crappy terminal.", "It's still the \"command prompt\" that has been around since, what?", "Windows 3.0?"], "childNum": 4, "tag": "p", "senID": 2, "childList": [{"text": "decades", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "worst", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "evar", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "COMMAND.COM", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["PowerShell was basically created by ignoring everything Microsoft has ever done (COMMAND.COM, CMD.EXE, VBScript, JScript) and instead starting from the Unix shell, then removing all backwards-compatibility cruft (like backticks for command substitution) and massaging it a bit to make it more Windows-friendly (like using the now unused backtick as an escape character instead of the backslash which is the path component separator character in Windows).", "After that, is when the magic happens."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "COMMAND.COM", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "CMD.EXE", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["They address problem 1 and 3 from above, by basically making the opposite choice compared to Python.", "Python cares about large programs first, scripting second.", "Bash cares only about scripting.", "PowerShell cares about scripting first, large programs second.", "A defining moment for me was watching a video of an interview with Jeffrey Snover (PowerShell's lead designer), when the interviewer asked him how big of a program one could write with PowerShell and Snover answered without missing a beat: \"80 characters.", "\" At that moment I realized that this is finally a guy at Microsoft who \"gets\" shell programming (probably related to the fact that PowerShell was neither developed by Microsoft's programming language group (i.e.", "lambda-calculus math nerds) nor the OS group (kernel nerds) but rather the server group (i.e.", "sysadmins who actually use shells)), and that I should probably take a serious look at PowerShell."], "childNum": 3, "tag": "p", "senID": 4, "childList": [{"text": "finally", "childNum": 0, "tag": "em", "pos": 5, "childList": []}, {"text": "neither", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "use", "childNum": 0, "tag": "em", "pos": 7, "childList": []}]}, {"text": ["Number 2 is solved by having arguments be statically typed.", "So, you can write just 123 and PowerShell knows whether it is a string or a number or a file, because the cmdlet (which is what shell commands are called in PowerShell) declares the types of its arguments to the shell.", "This has pretty deep ramifications: unlike Unix, where each command is responsible for parsing its own arguments (the shell basically passes the arguments as an array of strings), argument parsing in PowerShell is done by the shell.", "The cmdlets specify all their options and flags and arguments, as well as their types and names and documentation(!", ") to the shell, which then can perform argument parsing, tab completion, IntelliSense, inline documentation popups etc.", "in one centralized place.", "(This is not revolutionary, and the PowerShell designers acknowledge shells like the DIGITAL Command Language (DCL) and the IBM OS/400 Command Language (CL) as prior art.", "For anyone who has ever used an AS/400, this should sound familiar.", "In OS/400, you can write a shell command and if you don't know the syntax of certain arguments, you can simply leave them out and hit F4, which will bring a menu (similar to an HTML form) with labelled fields, dropdown, help texts etc.", "This is only possible because the OS knows about all the possible arguments and their types.", ") In the Unix shell, this information is often duplicated three times: in the argument parsing code in the command itself, in the bash-completion script for tab-completion and in the manpage."], "childNum": 4, "tag": "p", "senID": 5, "childList": [{"text": "123", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "shell", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "F4", "childNum": 0, "tag": "kbd", "pos": 8, "childList": []}, {"text": "bash-completion", "childNum": 0, "tag": "code", "pos": 10, "childList": []}]}, {"text": ["Number 4 is solved by the fact that PowerShell operates on strongly typed objects, which includes stuff like files, processes, folders and so on."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Number 5 is particularly interesting, because PowerShell is the only shell I know of, where the people who wrote it were actually aware of the fact that shells are essentially dataflow engines and deliberately implemented it as a dataflow engine."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "aware", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Another nice thing about PowerShell are the naming conventions: all cmdlets are named Action-Object and moreover, there are also standardized names for specific actions and specific objects.", "(Again, this should sound familar to OS/400 users.", ") For example, everything which is related to receiving some information is called Get-Foo.", "And everything operating on (sub-)objects is called Bar-ChildItem.", "So, the equivalent to ls is Get-ChildItem (although PowerShell also provides builtin aliases ls and dir&nbsp;&ndash; in fact, whenever it makes sense, they provide both Unix and CMD.EXE aliases as well as abbreviations (gci in this case))."], "childNum": 9, "tag": "p", "senID": 8, "childList": [{"text": "Action-Object", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "Get-Foo", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "Bar-ChildItem", "childNum": 0, "tag": "code", "pos": 3, "childList": []}, {"text": "ls", "childNum": 0, "tag": "code", "pos": 4, "childList": []}, {"text": "Get-ChildItem", "childNum": 0, "tag": "code", "childList": []}, {"text": "ls", "childNum": 0, "tag": "code", "childList": []}, {"text": "dir", "childNum": 0, "tag": "code", "childList": []}, {"text": "CMD.EXE", "childNum": 0, "tag": "code", "childList": []}, {"text": "gci", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["But the killer feature IMO is the strongly typed object pipelines.", "While PowerShell is derived from the Unix shell, there is one very important distinction: in Unix, all communication (both via pipes and redirections as well as via command arguments) is done with untyped, unstructured, ASCII strings.", "In PowerShell, it's all strongly typed, structured objects.", "This is so incredibly powerful that I seriously wonder why noone else has thought of it.", "(Well, they have, but they never became popular.", ") In my shell scripts, I estimate that up to one third of the commands is only there to act as an adapter between two other commands that don't agree on a common textual format.", "Many of those adapters go away in PowerShell, because the cmdlets exchange structured objects instead of unstructured text.", "And if you look inside the commands, then they pretty much consist of three stages: parse the textual input into an internal object representation, manipulate the objects, convert them back into text.", "Again, the first and third stage basically go away, because the data already comes in as objects."], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "inside", "childNum": 0, "tag": "em", "pos": 7, "childList": []}]}, {"text": ["However, the designers have taken great care to preserve the dynamicity and flexibility of shell scripting through what they call an Adaptive Type System. "], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "Adaptive Type System", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Anyway, I don't want to turn this into a PowerShell commercial.", "There are plenty of things that are not so great about PowerShell, although most of those have to do either with Windows or with the specific implementation, and not so much with the concepts.", "(E.g.", "the fact that it is implemented in .NET means that the very first time you start up the shell can take up to several seconds if the .NET framework is not already in the filesystem cache due to some other application that needs it.", "Considering that you often use the shell for well under a second, that is completely unacceptable."], "childNum": 1, "tag": "p", "senID": 11, "childList": [{"text": "not", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["The most important point I want to make is that if you want to look at existing work in scripting languages and shells, you shouldn't stop at Unix and the Ruby/Python/Perl/PHP family.", "For example, Tcl was already mentioned.", "Rexx would be another scripting language.", "Emacs Lisp would be yet another.", "And in the shell realm there are some of the already mentioned mainframe/midrange shells such as the OS/400 command line and DCL.", "Also, Plan9's rc."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}], [{"text": ["Tcl is one such language.", "Mainly because it is designed to primarily be a shell interpreter for CAD programs.", "Here's one hardcore Python programmer's* experience of realising why tcl was designed the way it was: http://www.yosefk.com/blog/i-cant-believe-im-praising-tcl.html"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.yosefk.com/blog/i-cant-believe-im-praising-tcl.html", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.yosefk.com/blog/i-cant-believe-im-praising-tcl.html"}]}, {"text": ["For me, I've written and have been using and improved tcl shell (written in tcl of course) as my main Linux login shell on my homebrew router: Pure tcl readline"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Pure tcl readline", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.tcl.tk/16139"}]}, {"text": ["Some of the reasons I like tcl in general has everything to do with the similarity of it's syntax to traditional shells:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["*Note: not me, I'm a hardcore tcl programmer"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "*Note: not me, I'm a hardcore tcl programmer", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["A shell language has to be easy to use.", "You want to type one-time throw away commands, not small programs.", "I.e.", "you want to type"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n ls -laR /usr\n</code>\n</pre>\n", "senID": 1}, {"text": ["not"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n shell.ls(\"/usr\", long=True, all=True, recursive=True)\n</code>\n</pre>\n", "senID": 3}, {"text": ["This (also) means shell languages don't really care if an argument is an option, a string, a number or something else. "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Also, programming constructs in shells are an add-on, and not even always build-in.", "I.e.", "consider the combination of if and [ in (ba)sh, seq for generating sequences, and so on."], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "if", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}, {"text": "[", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["Finally, shells have specific needs that you need less, or differently in programming.", "I.e.", "pipes, file redirection, process/job control, and so on."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["Who says they aren't?", "Take a look at Zoidberg.", "REPLs (Read Eval Print Loops) make crappy shells because every command must be syntactically correct, and running a program goes from being:"], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Zoidberg", "tag": "a", "pos": 1, "childList": [{"text": "Zoidberg", "tag": "code"}], "childNum": 1, "href": "http://search.cpan.org/~pardus/Zoidberg-0.96/man1/zoiduser.pod"}, {"text": "Zoidberg", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "REPLs", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/REPL"}]}, {"code": "<pre>\n<code>\n foo arg1 arg2 arg3\n</code>\n</pre>\n", "senID": 1}, {"text": ["to"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n system \"foo\", \"arg1\", \"arg2\", \"arg3\"\n</code>\n</pre>\n", "senID": 3}, {"text": ["And don't even get me started on trying to do redirection."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["So, you need a custom shell (rather than a REPL) that understands commands and redirection and the language you want to use to bind commands together.", "I think zoid (the Zoidberg shell) does a pretty good job of it."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "zoid", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["It's cultural.", "The Bourne shell is almost 25 years old; it was one of the first scripting languages, and it was the first good solution to the central need of Unix admins.", "(I.e., a 'glue' to tie all the other utilities together and to do typical Unix tasks without having to compile a damn C program every time.", ")  "], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Bourne shell", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Bourne_shell"}, {"text": "good", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["By modern standards, its syntax is atrocious and its weird rules and punctuation-as-statement style (useful in the 1970s when every byte counted) make it hard for non-admins to penetrate it.", "But it did the job.", "The flaws and shortcomings were addressed by evolutionary improvements in its descendants (ksh, bash, zsh) without having to reconceive the ideas behind it.", "Admins stuck to the core syntax because, weird as it was, nothing else handled the simple stuff better without getting in the way."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "did the job.", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["For complex stuff, Perl came along and morphed into a sort of half-admin, half-application language.", "But the more complex something gets, the more it's seen as an application rather than admin work, so the business people tend to look for \"programmers\" rather than \"admins\" to do it, despite the fact that the right kind of geek tends to be both.", "So that's where the focus went, and the evolutionary improvements to the application capabilities of Perl resulted in...well, Python and Ruby.", "(That's an oversimplification, but Perl was one of several inspirations for both languages."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Result?", "Specialization.", "Admins tend to think modern interpreted languages are too heavyweight for the things they're paid to do every day.", "And overall, they're right.", "They don't need objects.", "They don't care about data structures.", "They need commands.", "They need glue.", "Nothing else tries to do commands better than the Bourne shell concept (except maybe Tcl, which was already mentioned here); and Bourne is good enough."], "childNum": 3, "tag": "p", "senID": 3, "childList": [{"text": "commands.", "childNum": 0, "tag": "em", "pos": 6, "childList": []}, {"text": "glue.", "childNum": 0, "tag": "em", "pos": 7, "childList": []}, {"text": "commands", "childNum": 0, "tag": "em", "pos": 8, "childList": []}]}, {"text": ["Programmers -- who nowadays are having to learn about devops more and more -- look at the limitations of the Bourne shell and wonder how the hell anyone could put up with it.", "But the tools they know, while they certainly lean towards the Unixish style of I/O and file operations, aren't better for the purpose.", "I've written things like backup scripts and file renaming one-offs in Ruby, because I know it better than I know bash, but any dedicated admin could do the same thing in bash -- probably in fewer lines and with less overhead, but either way, it'd work just as well."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "better", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "probably", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["It's a common thing to ask \"Why does everyone use Y when Z is better?", "\" -- but evolution in technology, like evolution in everything else, tends to stop at good enough.", "The 'better' solution doesn't win unless the difference is viewed as a deal-breaking frustration.", "Bourne-type scripting might be frustrating to you, but for the people who use it all the time and for the jobs it was meant for, it's always done the job."], "childNum": 4, "tag": "p", "senID": 5, "childList": [{"text": "Y", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "Z", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "good enough.", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "you", "childNum": 0, "tag": "em", "pos": 3, "childList": []}]}], [{"text": ["I think it's a question of parsing.", "Shell languages assumes by default $ command means you mean a command to run, Python/Ruby need you to do system(\"command\") or what not.", "It's not that they're unsuitable, just that nobody has really done it yet, at least I think so.", "Rush http://rush.heroku.com/ is an example attempt in Ruby, Python has \"iPython\" or something like that."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://rush.heroku.com/", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://rush.heroku.com/"}]}], [{"text": ["Since both are formally programming languages, what you can do in one, you can do in the other.", "Actually it is a design emphasis issue.", "Shell languages are designed for interactive use, while scripting languages aren't.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The basic difference in the design is the storage of data between commands and the scope of variables.", "In Bash, etc.", "you have to jump through hoops to store a value (for example, commands like set a='something'), while in languages like Python you simply use an assignment statement (a = 'something').", "When using the values in a shell language you have to tell the language that your want the value of the variable, while in scripting languages you have to tell the language when you want the immediate value of the string.", "This has effects when used interactively."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "set a='something'", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "a = 'something'", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["In a scripting language where ls was defined as a command"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "ls", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n a = some_value\n\nls a*b\n</code>\n</pre>\n", "senID": 3}, {"text": ["(What does a mean?", "Does this mean some_value * (whatever b is) or do you mean\n           'a'anystring'b'?.", "In a scripting language the default is what is stored in memory for a."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "a", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n ls 'a*b'  Now means what the Unix ls a*b means.\n</code>\n</pre>\n", "senID": 5}, {"text": ["In a Bash-like language"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"code": "<pre>\n<code>\n set a=some_value\n\nls a*b   means what the Unix ls a*b means.\n\nls $a*b  uses an explicit recall of the value of a.\n</code>\n</pre>\n", "senID": 7}, {"text": ["Scripting languages make it easy to store and recall values and hard to have a transient scope on a value.", "Shell languages make it possible to store and recall values, but have a trivially transient scope per command."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["Scalability and extensibility?", "Common Lisp (you can even run CLISP, and possibly other implementations, as a login shell in UNIX environments)."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "and", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "as", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["No."], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["The problem is the dichotomy between macro languages and, well, everything else."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "macro languages", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["The shell is in a category with other legacy macro languages such as nroff and m4.", "In these processors, everything is a string and the processor defines a mapping from input strings to output strings."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "nroff", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Nroff"}, {"text": "m4", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/M4_%28computer_language%29"}]}, {"text": ["Certain boundaries are crossed in both directions in all languages, but it's usually quite clear whether a system's category is macro or, hmm, I'm not aware of an official term ...", "I will say \"parsed typed language\"."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "macro", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "\"parsed typed language\".", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["So sure, you could type in all your commands in a language like Ruby, and it might even be a second-best choice to a real shell, but it will never be a macro language."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "could", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Too many compromises need to be made for a macro language."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Strings are typed in with no quotes; it will always require too much magic syntax to write real code efficiently, and it will always require too many quotes in a parsed and typed language to type in commands easily."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]]