[[{"text": ["I haven't done any MIDI programming in years, but your fundamental idea is very sound (no pun)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["MIDI is a stream of \"events\" (or \"messages\"), two of the most fundamental being \"note on\" and \"note off\" which carry with them the note number (0 = C five octaves below middle C, through 127 = G five octaves above the G above middle C, in semi-tones).", "These events carry a \"velocity\" number on keyboards that are velocity sensitive (\"touch sensitive\"), with a force of (you guessed it) between 0 and 127."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Between velocity, chording, and the pedals, I'd think you could come up with quite a good \"typing\" interface for the piano keyboard.", "Chording in particular could be a very powerful technique&nbsp;&mdash; as I mentioned in the comments, it's why rank-and-file stenographers can use a stenotype machine to keep up with people talking for hours in a row, when even top-flight typists wouldn't be able to for any length of time via normal typewriter-style keyboards.", "As with machine stenography, you'd need a \"dictionary\" of the meanings of chords and sequences of chords.", "(Can you tell I used to work in the software side of machine stenography?"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "stenotype machine", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Stenotype"}]}, {"text": ["To do this, the fundamental pieces are:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "Receiving MIDI input. Don't try to do this yourself, use a library. ", "tag": "none", "senID": 4}, {"text": "Converting that data into the keystrokes you want to send, e.g. via the dictionary I mentioned above.", "tag": "none", "senID": 5}, {"text": "Outputting the keystrokes to the computer.", "tag": "none", "senID": 6}]}, {"text": ["To be most broadly-compatible with software, you'd have to write this as a keyboard device driver.", "This is a plug-in to the operating system that serves as a source for keyboard events, talking to the underlying hardware (in your case, the piano keyboard).", "For Windows and Linux, you're probably going to want to use C for that."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["However, since you're just generating keystrokes (not trying to intercept them, which I was trying to do years ago), you may be able to use whatever features the operating system has for sending artificial keystrokes.", "Windows has an interface for doing that (probably several, the one I'm thinking of is SendInput but I know there's some \"journal\" interface that does something similar), and I'm sure other operating systems do as well.", "That may well be sufficient for your purposes&nbsp;&mdash; it's where I'd start, because the device driver route is going to be awkward and you'd probably have to use a different language for it than Java.", "(I'm a big fan of Java, but the interfaces that operating systems use to talk to device drivers tend to be more easily consumed via C and similar."], "childNum": 3, "tag": "p", "senID": 8, "childList": [{"text": "generating", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "SendInput", "tag": "a", "pos": 1, "childList": [{"text": "SendInput", "tag": "code"}], "childNum": 1, "href": "http://msdn.microsoft.com/en-us/library/ms646310%28v=vs.85%29.aspx"}, {"text": "SendInput", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["Update: More about the \"dictionary\" of chords to keystrokes:"], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "Update", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Basically, the dictionary is a trie (thanks, @Adam) that we search with longest-prefix matching.", "Details:"], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "trie", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Trie"}]}, {"text": ["In machine stenography, the stenographer writes by pressing multiple keys on the stenotype machine at the same time, then releasing them all.", "They call this a \"stroke\" of the keyboard; it's like playing a chord on the piano.", "Strokes frequently (but not always) correspond to a syllable of spoken language.", "Like syllables, sometimes one stroke (chord) has meaning all on its own, other times it only has meaning combined with following strokes.", "(Think \"good\" vs. \"good\" followed by \"bye\").", "Although they'll be heavily influenced by the school at which they studied, each stenographer will have their own \"dictionary\" of what strokes they use to mean what, a dictionary they will continuously hone over the course of their working lives.", "The dictionary will have entries where the stenographic part (\"steno\", for short) is one stroke long, or multiple strokes long.", "Frequently, there will be several entries with the same starting stroke which are differentiated by their length and by the subsequent strokes.", "For instance (and I won't use real steno here, just placeholders), there may be these entries:"], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"code": "<pre>\nA     = alpha\nA/B   = alphabet\nA/B/C = alphabetic\nA/C   = air conditioning\nB     = bee\nB/C   = because\nC     = sea\nD     = dog\nD/D   = Dee Dee\n</pre>\n", "senID": 12}, {"text": ["(Those letters aren't meant to be musical notes, just abstract markers."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["Note that A starts multiple entries, and also note that how you translate a C stroke depends on whether you've previously seen an A, a B, or you're starting fresh."], "childNum": 4, "tag": "p", "senID": 14, "childList": [{"text": "A", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "C", "childNum": 0, "tag": "code", "childList": []}, {"text": "A", "childNum": 0, "tag": "code", "childList": []}, {"text": "B", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Also note that (although not shown in the very small sample above), there may be multiple ways to \"play\" the same word or phrase, rather than just one.", "Stenographers do that to make it easier to flow from a preceding word to the next depending on hand position.", "There's an obvious analogy to music there, and you could use that to make your typing flow more akin to playing music, in order to both prevent this from negatively affecting your piano playing and to maximize the likelihood of this actually helping with the RSI."], "childNum": 0, "tag": "p", "senID": 15, "childList": []}, {"text": ["When translating steno into standard text, again we use a \"longest-prefix match\" search: The translation algorithm starts with the first stroke ever written, and looks for entries starting with that stroke.", "If there is only one entry, and it's one stroke long, then we can reliably say \"that's the entry to use\", output the corresponding text, and then start fresh with the next stroke.", "But more likely, that stroke starts multiple entries of varying lengths.", "So we look at the next stroke and see if there are entries that start with those two strokes in order; and so on until we get a match."], "childNum": 0, "tag": "p", "senID": 16, "childList": []}, {"text": ["So with the dictionary above, suppose we saw this sequence:"], "childNum": 0, "tag": "p", "senID": 17, "childList": []}, {"code": "<pre>\nA C B B C A B C A B D\n</pre>\n", "senID": 18}, {"text": ["Here's how we'd translate it:"], "childNum": 0, "tag": "p", "senID": 19, "childList": []}, {"text": ["Aspects of the above to note:"], "childNum": 0, "tag": "p", "senID": 20, "childList": []}, {"tag": "ul", "num": 7, "lis": [{"text": "You have a buffer of strokes you've read by haven't translated yet.", "tag": "none", "senID": 21}, {"text": "You always want to match the most strokes against a single entry that you can. ", "tag": "none", "senID": 22}, {"text": "(Not shown above) You may well have sequences of strokes that you can't translate, because they don't match anything in the dictionary. (Steno people use the noun \"untranslate\" -- e.g., with our dictionary, the strokes ", "tag": "none", "senID": 23}, {"text": "(Not shown above) Some theories of steno allow the same set of strokes to mean more than one thing, based on a broader context. Steno people call these \"conflicts\". You probably want to disallow them in your project, and in fact when steno used to be translated manually by the stenographer, conflicts were fine because they'd know just by where in the sentence they were what the right choice was, but with the rise of machine translation, conflict-free theories of steno arose specifically to avoid having to go through the resulting translated text and \"fix\" conflicts.", "tag": "none", "senID": 24}, {"text": "Translating in real time (which you'd be doing) means that if you receive a partial match, you'll want to hold onto it while waiting for the next chord&nbsp;&mdash; but probably only up to a timeout, at which point you'd translate what you have in the buffer as best you can. (Or maybe you don't want a timeout; it's your call.)", "tag": "none", "senID": 25}, {"text": "Probably best to have a stroke that says \"disregard the previous stroke\"", "tag": "none", "senID": 26}, {"text": "Probably best to have a stroke that says \"completely clear the buffer without outputting anything\"", "tag": "none", "senID": 27}]}], [{"text": ["Consider doing something in hardware that emulates a usb (or ps/2?", ") keyboard.", "You will no longer be dependent on a specific OS, or specific OS API.", "A hardware solution will stand the test of time.", "Don't be stuck using an old API in Windows 7 when everyone else is running Windows 11!", "Arduino is pretty easy to learn."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Arduino", "tag": "a", "pos": 5, "childList": [], "childNum": 0, "href": "http://www.arduino.cc/"}]}, {"tag": "ul", "num": 2, "lis": [{"text": ["Arduino MIDI hardware is available off of the shelf"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": ["Arduinos have been used to emulate keyboard devices"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}]}, {"text": ["There is a ton of info and help out there for Arduino.", "It is a hardware hacking platform built for newbies.", "It will only get bigger now that Google is pushing Arduino."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Google is pushing Arduino.", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.everythingusb.com/android-open-accessory-kit-21147.html"}]}, {"text": ["EDIT:  Virtual USB Keyboard software  and hardware"], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "software", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://github.com/practicalarduino/VirtualUsbKeyboard"}, {"href": "http://www.practicalarduino.com/projects/virtual-usb-keyboard", "text": "hardware", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["It sounds to me like you're looking less for advice on how to build this yourself and more asking what resources are already out there to accomplish what you want.", "Depending on your OS, there are many ways to accomplish this without having to write your own program from scratch:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["MIDI Stroke "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "MIDI Stroke", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.charlie-roberts.com/midiStroke/"}]}, {"text": ["Free.", "For Mac OSX 10.3 and up.", "This one specifically comes with \"the ability to use any midi keyboard as a full blown computer keyboard replacement."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Mac OSX 10.3 and up", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["MIDI Translator "], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "MIDI Translator", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.bome.com/products/miditranslator/overview/classic"}]}, {"text": ["Free/Postcardware (it's a bit odd).", "For Windows 2000 and up.", "It initially appears to be more geared towards autohotkey-type usage, but on further looking I think it could do what you want nicely."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Windows 2000 and up", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["Max and aka.keyboard"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Max and aka.keyboard", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://jnote.org/1444"}]}, {"text": ["Free.", "For Linux.", "Not exactly a \"ready out of the box\" solution, but if you are comfortable with basic device configuration under *nix it shouldn't be too bad. "], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "Linux", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}], [{"text": ["I'm sorry I didn't see this question sooner.", "I studied piano performance in college and then got into interaction design, programming, and using vim, so I have actually spent a lot of time prototyping things like this.", "You can get this working pretty quick in linux by using the graphical programming language for multimedia artists, \"Pure Data,\" along with the x11key external by Alex Andre.", "On Mac, you can use MidiStroke.", "I believe a method on Windows involved the MidiOx and AutoHotKey tools.", "At another time I had a version going using the Java plugin for Max/MSP.", "I believe Patrice Colet made a windows external for Pure Data that worked as well, but I can't seem to locate it anymore.", "Also, there's an external for MaxMSP that can do this on windows.", "Finally, the non-free but awesome Osculator can do what you want - see the features page."], "childNum": 9, "tag": "p", "senID": 0, "childList": [{"text": "Pure Data", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://puredata.info/"}, {"text": "Alex Andre", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://alexandre.quessy.net/?q=code"}, {"text": "MidiStroke", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.charlie-roberts.com/midiStroke/"}, {"text": "MidiOx", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://www.midiox.com/"}, {"text": "AutoHotKey", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.autohotkey.com"}, {"text": "Max/MSP", "tag": "a", "pos": 5, "childList": [], "childNum": 0, "href": "http://cycling74.com/"}, {"text": "Patrice Colet", "tag": "a", "pos": 6, "childList": [], "childNum": 0, "href": "http://lists.puredata.info/pipermail/pd-list/2007-12/057907.html"}, {"text": "an external for MaxMSP", "tag": "a", "pos": 7, "childList": [], "childNum": 0, "href": "http://www.maxobjects.com/?v=objects&id_objet=4607&requested=keystroke&operateur=AND&id_plateforme=0&id_format=0"}, {"text": "Osculator", "tag": "a", "pos": 8, "childList": [], "childNum": 0, "href": "http://www.osculator.net/features/"}]}, {"text": ["When I got it working, I never stuck with it because I couldn't stop tooling with the layout.", "It was cool just having my monitor on my electric keyboard, though!", "Good luck."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Actually, I worked on this a while ago, trying to capture Rock band drum inputs into my computer (making a little java homemade drum emulator) Anyway, I asked a question on here about that, I can direct you to the thread.", "And if I can find my program I can give you the code, it uses a 3rd party API (JInput)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Edit:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Time delay problem"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Time delay problem", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/2170056/time-delay-problem"}]}, {"text": ["Here is my old thread, back from high school.", "Anyway, there is polling code in there, along with what I was attempting to do."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Good luck either way"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["You could hack your own USB keyboard pretty quickly using a Teenys micro controller."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In fact, they have example code for how to make a USB keyboard."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "make a USB keyboard", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pjrc.com/teensy/usb_keyboard.html"}]}, {"text": ["You could approach this two ways:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Try Bome's Midi Translator"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.bome.com/products/miditranslator/overview/classic"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.bome.com/products/miditranslator/overview/classic", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.bome.com/products/miditranslator/overview/classic"}]}, {"text": ["It works cross platform, can convert any midi input to a keystoke easily, quick to setup and configure, plus it's free for personal use."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Here is a tutorial of how to easily set it up:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["http://audio.tutsplus.com/tutorials/production/quick-tip-midi-translation-midi-to-keystrokes/"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://audio.tutsplus.com/tutorials/production/quick-tip-midi-translation-midi-to-keystrokes/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://audio.tutsplus.com/tutorials/production/quick-tip-midi-translation-midi-to-keystrokes/"}]}, {"text": ["Basically, there are infinite possibilities of what you can do, including chording and modifier keys.", "I use it for my live audio rig to control my daw using my piano and have never had an issue."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["A good library in .NET with full midi support (BASS), go to http://www.un4seen.com."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.un4seen.com", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.un4seen.com"}]}, {"text": ["And for the other part, translating keyboard midi notes to keys and more, I would go for AutoItX, the ActiveX/COM and DLL interface to autoIt.", "Info and download, go to http://www.autoitscript.com/site/autoit/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.autoitscript.com/site/autoit/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.autoitscript.com/site/autoit/"}]}, {"text": ["No need to write keyboard driver."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["About MIDI"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"text": ["You stated that you \"know nothing at all about MIDI\".", "MIDI technology fairly straight-forward once you grasp it, but can be confusing at the outset.", "One of the resources that has been tremendously helpful for me in understanding the foundations for MIDI (which are certainly necessary if you want to program MIDI interactions), is a book called MIDI for the Technophobe.", "It's an easy book to read, and very helpful.  "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "MIDI for the Technophobe", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/1860744443"}]}, {"tag": "br", "senID": 2}, {"text": ["Pure Data &amp; Max"], "childNum": 0, "tag": "h2", "senID": 3, "childList": []}, {"text": ["In my experience developing interactive multimedia, there are two very similar programs I have encountered that facilitate connecting and mapping signals/inputs from any device."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["These are Max for a Mac environment and Pure Data for a PC environment.", "Both have a plethora of online documentation and YouTube tutorials.", "This video demonstrates a program built in Max that maps a computer keyboard to a MIDI keyboard's inputs, (which is basically the exact opposite of what you are trying to do).", "You could get your intended results by using the same pattern, but reversing the signals/mappings."], "childNum": 3, "tag": "p", "senID": 5, "childList": [{"text": "Max", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://cycling74.com/products/maxmspjitter/"}, {"text": "Pure Data", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://puredata.info/"}, {"text": "This video", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.youtube.com/watch?v=UvMoQ2Vtdbo"}]}, {"tag": "br", "senID": 6}, {"text": ["AutoHotKey"], "childNum": 0, "tag": "h2", "senID": 7, "childList": []}, {"text": ["AutoHotKey is a free open source utility for windows that allows you to remap keys and buttons on your devices to macros.", "It natively supports QWERTY keyboards, joysticks and mouse macros.   "], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "AutoHotKey", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.autohotkey.com/"}]}, {"text": ["However, I was able to find an implementation supporting the specific mapping you are looking for.", "These two threads explain the process,"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["Basically, it looks like AutoHotKey along with this user's custom patch will provide exactly what you need to create a mapping from a MIDI keyboard to a QWERTY keyboard's input signal.", "All you would have to do is install, configure and define your mappings."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"tag": "br", "senID": 11}, {"text": ["Anything else?"], "childNum": 0, "tag": "h2", "senID": 12, "childList": []}, {"text": ["Some of the other answers have given you much more extensive information on MIDI and MIDI programming, in general, but as your post states that doesn't seem to be quite what you are looking for.", "I would like to help you more if possible, but it would be easier if you could be more specific about the type of information you are looking for.", "For instance, are you more interested in how to convert a MIDI keyboard's input signals to a QWERTY keyboard's signals, or is your primary interest finding an out of the box solution to your specific problem?", "What are you looking for that has not yet been addressed?"], "childNum": 2, "tag": "p", "senID": 13, "childList": [{"text": "how to convert a MIDI keyboard's input signals to a QWERTY keyboard's signals", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "finding an out of the box solution", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}], [{"text": ["There is a program called GlovePIE (http://glovepie.org/glovepie.php).", "You can program it in a simple scripting language and I believe it supports MIDI.", "I'm not sure if this fits under the \"java\" category, but still, great program, I've used it to control robots using PS3 controllers.", "It's very powerful."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://glovepie.org/glovepie.php", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://glovepie.org/glovepie.php"}]}], [{"text": ["In Java you can use JMF(java Media framework) to convert MIDI signals.", "Basic of keyboard design is easy to use i.e.", "user interface; and place frequently used charcter/symbol handy.", "http://www.jsresources.org/examples/audio_dsp.html This is sample code and api help to understand how to process the signal."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "http://www.jsresources.org/examples/audio_dsp.html", "tag": "a", "pos": 3, "childList": [{"text": "http://www.jsresources.org/examples/audio_dsp.html", "tag": "strong"}], "childNum": 1, "href": "http://www.jsresources.org/examples/audio_dsp.html"}, {"text": "http://www.jsresources.org/examples/audio_dsp.html", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["Some more references. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["http://download.oracle.com/javase/tutorial/sound/controls.html\nhttp://as.wiley.com/WileyCDA/WileyTitle/productCd-0470997850.html"], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "http://download.oracle.com/javase/tutorial/sound/controls.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://download.oracle.com/javase/tutorial/sound/controls.html"}, {"href": "http://as.wiley.com/WileyCDA/WileyTitle/productCd-0470997850.html", "text": "http://as.wiley.com/WileyCDA/WileyTitle/productCd-0470997850.html", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["Many keyboards have a Serial Port (RS232) connector to send MIDI signals to the computer."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I use a program called Girder to convert Serial Port communication into keyboard strokes."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Girder", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.promixis.com/girder.php"}]}, {"text": ["Girder has a \"mapping\" feature that lets you map each key, one by one, to the corresponding keystroke."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["This might be the simple solution you're looking for!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Casey has the best answer.", "I've added a comment to it and upvoted it.", "This kind of software belongs in either a device driver or an embedded system.", "Device drivers are much more complex and they are not portable to other OSes.", "For reference see the issues with Winmodems on Linux."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["By putting your code in an embedded system, you make it portable to any MIDI device with a USB port, and any computer that accepts USB keyboards."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Take a look at MAME arcade gaming.", "They have built hardware devices to allow input from any number of different items.", "The iPac, for example, converts signals from input devices into USB that the computer can then use to emulate keys.", "You could use any combination of input devices arranged any way that seems comfortable with no crazy programming logic required--because the software to interpret input is already done and well tested."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "iPac", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.ultimarc.com/ipac1.html"}]}, {"text": ["I've seen flight simulator cockpit inputs, custom kiosks, and voting systems built in this method.....and the price is right! "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["http://www.macupdate.com/app/mac/20200/midistroke/ :D"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.macupdate.com/app/mac/20200/midistroke/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.macupdate.com/app/mac/20200/midistroke/"}]}], [{"text": ["You'll get better &amp; happier results (regardless what operating system a/o DAW prog you like to use) by playing any external midi keyboard as a controller through your sound card.", "Then route that into your GB software (or whatever) and tone generate the many sounds they have supplied you that way in real-time. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If your sound card does not support midi i/o's (ins / outs /thrus), that's not a problem.", "You can consider researching and investing in an external midi table top converter.", "Many are equipt to further convert Midi outs to USB 2.0 (by- passing an existing sound card altogether). "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For example: it's pretty tough getting \"human like\" grace note results via a Z and X change key option using a computer keyboard and pencil tool.", "When, instead, your own fingers can just play that with a midi keyboard from its own physical octave register ranges—immediately! "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I realize budgetary constraints may be involved.", "But, some of these seemingly cheap \"Casio\" type 5 octave keyboards sold at Radio Shack for under $100.00 U.S.", "Dollars (*or less) is all you would need (plus, some of their on-board sound patches and sequencer modules sound and handle amazingly well for other things too). "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["RADIO SHACK MIDI KEYBOARD OPTIONS: "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["http://www.google.com/search?q=equipt%2F&amp;ie=utf-8&amp;oe=utf-8&amp;aq=t&amp;rls=org.mozilla:en-US:official&amp;client=firefox-a#hl=en&amp;expIds=17259,27586,27642&amp;sugexp=ldymls&amp;xhr=t&amp;q=Radio+Shack+Midi+keyboards%2F&amp;cp=27&amp;pf=p&amp;sclient=psy&amp;client=firefox-a&amp;rls=org.mozilla:en-US%3Aofficial&amp;aq=f&amp;aqi=&amp;aql=&amp;oq=Radio+Shack+Midi+keyboards/&amp;gs_rfai=&amp;pbx=1&amp;fp=267856ed3ee60de5"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "http://www.google.com/search?q=equipt%2F&amp;ie=utf-8&amp;oe=utf-8&amp;aq=t&amp;rls=org.mozilla:en-US:official&amp;client=firefox-a#hl=en&amp;expIds=17259,27586,27642&amp;sugexp=ldymls&amp;xhr=t&amp;q=Radio+Shack+Midi+keyboards%2F&amp;cp=27&amp;pf=p&amp;sclient=psy&amp;client=firefox-a&amp;rls=org.mozilla:en-US%3Aofficial&amp;aq=f&amp;aqi=&amp;aql=&amp;oq=Radio+Shack+Midi+keyboards/&amp;gs_rfai=&amp;pbx=1&amp;fp=267856ed3ee60de5", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.google.com/search?q=equipt%2F&ie=utf-8&oe=utf-8&aq=t&rls=org.mozilla:en-US:official&client=firefox-a#hl=en&expIds=17259,27586,27642&sugexp=ldymls&xhr=t&q=Radio+Shack+Midi+keyboards%2F&cp=27&pf=p&sclient=psy&client=firefox-a&rls=org.mozilla:en-US%3Aofficial&aq=f&aqi=&aql=&oq=Radio+Shack+Midi+keyboards/&gs_rfai=&pbx=1&fp=267856ed3ee60de5"}]}, {"text": ["As for external midi converters for existing sound cards, I've run some Google searches for you as follows with Mac platforms specifically in mind: "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["http://www.google.com/search?client=firefox-a&amp;rls=org.mozilla%3Aen-US%3Aofficial&amp;channel=s&amp;hl=en&amp;source=hp&amp;q=envisionment%2F&amp;btnG=Google+Search#hl=en&amp;expIds=17259,27586,27642&amp;sugexp=ldymls&amp;xhr=t&amp;q=external+midi+converters+for+existing+Mac+Sound+cards%2F&amp;cp=54&amp;pf=p&amp;sclient=psy&amp;client=firefox-a&amp;rls=org.mozilla:en-US%3Aofficial&amp;channel=s&amp;aq=f&amp;aqi=&amp;aql=&amp;oq=external+midi+converters+for+existing+Mac+Sound+cards/&amp;gs_rfai=&amp;pbx=1&amp;fp=267856ed3ee60de5"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "http://www.google.com/search?client=firefox-a&amp;rls=org.mozilla%3Aen-US%3Aofficial&amp;channel=s&amp;hl=en&amp;source=hp&amp;q=envisionment%2F&amp;btnG=Google+Search#hl=en&amp;expIds=17259,27586,27642&amp;sugexp=ldymls&amp;xhr=t&amp;q=external+midi+converters+for+existing+Mac+Sound+cards%2F&amp;cp=54&amp;pf=p&amp;sclient=psy&amp;client=firefox-a&amp;rls=org.mozilla:en-US%3Aofficial&amp;channel=s&amp;aq=f&amp;aqi=&amp;aql=&amp;oq=external+midi+converters+for+existing+Mac+Sound+cards/&amp;gs_rfai=&amp;pbx=1&amp;fp=267856ed3ee60de5", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.google.com/search?client=firefox-a&rls=org.mozilla%3Aen-US%3Aofficial&channel=s&hl=en&source=hp&q=envisionment%2F&btnG=Google+Search#hl=en&expIds=17259,27586,27642&sugexp=ldymls&xhr=t&q=external+midi+converters+for+existing+Mac+Sound+cards%2F&cp=54&pf=p&sclient=psy&client=firefox-a&rls=org.mozilla:en-US%3Aofficial&channel=s&aq=f&aqi=&aql=&oq=external+midi+converters+for+existing+Mac+Sound+cards/&gs_rfai=&pbx=1&fp=267856ed3ee60de5"}]}, {"text": ["A lot of this external midi conversion information may be cumbersome to you at first, so I've broken down things more as \"user friendly\" for your considerations &amp; budget:"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["keyword--midi+sound+cards_sort--5.html\">http://www.bizrate.com/soundcards/products_keyword--midi+sound+cards_sort--5.html "], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "keyword--midi+sound+cards", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["There's nothing wrong with facilitating virtual keyboards as VST's when using DAW.", "They have their place. "], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["But, you sound like an accomplished keyboardist.", "So, why not consider the external Midi conversion / keyboard options I just mentioned for yourself? "], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["Good Luck &amp; hope this gave you some ideas that can and will work for you! "], "childNum": 0, "tag": "p", "senID": 12, "childList": []}], [{"text": ["Not specific to your question, but concerning RSI.", "I got RSI and had to stop using the keyboard and mouse, but I use iPad remotes that send inputs to the computer as a replacement.", "I have gone 6 months and my RSI is getting a little better as long as I dont touch a keyboard."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I use TouchPad app mainly, but there are others like Mobile Mouse and RowMote Pro."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Hope your RSI gets better.", "If you find other methods, please share."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]