[[{"text": ["There are probably two major differences:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Rails uses them to good effect.", "Here's an example:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n class WeblogController &lt; ActionController::Base\n  def index\n    @posts = Post.find :all\n    respond_to do |format|\n      format.html\n      format.xml { render :xml =&gt; @posts.to_xml }\n      format.rss { render :action =&gt; \"feed.rxml\" }\n    end\n  end\nend\n</code>\n</pre>\n", "senID": 2}, {"text": ["Anonymous closures/lambdas make it easier to emulate new language features that would take blocks.", "In Python, closures exist, but they must be named in order to be used.", "So instead of being able to use closures to emulate new language features, you're forced to be explicit about the fact that you're using a closure."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["This is used extensively in Rails, primarily because of how easy it is to use.", "To be specific, in Ruby, you can execute arbitrary code in the context of the class.", "The following snippets are equivalent:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n class Foo\n  def self.make_hello_method\n    class_eval do\n      def hello\n        puts \"HELLO\"\n      end\n    end\n  end\nend\n\nclass Bar &lt; Foo # snippet 1\n  make_hello_method\nend\n\nclass Bar &lt; Foo; end # snippet 2\nBar.make_hello_method\n</code>\n</pre>\n", "senID": 5}, {"text": ["In both cases, you can then do:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"code": "<pre>\n<code>\n Bar.hello\n</code>\n</pre>\n", "senID": 7}, {"text": ["which will print \"HELLO\".", "The class_eval method also takes a String, so it's possible to create methods on the fly, as a class is being created, that have differing semantics based on the parameters that are passed in."], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "class_eval", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["It is, in fact, possible to do this sort of metaprogramming in Python (and other langauges, too), but Ruby has a leg up because metaprogramming isn't a special style of programming.", "It flows from the fact that in Ruby, everything is an object and all lines of code are directly executed.", "As a result, Classes are themselves objects, class bodies have a self pointing at the Class, and you can call methods on the class as you are creating one."], "childNum": 2, "tag": "p", "senID": 9, "childList": [{"text": "Class", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "self", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["This is to large degree responsible for the degree of declarativeness possible in Rails, and the ease by which we are able to implement new declarative features that look like keywords or new block language features."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}], [{"text": ["Those who have argued that"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["are (IMO) mistaken.", "That success probably owes more to clever and sustained marketing than to any technical prowess.", "Django arguably does a better job in many areas (e.g.", "the built-in kick-ass admin) without the need for any features of Ruby.", "I'm not dissing Ruby at all, just standing up for Python!"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Django", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}]}], [{"text": ["The python community believes that doing things the most simple and straight forward way possible is the highest form of elegance.", "The ruby community believes doing things in clever ways that allow for cool code is the highest form of elegance. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Rails is all about if you follow certain conventions, loads of other things magically happen for you.", "That jives really well with the ruby way of looking at the world, but doesn't really follow the python way. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I fail to see how"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class Foo\n  def self.make_hello_method\n    class_eval do\n      def hello\n        puts \"HELLO\"\n      end\n    end\n  end\nend\n</code>\n</pre>\n", "senID": 1}, {"text": ["is elegant ..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Is this debate a new \"vim versus emacs\" debate?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I am a python/django programmer and until now i've never found a problem in that language/framework that would lead me to switch to ruby/rails."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I can imagine that it would be the same if I was experienced with ruby/rails."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Both have similar philosophy and are making very good job in a fast and eleguant way.", "The better choice is what you already know."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Personally, I find ruby to be superior to python in many ways that comprise what I'd call 'consistent expressiveness'.", "For example, in ruby, join is a method on the array object which outputs a string, so you get something like this:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n» numlist = [1,2,3,4]\n=> [1, 2, 3, 4]\n» numlist.join(',')\n=> \"1,2,3,4\"\n</pre>\n", "senID": 1}, {"text": ["In python, join is a method on the string object but which throws an error if you pass it something other than a string as the thing to join, so the same construct is something like:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n» numlist = [1,2,3,4]\n» numlist\n[1, 2, 3, 4]\n» \",\".join([str(i) for i in numlist])\n'1,2,3,4'\n</pre>\n", "senID": 3}, {"text": ["There are a lot of these little kinds of differences that add up over time."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Also, I cannot think of a better way to introduce invisible logic errors than to make whitespace significant."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["The real answer is neither Python or Ruby are better/worse candidates for a web framework.", "If you want objectivity you need to do some projects in both and see which fits your person preference best.", "Most people who argue for one or other have either never used the other language seriously or are 'voting' for their personal preference."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I would guess most people settle on which ever they come in to contact with first because it teaches them something new (MVC, testing, generators etc.", ") or does something better (plugins, templating etc) - I used to develop with PHP and came in to contact with RubyOnRails.", "If I had have known about MVC before finding Rails I would more than likely never left PHP behind.", "But once I started using Ruby I enjoyed the syntax, features etc. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If I had have found Python and one of its MVC frameworks first I would more than likely be praising that language instead!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Python has a whole host of Rails-like frameworks.", "There are so many that a joke goes that during the typical talk at PyCon at least one web framework will see the light."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The argument that Rubys meta programming would make it better suited is IMO incorrect.", "You don't need metaprogramming for frameworks like this."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So I think we can conclude that Ruby are not better (and likely neither worse) than Python in this respect."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Because Rails is developed to take advantage of Rubys feature set. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A similarly gormless question would be \"Why is Python more suitable for Django than Ruby is?", "\"."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I suppose we should not discuss the language features per se but rather the accents the respective communities make on the language features.", "For example, in Python, re-opening a class is perfectly possible but it is not common; in Ruby, however, re-opening a class is something of the daily practice.", "this allows for a quick and straightforward customization of the framework to the current requirement and renders Ruby more favorable for Rails-like frameworks than any other dynamic language.", "Hence my answer: common use of re-opening classes."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "per se", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Two answers : "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["a.", "Because rails was written for ruby. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["b.", "For the same reason C more suitable for Linux than Ruby"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Some have said that the type of metaprogramming required to make ActiveRecord (a key component of rails) possible is easier and more natural to do in ruby than in python - I do not know python yet;), so i cannot personally confirm this statement."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I have used rails briefly, and its use of catchalls/interceptors and dynamic evaluation/code injection does allow you to operate at a much higher level of abstraction than some of the other frameworks (before its time).", "I have little to no experience with Python's framework - but i've heard it's equally capable - and that the python community does a great job supporting and fostering pythonic endeavors."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["\"Bar.hello\" doesn't work, should be \"Bar.new.hello\".", "Typo?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think that the syntax is cleaner and Ruby, for me at least, is just a lot more \"enjoyable\"- as subjective as that is!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["All of this is TOTALLY \"IMHO\""], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In Ruby there is ONE web-application framework, so it is the only framework that is advertised for that language."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python has had several since inception, just to name a few: Zope, Twisted, Django, TurboGears (it itself a mix of other framework components), Pylons (a kinda-clone of the Rails framework), and so on.", "None of them are python-community-wide supported as \"THE one to use\" so all the \"groundswell\" is spread over several projects."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Rails has the community size solely, or at least in the vast majority, because of Rails."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Both Python and Ruby are perfectly capable of doing the job as a web applications framework.", "Use the one YOU (and your potential development team) like and can align on."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]