[[{"text": ["Adam is only partially right.", "Many, if not most, mathematicians will never touch it.", "If there is a computer tool used at all, it's going to be something like Mathematica or Maple.", "Engineering departments, on the other hand, often rely on it and there are definitely useful things for some applied mathematicians.", "It's also used heavily in industry in some areas."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Mathematica", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Mathematica"}, {"text": "Maple", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Maple_%28software%29"}]}, {"text": ["Something you have to realize about MATLAB is that it started off as a wrapper on Fortran libraries for linear algebra.", "For a long time, it had an attitude that \"all the world is an array of doubles (floats)\".", "As a language, it has grown very organically, and there are some flaws that are very much baked in, if you look at it just as a programming language."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Fortran", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Fortran"}]}, {"text": ["However, if you look at it as an environment for doing certain types of research in, it has some real strengths.", "It's about as good as it gets for doing floating point linear algebra.", "The notation is simple and powerful, the implementation fast and trusted.", "It is very good at generating plots and other interactive tasks.", "There are a large number of `toolboxes' with good code for particular tasks, that are affordable.", "There is a large community of users that share numerical codes (Python + NumPy has nothing in the same league, at least yet)"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "NumPy", "tag": "a", "pos": 5, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/NumPy"}]}, {"text": ["Python, warts and all, is a much better programming languags (as are many others).", "However, it's a decade or so behind in terms of the tools."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The key point is that the majority of people who use MATLAB are not programmers really, and don't want to be. "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["It's a lousy choice for a general programming language; it's quirky, slow for many tasks (you need to vectorize things to get efficient codes), and not easy to integrate with the outside world.", "On the other hand, for the things it is good at, it is very very good.", "Very few things compare.", "There's a company with reasonable support and who knows how many man-years put into it.", "This can matter in industry."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Strictly looking at your Python vs. MATLAB comparison, they are mostly different tools for different jobs.", "In the areas where they do overlap a bit, it's hard to say what the better route to go is (depends a lot on what you're trying to do).", "But mostly Python isn't all that good at MATLAB's core strengths, and vice versa."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["I've been using matlab for many years in my research.", "It's great for linear algebra and has a large set of well-written toolboxes.", "The most recent versions are starting to push it into being closer to a general-purpose language (better optimizers, a much better object model, richer scoping rules, etc.", ").  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This past summer, I had a job where I used Python + numpy instead of Matlab.", "I enjoyed the change of pace.", "It's a \"real\" language (and all that entails), and it has some great numeric features like broadcasting arrays.", "I also really like the ipython environment.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Here are some things that I prefer about Matlab:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["consistency:"], "childNum": 0, "tag": "i", "senID": 3, "childList": []}, {"text": ["documentation:"], "childNum": 0, "tag": "i", "senID": 4, "childList": []}, {"text": ["compactness:"], "childNum": 0, "tag": "i", "senID": 5, "childList": []}, {"text": ["momentum:"], "childNum": 0, "tag": "i", "senID": 6, "childList": []}]}, {"text": ["If I didn't have such a large existing codebase, I'd seriously consider switching to Python + numpy."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["MATLAB is great for doing array manipulation, doing specialized math functions, and for creating nice plots quick."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I'd probably only use it for large programs if I could use a lot of array/matrix manipulation."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You don't have to worry about the IDE as much as in more formal packages, so it's easier for students without a lot of programming experience to pick up."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["MATLAB is a popular and widely adapted piece of a\nsophisticated software package.", "It'd be a mistake to think\nit's merely a math software since it has a wide range of\n\"toolboxes\".", "I recently used Matplotlib to plot some data\nfrom a database and it did the job without needing all the\nbells and whistles of MATLAB.", "However, it may not be proper\nto compare Python and MATLAB in every situation.", "As with\neverything else the decision depends on what you need to do."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Matplotlib", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Matplotlib"}]}, {"text": ["I used MATLAB in undergrad for control systems design and\nsimulation and also for image processing in grad school.", "For\nthese fields MATLAB makes the most sense because of the\npowerful control and image processing toolboxes.", "As everyone\nmentioned, array operations, which are used in every MATLAB\nscript you'd need to write, are very easy with MATLAB."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Another nice thing about MATLAB is that it's very easy and\nfast to do prototyping and trying out ideas using the built\nin toolbox functions.", "For instance, it takes no effort to\nimport an image and compute it's histogram or do some simple\nprocessing on it.", "One disadvantage of MATLAB could be it's\nspeed because of its interpreted nature.", "However, if one\nreally needs speed than he can choose to implement the\ntested logic in C/C++, etc."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For further comparison with Python, I can say that MATLAB\nprovides a full package for you to do your work without the\nneed of looking around for external libraries and\nimplementing extra functions."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["One last point about MATLAB which I see is not mentioned in\nthe answers here is that it has a very powerful visual\nmodeling/simulation environment called Simulink.", "It's\neasier to design and simulate larger systems with Simulink."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Simulink", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.mathworks.com/products/simulink/"}]}, {"text": ["Finally, again, it all depends on the problem you need to\nsolve.", "If your problem domain can make use of one of\nMATLAB's toolboxes and you have access to MATLAB then you\ncan be sure that you'll have the right tool to solve it."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Hold everything.", "When's the last time you programed your calculator to play tetris?", "Did you actually think you could write anything you want in those 128k of RAM?", "Likely not.", "MATLAB is not for programming unless you're dealing with huge matrices.", "It's the graphing calculator you whip out when you've got Megabytes to Gigabytes of data to crunch and/or plot.", "Learn just basic stuff, but also don't kill yourself trying to make Python be a graphing calculator."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You'll quickly get a feel for when you want to crunch, plot or explore in MATLAB and when you want to have all that Python offers.", "Lots of engineers turn to pre and post processing in Python or Perl.", "Occasionally even just calling out to MATLAB for the hard bits."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["They are such completely different tools that you should learn their basic strengths first without trying to replace one with the other.", "Granted for saving money I'd skimp on ease and learn to work with sparse matrices in Perl or Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["MATLAB, as mentioned by others, is great at matrix manipulation, and was originally built as an extension of the well-known BLAS and LAPACK libraries used for linear algebra.", "It interfaces well with other languages like Java, and is well favored by engineering and scientific companies for its well developed and documented libraries.", "From what I know of Python and NumPy, while they share many of the fundamental capabilities of MATLAB, they don't have the full breadth and depth of capabilities with their libraries."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "BLAS", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.netlib.org/blas/"}, {"text": "LAPACK", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.netlib.org/lapack/"}]}, {"text": ["Personally, I use MATLAB because that's what I learned in my internship, that's what I used in grad school, and that's what I used in my first job.", "I don't have anything against Python (or any other language).", "It's just what I'm used too."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Also, there is another free version in addition to scilab mentioned by @Jim C from gnu called Octave."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "Jim C", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/179904/what-is-matlab-good-for-why-is-it-so-used-by-universities-when-is-it-better-tha#179935"}, {"href": "http://www.gnu.org/software/octave/", "text": "Octave", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["The most likely reason that it's used so much in universities is that the mathematics faculty are used to it, understand it, and know how to incorporate it into their curriculum."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Between matplotlib+pylab and NumPy I don't think there's much actual difference between Matlab and python other than cultural inertia as suggested by @Adam Bellaire. "], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "matplotlib+pylab", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://matplotlib.sourceforge.net/"}, {"href": "http://numpy.scipy.org/", "text": "NumPy", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["The main reason it is useful in industry is the plug-ins built on top of the core functionality.", "Almost all active Matlab development for the last few years has focused on these.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Unfortunately, you won't have much opportunity to use these in an academic environment."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["One reason MATLAB is popular with universities is the same reason a lot of things are popular with universities: there's a lot of professors familiar with it, and it's fairly robust."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I've spoken to a lot of folks who are especially interested in MATLAB's nascent ability to tap into the GPU instead of working serially.", "Having used Python in grad school, I kind of wish I had the licks to work with MATLAB in that case.", "It sure would make vector space calculations a breeze."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Personally, I tend to think of Matlab as an interactive matrix calculator and plotting tool with a few scripting capabilities, rather than as a full-fledged programming language like Python or C.  The reason for its success is that matrix stuff and plotting work out of the box, and you can do a few very specific things in it with virtually no actual programming knowledge.", "The language is, as you point out, extremely frustrating to use for more general-purpose tasks, such as even the simplest string processing.", "Its syntax is quirky, and it wasn't created with the abstractions necessary for projects of more than 100 lines or so in mind."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I think the reason why people try to use Matlab as a serious programming language is that most engineers (there are exceptions; my degree is in biomedical engineering and I like programming) are horrible programmers and hate to program.", "They're taught Matlab in college mostly for the matrix math, and they learn some rudimentary programming as part of learning Matlab, and just assume that Matlab is good enough.", "I can't think of anyone I know who knows any language besides Matlab, but still uses Matlab for anything other than a few pure number crunching applications."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I believe you have a very good point and it's one that has been raised in the company where I work.", "The company is limited in it's ability to apply matlab because of the licensing costs involved.", "One developer proved that Python was a very suitable replacement but it fell on ignorant ears because to the owners of those ears..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If it's worth £10,000 (??", ") it's gotta be worth it!", "! "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'm with you here.", "Python is a very good replacement for MatLab."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I should point out that I've been told the company uses maybe 5% to 10% of MatLabs capabilities and that is the basis for my agreement with the original poster"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "I should point out that I've been told the company uses maybe 5% to 10% of MatLabs capabilities and that is the basis for my agreement with the original poster", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["It's been some time since I've used Matlab, but from memory it does provide (albeit with extra plugins) the ability to generate source to allow you to realise your algorithm on a DSP."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Since python is a general purpose programming language there is no reason why you couldn't do everything in python that you can do in matlab.", "However, matlab does provide a number of other tools - eg.", "a very broad array of dsp features, a broad array of S and Z domain features."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["All of these could be hand coded in python (since it's a general purpose language), but if all you're after is the results perhaps spending the money on Matlab is the cheaper option?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["These features have also been tuned for performance.", "eg.", "The documentation for Numpy specifies that their Fourier transform is optimised for power of 2 point data sets.", "As I understand Matlab has been written to use the most efficient Fourier transform to suit the size of the data set, not just power of 2."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["edit: Oh, and in Matlab you can produce some sensational looking plots very easily, which is important when you're presenting your data.", "Again, certainly not impossible using other tools."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "looking", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Seems to be pure inertia.", "Where it is in use, everyone is too busy to learn IDL or numpy in sufficient detail to switch, and don't want to rewrite good working programs.", "Luckily that's not strictly true, but true enough in enough places that Matlab will be around a long time.", "Like Fortran (in active use where i work!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think you answered your own question when you noted that Matlab is \"cool to work with matrixes and plotting things\".", "Any application that requires a lot of matrix maths and visualisation will probably be easiest to do in Matlab."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["That said, Matlab's syntax feels awkward and shows the language's age.", "In contrast, Python is a much nicer general purpose programming language and, with the right libraries can do much of what Matlab does.", "However, Matlab is always going to have a more concise syntax than Python for vector and matrix manipulation. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If much of your programming involves these sorts of manipulations, such as in signal processing and some statistical techniques, then Matlab will be a better choice."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["MATLAB WAS a wrapper around commonly available libraries.", "And in many cases it still is.", "When you get to larger\ndatasets, it has many additional optimizations, including\nexamining and special casing common problems (reducing to\nsparse matrices where useful, for example), and handling\nedge cases.", "Often, you can submit a problem in a standard\nform to a general function, and it will determine the best\nunderlying algorithm to use based on your data.", "For small\nN, all algorithms are fast, but MATLAB makes determining the\noptimal algorithm a non-issue."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This is written by someone who hates MATLAB, and has tried\nto replace it due to integration issues.", "From your\nquestion, you mention getting MATLAB 5 and using it for a\ncourse.", "At that level, you might want to look at\nOctave, an open source implementation with the same\nsyntax.", "I'm guessing it is up to MATLAB 5 levels by now (I\nonly play around with it).", "That should allow you to \"pass\nyour exam\".", "For bare MATLAB functionality it seems to be\nclose.", "It is lacking in the toolbox support (which, again,\nmostly serves to reformulate the function calls to forms\nfamiliar to engineers in the field and selects the right\nunderlying algorithm to use)."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Octave", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.gnu.org/software/octave/"}]}], [{"text": ["MATLAB is a fantastic tool for "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "prototyping ", "tag": "none", "senID": 1}, {"text": "engineering simulation and ", "tag": "none", "senID": 2}, {"text": "fast visualization of data", "tag": "none", "senID": 3}]}, {"text": ["You can really play with, visualize and test your ideas on a data set very effectively.", "It should not be regarded as an alternative to other software languages used for product development.", "I highly recommend it for the above tasks, though it is expensive - free alternatives like Octave and Python are catching up."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Octave", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/GNU%5FOctave"}]}], [{"text": ["I know this question is old, and therefore may no longer be\nwatched, but I felt it was necessary to comment.", "As an\naerospace engineer at Georgia Tech, I can say, with no\nqualms, that MATLAB is awesome.", "You can have it quickly\ninterface with your Excel spreadsheets to pull in data about\nhow high and fast rockets are flying, how the wind affects\nthose same rockets, and how different engines matter.", "Beyond\nrocketry, similar concepts come into play for cars, trucks,\naircraft, spacecraft, and even athletics.", "You can pull in\nlarge amounts of data, manipulate all of it, and make sure\nyour results are as they should be.", "In the event something is\noff, you can add a line break where an error occurs to debug\nyour program without having to recompile every time you want\nto run your program.", "Is it slower than some other programs?", "Well, technically.", "I'm sure if you want to do the number\ncrunching it's great for on an NVIDIA graphics processor, it\nwould probably be faster, but it requires a lot more effort\nwith harder debugging."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As a general programming language, MATLAB is weak.", "It's not\nmeant to work against Python, Java, ActionScript, C/C++ or\nany other general purpose language.", "It's meant for the\nengineering and mathematics niche the name implies, and it\ndoes so fantastically."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["First Mover Advantage.", "Matlab has been around since the late 1970s.", "Python came along more recently, and the libraries that make it suitable for Matlab type tasks came along even more recently.", "People are used to Matlab, so they use it."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "First Mover Advantage", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/First_mover_advantage"}, {"text": "Matlab", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Matlab"}]}], [{"text": ["Matlab is good at doing number crunching.", "Also Matrix and matrix manipulation.", "It has many helpful built in libraries(depends on the what version) I think it is easier to use than python if you are going to be calculating equations."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["There is a free version called scilab but most universities require you to purchase matlab.", "It is nice for doing graphs and matrices.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.scilab.org/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.scilab.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.scilab.org/"}]}]]