[[{"text": ["John's answer is good (that list comprehensions are better when you want to iterate over something multiple times).", "However, it's also worth noting that you should use a list if you want to use any of the list methods.", "For example, the following code won't work:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n def gen():\n    return (something for something in get_some_stuff())\n\nprint gen()[:2]     # generators don't support indexing or slicing\nprint [5,6] + gen() # generators can't be added to lists\n</code>\n</pre>\n", "senID": 1}, {"text": ["Basically, use a generator expression if all you're doing is iterating once.", "If you want to store and use the generated results, then you're probably better off with a list comprehension."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Since performance is the most common reason to choose one over the other, my advice is to not worry about it and just pick one; if you find that your program is running too slowly, then and only then should you go back and worry about tuning your code."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Iterating over the generator expression or the list comprehension will do the same thing.", "However, the list comp will create the entire list in memory first while the generator expression will create the items on the fly, so you are able to use it for very large (and also infinite!", ") sequences."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Use list comprehensions when the result needs to be iterated over multiple times, or where speed is paramount.", "Use generator expressions where the range is large or infinite."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The benefit of a generator expression is that it uses less memory since it doesn't build the whole list at once.", "Generator expressions are best used when the list is an intermediary, such as summing the results, or creating a dict out of the results."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For example:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n sum( (x*2 for x in xrange(256)) )\n\ndict( ((k, some_func(k) for k in some_list_of_keys) )\n</code>\n</pre>\n", "senID": 2}, {"text": ["The advantage there is that the list isn't completely generated, and thus little memory is used (and should also be faster)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["You should, though, use list comprehensions when the desired final product is a list.", "You are not going to save any memeory using generator expressions, since you want the generated list.", "You also get the benefit of being able to use any of the list functions like sorted or reversed."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["For example:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n reversed( [x*2 for x in xrange(256] )\n</code>\n</pre>\n", "senID": 6}], [{"text": ["Sometimes you can get away with the tee function from itertools, it returns multiple iterators for the same generator that can be used independently."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "tee", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"href": "http://docs.python.org/lib/itertools-functions.html", "text": "itertools", "childNum": 0, "tag": "a", "childList": []}]}]]