[[{"text": ["Because PEP-8 tells us to use spaces :)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PEP-8", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/dev/peps/pep-0008/"}]}], [{"text": ["Tired of chasing after indentation typos ( 8 spaces ?", "no, 7 oops 9 ... ) I switched my sources to 'tabs only'."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["1 tab == 1 indent level, full stop"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "1 tab == 1 indent level, full stop", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["The point is: if you want to display the indentation as 4, 8 or pi / 12 character width, just change the settings in your text editor, don't mess with the code :p"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["(personally I use 4 char width tab... but some would prefer 3 or 8 space, or even use variable width fonts !!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The most \"pythonic\" way is to use 4 spaces per indentation level.", "The Python interpreter will however recognize spaces or tabs.", "The only gottcha is you must never mix spaces and tabs, pick one or the other.", "That said, the specification recommends spaces, most developers use spaces, so unless you have a really good reason not to, I'd say go with spaces."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "must never mix spaces and tabs", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}], [{"text": ["I recently came across an article titled Python: Myths about Indentation which discusses this and related questions.", "The article has good reasons for recommending the use of spaces when writing Python code, but there is certainly room for disagreement."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python: Myths about Indentation", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.secnetix.de/olli/Python/block_indentation.hawk"}]}, {"text": ["I believe it's true that most Python programmers use spaces only."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["USE AN EDITOR THAT DISPLAYS TAB CHARACTERS (all whitespace, for that matter).", "You're programming, not writing an article."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I use tabs.", "There's no room for a one-space error in the tabs (if you can see them).", "The problem IS that people use different editors, and the only common thing in the world is: tab==indent, as above.", "Some bloke comes in with the tab key set to the wrong number of spaces or does it manually and makes a mess.", "TABs and use a real editor.", "(This isn't just contrary to the PEP, it's about C/C++ and other whitespace-agnostic languages too)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["/steps down from soapbox"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Use an editor that allows you to insert spaces up to the tabstop when you press the TAB key, instead of inserting a \\t character.", "And then forget about it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The only inconvenience I experience with using spaces instead of tabs is that you cannot easily remove an indentation level, you have to remove 4 spaces instead of just one tab."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["My main reason for using tabs over spaces is the backspace key.", "If I'm on a line and I want to backspace-remove an indentation on just that one line I have to hit backspace 4x if it were spaces; whereas, I only need to hit it once if it's a tab."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I will continue to use tabs because—like was stated before—it's easier to convert from tabs to spaces, but not the other way around."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'm thinking I want to write a simple program that converts code with spaces into code with tabs, because I freaking hate spaces.", "They drive me up the wall!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Oh!", "And using the arrow keys to navigate left and right is always a pain in the ass when it's spaces."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Editor-to-editor mistake occurs when you have mixed indentation within a file.", "This arises as follows: a block of code is indented with 4 spaces, and then one indentation level \"in\", it is indented with tabs.", "Now the heathen who did this (mixing tabs and spaces) had it so his tabs are also 4 spaces, so he sees no problems, and python sees no problems.", "Now our victim comes along later, and he has his tabs set to 8 spaces.", "Now our victims thinks the code looks all whacked, and fixes it by removing one level of indentation, which now makes the code look like it is still 2 levels of indentation, but is really one level.", "At this point all hell breaks loose."], "childNum": 5, "tag": "p", "senID": 0, "childList": [{"text": "mixed indentation within a file", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "fixes it", "childNum": 0, "tag": "em", "pos": 4, "childList": []}, {"text": "removing one level of indentation", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "look", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "really one level", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["The lesson here is that you should never, ever, mix tabs and spaces.", "If you keep to this, then it is easy to reindent your code into spaces or tabs, regardless of which you personally use.", "The best way to ensure you don't mix tabs and spaces is to always run python with -tt, which will produce an error when tabs and spaces are mixed."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "-tt", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["As for tabs and spaces, I personally use tabs so separate indentation from appearance - it is much easier to change the appearance of code when it is indented with tabs than it is with spaces.", "I know this runs contrary to what 99% of python programmers do, but that is my personal preference, and it is easy in any case to convert a tabbed file to a spaced one.", "The reverse is not always true, since you can accidentally whack out 4 spaces in strings etc."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "personal", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["You CAN mix tabs and spaces...", "BUT a tab is considered to be the same indentation as 8 spaces, so unless your editor is set up to consider a tab to be 8 spaces you're asking for trouble when mixing them."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Everyone can agree how many spaces are in a space.", "No one can agree how many spaces are in a tab."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Thus spake the Lord: Thou shalt indent with four spaces.", "No more, no less.", "Four shall be the number of spaces thou shalt indent, and the number of thy indenting shall be four.", "Eight shalt thou not indent, nor either indent thou two, excepting that thou then proceed to four.", "Tabs are right out.", "--  Georg Brandl"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Thus spake the Lord: Thou shalt indent with four spaces. No more, no less. Four shall be the number of spaces thou shalt indent, and the number of thy indenting shall be four. Eight shalt thou not indent, nor either indent thou two, excepting that thou then proceed to four. Tabs are right out.", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}], [{"text": ["People will use different editors on the same code.", "These editors will represent a tab on the screen differently.", "If you're working on an editor that represents a tab as 4 spaces, if you indent the first line by \"\\t    \" and the second by \"\\t\\t\", they'll look like they're in the same indent level: 8 spaces. "], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "\"\\t    \"", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "\"\\t\\t\"", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["The python interpreter doesn't know your editor, and he has to interpret the tab as some amount of indentation.", "In fact, it interprets the tab as 8 spaces, so he'll see different indent levels than what you intended: 12 spaces for the first line, 16 spaces for the second.", "You're toasted. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Use spaces, if your text editor (or your workmates editor) have a different tab length you will start getting lots of errors of \"unexpected alignment\""], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You can even have trouble if you code alone.", "Just in the very moment you have two lines within the same block but one aligned with tabs and the other with spaces. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Everyone has different preferences on how much code should be indented.", "Let's say you share code with someone and he or she has different preferences regarding indentation.", "If the indentations are in tabs, your friend can always just change the tab width in their editor settings.", "However, if the indentations are in spaces, your friend will actually have to change the source code if he or she want to set it to their preference.", "Then when you get your friend's changes, you may decide to change it back to your preference.", "In this case, you will either have to deal with the tedium of changing indentation levels back and forth, or one person must adopt the other's preferences in indentation level.", "If both you and your friend use tabs, the fact that you have different preferences is a non-issue, as you can each see different indentation levels while the code remains unchanged.", "That is why, in my opinion, tabs are better than spaces for indentation in all programming languages. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I use two space indentation and an editor (kwrite) that inserts spaces instead of tabs when I hit the tab key."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]