[[{"text": ["Python code doesn't get compiled to C, Python itself is written in C and interprets Python bytecode.", "CIL gets compiled to machine code, which is why you see better performance when using IronPython."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You're right, C is a lot faster.", "That's why in those results CPython is twice as fast when it comes to dictionaries, which are almost pure C. On the other hand, Python code is not compiled, it's interpreted.", "Function calls in CPython are terribly slow.", "But on the other hand: "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n TryRaiseExcept:  +4478.9%\n</code>\n</pre>\n", "senID": 1}, {"text": ["Now, there's where IronPython get is horribly wrong."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["And then, there is this PyPy project, with one of the objectives being Just-In-Time compiler.", "There is even subset of Python, called RPython (Reduced Python) which can be statically compiled.", "Which of course is a lot faster."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "lot", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}], [{"text": ["Wandering off your question \"Why?", "\", to \"Oh, really?", "\" The \"good at different things\" (Jason Baker) is right on.", "For example, cpython beats IronPython hands down start up time. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n c:\\Python26\\python.exe Hello.py\nc:\\IronPython\\ipy.exe Hello.py\n</code>\n</pre>\n", "senID": 1}, {"text": ["Cpython executes a basic hello world nearly instantly(&lt;100ms), where IronPython has an startup overhead of 4 or 5 seconds.", "This annoys me, but not enough to keep me from using IronPython. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'm not sure exactly how you're drawing the conclusion that IronPython is faster than CPython.", "The link that you post seems to indicate that they're good at different things (like exceptions as has been pointed out)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Could it be explained by this notation on the page you linked to:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Ironpython is faster for certain types of operations, but slower on others.", "Overall, it is still a little bit slower on average."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]