[[{"text": ["What do I like about it :"], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "What do I like about it :", "childNum": 1, "tag": "strong", "pos": 0, "childList": [{"text": "What do I like about it :", "tag": "em"}]}, {"text": "What do I like about it :", "childNum": 0, "tag": "em", "childList": []}]}, {"tag": "ul", "num": 4, "lis": [{"text": "Very simple ORM", "tag": "none", "senID": 1}, {"text": "clear separation of template / controller", "tag": "none", "senID": 2}, {"text": "django-admin", "tag": "none", "senID": 3}, {"text": "pluggable apps : it seems to me that the Django community really nailed that one !", "tag": "none", "senID": 4}]}, {"text": ["What made me switch :"], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "What made me switch :", "childNum": 1, "tag": "strong", "pos": 0, "childList": [{"text": "What made me switch :", "tag": "em"}]}, {"text": "What made me switch :", "childNum": 0, "tag": "em", "childList": []}]}, {"tag": "ul", "num": 4, "lis": [{"text": "mainly curiosity", "tag": "none", "senID": 6}, {"text": "I heard a lot of good things about it from a colleague", "tag": "none", "senID": 7}, {"text": "I wanted something more lightweight than the Java I do for a living", "tag": "none", "senID": 8}, {"text": "I had a side project heavily data-driven for which the Django-Admin interface is very useful", "tag": "none", "senID": 9}]}, {"text": ["What features I'd like :"], "childNum": 2, "tag": "p", "senID": 10, "childList": [{"text": "What features I'd like :", "childNum": 1, "tag": "strong", "pos": 0, "childList": [{"text": "What features I'd like :", "tag": "em"}]}, {"text": "What features I'd like :", "childNum": 0, "tag": "em", "childList": []}]}, {"tag": "ul", "num": 3, "lis": [{"text": "better / simpler control of the transactions (configuring different types of transactions (read only / read write / some tweaking here and there) isnt as easy as i am used to. Having a session in view model, where the transaction is still open in the view doesnt make me all that comfortable, I would prefer if the transactions didnt leave a service layer. But again, there isnt really a service layer in the Django model.", "tag": "none", "senID": 11}, {"text": "better model for business logic (maybe that's just me, but I miss the service oriented approach of enterprise java, I never know if I should put the business logic in the view, in the form or in the model. None of those solution make me feel warm and fuzzy ... at the same time, I dont have heavy business logic in the application I develop for the moment, and I would probably still use Java for those)", "tag": "none", "senID": 12}, {"text": "stability (in the sense of not changing, not in the sense of not crashing). Again, coming from Java, where I'm still working on Java 1.4 for a lot of projects, having a project that just released 1.0 and all the refactoring that went with it is not very reassuring. It did take some work to follow trunk and using 0.96 was not particularly compelling. I dont think I would feel comfortable to use it on a mission critical enterprise project yet.", "tag": "none", "senID": 13}]}, {"text": ["I realize that there is quite a few improvements that I would like.", "Dont understand me wrong, I love Django and I will stick to it for a lot of projects.", "I jsut wont put it everywhere yet ..."], "childNum": 0, "tag": "p", "senID": 14, "childList": []}], [{"text": ["URL dispatching:  I was never a big fan of \"/foo.php\" is the file \"foo.php\" on my server, and if I want nicer URLs I need to mess around with mod_rewrite and keep that in line with what my logic in foo expects."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["ORM: Because 90%+ of your queries, in my experience, do not need to be written by hand.", "Smart caching is much more important for performance, in general.", "You can always drop to raw SQL as needed."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "always", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["Middleware and Signals: Easy to extend most parts of the request / response / view / render cycle without touching Django code itself."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It came out when I was disappointed with the Python web framework offerings.", "An easy sell for me."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Hmm, to be honest, I've never cared too much.", "The webserver part of your app is (in my opinion) always the easiest to scale.", "As long as you use 'best practices' and share nothing, all you need to do is add a software load balancer and you can add new webservers until the cows come home.", "The first bottleneck people generally hit is database load - but Django gives you great caching APIs that help you alleviate that."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["That said, I only skimmed this but it seems faster than Rails and the well known PHP frameworks: http://wiki.rubyonrails.org/rails/pages/Framework+Performance"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "http://wiki.rubyonrails.org/rails/pages/Framework+Performance", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.rubyonrails.org/rails/pages/Framework+Performance"}]}, {"text": ["I guess it depends how you define 'master'.", "The documentation is great, over the course of a decent sized site/app I think you'll use a little bit of everything, which is a great start."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["Likes"], "childNum": 1, "tag": "h2", "senID": 0, "childList": [{"text": "Likes", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["The excellent Documentation.", "Together with help from stackoverflow I have learned a lot in only a few days.", "It writting in Python.", "It has the wonderful contrib.admin which is even modular and extensible to embed it into the web app proper."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Dislikes"], "childNum": 0, "tag": "h2", "senID": 2, "childList": []}, {"text": ["None so far.", "I am still enchanted"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Switch"], "childNum": 0, "tag": "h2", "senID": 4, "childList": []}, {"text": ["Its my first web framework, so no switch.", "After using Python for some years Django seemed the natural selection to me, mainly for its clean design."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["What do you like about it?"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "the templates, specifically the inheritance feature, was amazing after dealing with jsps", "tag": "none", "senID": 1}, {"text": "not having to write sql anymore", "tag": "none", "senID": 2}]}, {"text": ["What made you switch/use it?"], "childNum": 0, "tag": "h2", "senID": 3, "childList": []}, {"text": ["A friend had been following its progress before it was publicly released, and I've been using it for personal projects ever since."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["What features you would like it to have that aren't there?"], "childNum": 0, "tag": "h2", "senID": 5, "childList": []}, {"text": ["I realize this isn't a trivial problem, and I think Google summer of codes have been spent on this, but I would like to see better ways to evolve the db (which rails seems to do a pretty good job of)."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["What would make you switch to it?"], "childNum": 0, "tag": "h2", "senID": 7, "childList": []}, {"text": ["I already use it at home, and I don't make those decisions at work."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["How fast is it in production?"], "childNum": 0, "tag": "h2", "senID": 9, "childList": []}, {"text": ["I've never run into issues, though for the most part django seems to stay out of the way, so performance seems based more on python or the db."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["How hard is it to master it? "], "childNum": 0, "tag": "h2", "senID": 11, "childList": []}, {"text": ["The documentation is pretty amazing, and enough people use it that answers are often available when that doesn't help.", "Additionally, when I've had to go into the source code, its been clean and documented as well, so I would say its easier to master than most frameworks, web based or otherwise."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}], [{"text": ["I haven't had had the opportunity to use it much.", "That said, my absolute favorite part of django is the built in administration console."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Likes:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "Pythonic (I can easily grok the language) and thus extend any part easily", "tag": "none", "senID": 1}, {"text": "Documentation,", "tag": "none", "senID": 2}, {"text": "community (I belong to the french one and they're very nice)", "tag": "none", "senID": 3}, {"text": "a full load of projects around it", "tag": "none", "senID": 4}, {"text": "full-integrated test engine. You can almost test a whole application without firing a web browser, just by writing tests.", "tag": "none", "senID": 5}, {"text": "the custom commands just rock. It allows you to perform custom tasks very easily, in a snap. I often use it to run batch tasks (cleanup a database, for example, or check for integrity on a production server - tests use their own database, not the actual data in your application).", "tag": "none", "senID": 6}]}, {"text": ["Why switch?"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "got bored of PHP-from-scratch.", "tag": "none", "senID": 8}, {"text": "had a RSI at the back of my hand, very painful. after switching to a semicolon-free language, it vanished (it's TRUE!)", "tag": "none", "senID": 9}, {"text": "much more solid developpement (TDD), and faster (you can buid a CMS in minutes) - as many other web framework, though.", "tag": "none", "senID": 10}]}, {"text": ["Dislikes:"], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": "no smooth data model migration. You often have to change your model because of an unexpected feature. That is painful, and you have to build it by hand, and it may be risky sometimes.", "tag": "none", "senID": 12}]}, {"text": ["How hard to master?"], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "If you already have Python skills, you can build up things in a few hours.", "tag": "none", "senID": 14}, {"text": "If you don't, first dive into Python (heh) - that'd take a few days.", "tag": "none", "senID": 15}, {"text": "\"Mastering\" it may take some time... And you often discover gems in Django documentation that will make you yell \"I love Django!\" (well, it works for me)", "tag": "none", "senID": 16}]}]]