[[{"text": ["For the answer to your first question, take a look at the following (slightly condensed) code from Python's source:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n #define PREC_REPR       17\n#define PREC_STR        12\n\nvoid PyFloat_AsString(char *buf, PyFloatObject *v) {\n    format_float(buf, 100, v, PREC_STR);\n}\n\nvoid PyFloat_AsReprString(char *buf, PyFloatObject *v) {\n    format_float(buf, 100, v, PREC_REPR);\n}\n</code>\n</pre>\n", "senID": 1}, {"text": ["So basically, repr(float) will return a string formatted with 17 digits of precision, and str(float) will return a string with 12 digits of precision.", "As you might have guessed, print uses str() and entering the variable name in the interpreter uses repr().", "With only 12 digits of precision, it looks like you get the \"correct\" answer, but that is just because what you expect and the actual value are the same up to 12 digits."], "childNum": 5, "tag": "p", "senID": 2, "childList": [{"text": "repr(float)", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "str(float)", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "print", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "str()", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "repr()", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["Here is a quick example of the difference:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n &gt;&gt;&gt; str(.1234567890123)\n'0.123456789012'\n&gt;&gt;&gt; repr(.1234567890123)\n'0.12345678901230001'\n</code>\n</pre>\n", "senID": 4}, {"text": ["As for your second question, I suggest you read the following section of the Python tutorial: Floating Point Arithmetic: Issues and Limitations"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Floating Point Arithmetic: Issues and Limitations", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/tutorial/floatingpoint.html#floating-point-arithmetic-issues-and-limitations"}]}, {"text": ["It boils down to efficiency, less memory and quicker floating point operations when you are storing base 10 decimals in base 2 than any other representation, but you do need to deal with the imprecision."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["As JBernardo pointed out in comments, this behavior is different in Python 2.7 and above, the following quote from the above tutorial link describes the difference (using 0.1 as an example):"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "0.1", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}], [{"text": ["You should read the infamous paper:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["What every computer scientist should know about floating-point arithmetic"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "What every computer scientist should know about floating-point arithmetic", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.22.6768"}]}, {"text": ["Click on the link that says \"CACHED\" to download the paper in PDF format."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You get a different result in your calculation because the numbers 1.4 and 2.3 are not represented exactly either.", "When adding them, you also accumulate their precision limitations."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["All floating point numbers have a limited precision, and because of the way that floating point numbers are usually represented internally (using base 2 rather than base 10), the limitations apply to numbers that we humans percieve to be easy to represent exactly."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The limited precision is rarely a problem for calculations, as the precision is still enough for most applications.", "When comparing floating point numbers on the other hand, the limited precision has to be considered."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["This is usually done by subtracting the numbers, and checking if the difference is small enough compared to the numbers."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["So, for exmample, if:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n abs(b - c) &lt; abs(b) / 1000000000000\n</code>\n</pre>\n", "senID": 5}, {"text": ["then you could consider them equal.", "How many digits you want to consider depends on the precision of the floating point number, i.e.", "if you are using single or double precision numbers, and what calculations you have done to reach the numbers.", "As the precision limits accumulate with each calculation, you might need to lower the threshold for when they are considered equal."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["When displaying a floating point number, it's rounded corrseponding to it's precision.", "If for example it's capable of representing 15 digits accurately, it could be rounded to 13 digits before being displayed."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Floating point numbers are intended for fast calculations.", "There are other data types, like Decimal, that can store a number exactly.", "Those are used for example for storing currency values."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["Floating point numbers are imprecise; it's a facet of the representation method.", "There's a lot of back information about precisely why this is; suffice it to say that it's an issue on pretty much any platform that provides floating point numbers."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The best way to deal with the imprecision is to have a confidence interval; that is, comparison of two calculated floats for equivalency can be problematic because the representations can be off by a tiny amount, so the way to deal with this is to subtract the two of them, and make sure the difference is no more than a small quantity.", "Many libraries already have this sort of functionality built in for floats, but it's not particularly hard to implement yourself when in doubt."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["This lecture is a pretty good insight to how the variables are stored in-memory and the professor includes an example that would give the unexpected results you are seeing.", "http://www.youtube.com/watch?v=jTSvthW34GU\nIf you need to compare the numbers cast them both as integers first and you will notice that they do equal if you perform the test."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}, {"text": "http://www.youtube.com/watch?v=jTSvthW34GU", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.youtube.com/watch?v=jTSvthW34GU"}]}], [{"text": ["All numbers are stored on a limited numbers of bits, hence you cannot just store the actual number and have to live with storing the closest number (imagine a fraction 1/3, if you want to store it on paper using decimal numbers, you will run out of world's recourses of trees).", "The alternative is symbolic representation you can find for example in Mathematica, which is just storing 1/3 as 1 and 3, but it's far away from machine and makes computations slower and more complicated. "], "childNum": 6, "tag": "p", "senID": 0, "childList": [{"text": "cannot just store the actual number", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "storing the closest number", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "1/3", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "1/3", "childNum": 0, "tag": "code", "childList": []}, {"text": "1", "childNum": 0, "tag": "code", "childList": []}, {"text": "3", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Take a look at some links people are posting here and read about floating point numbers... it's a little bit scary though and you won't trust machines anymore."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]