[[{"text": ["I'm currently using pyqt at work and I find myself totally satisfied.", "You have better documentation (IMHO), better event managing (signal-slot pattern is somehow more powerful than the old simple-callback style), and importing your custom widget in a  graphical designer like qt-designer is far easier.", "As far as I can tell qt-designer is more powerful than any wxpython counterpart, like Boa Constructor and pyGlade).", "You also have great support for translating program's strings in different languages (better support than wxLocale at least, and you can use a tool like Qt-Linguist which is fully integrated in the qt system)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I'm using wxpython in some hobbistic works, but I'm still a noob there.", "I think its greater advantage over pyqt is to have a native look&amp;feel on different platforms.", "This is a huge point if you are developing windows/linux applications, for example.", "Actually you could use \"skins\" to obtain a native look&amp;feel with windows-qt applications but I have no idea on how to achieve that (sorry, I've never used qt on windows :D)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Please note that, as of Jan 2009, while Qt 4.5 was to be available under LGPL, Riverbank Computing hadn't made any announcement about licensing for future versions of PyQt.", "PyQt is still only commercial/GPLv2/GPLv3."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "PyQt", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.riverbankcomputing.co.uk/software/pyqt/download"}, {"text": "commercial/GPLv2/GPLv3", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.riverbankcomputing.co.uk/static/Docs/PyQt4/pyqt4ref.html#license"}]}, {"text": ["As noted in comments for this answer, Nokia announced the LGPL-licensed PySide project in August 2009."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "PySide", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pyside.org/"}]}], [{"text": ["Honestly, I don't think that people will massively switch away from WxWidgets."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For python, there are PyQt bindings and WxPython bindings.", "Despite Qt being much more practical than WxWidgets, the majority of GUI python open source programs are written with WxWidgets.", "Since those programs are open source, the GPL vs LGPL did not matter that much in their choice of toolkit."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The same goes for Gtk.", "Many open source applications are written in Gtk, on windows, despite Gtk being very difficult to work with on windows.", "With Qt, those applications would be a lot easier to maintain on a cross platform basis, but it has not happened."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So, choice of toolkit is influenced by many parameters, licensing being only one of them."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I still don't understand why Qt is not more mainstream, because it's in my opinion the easiest and more practical GUI toolkit ever written."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["For those of us who are drawn to wxWidgets because it is the cross-platform library that uses native controls for proper look and feel the licensing change of Qt has little to no consequences."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Edit:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Regarding"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["let me quote the wxWidgets wiki page comparing toolkits:"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "wxWidgets wiki page comparing toolkits", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.wxwidgets.org/WxWidgets%5FCompared%5FTo%5FOther%5FToolkits"}]}], [{"text": ["Qt is very comprehensive and high quality framework.", "I am sure that many new projects that would have used wxWidgets will now use LGPL Qt instead.", "But projects that are already using wxWidgets will no doubt continue to use wxWidgets rather than doing a massive re-write."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I chose wxPython for 2 main reasons:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My ideal IDE designs, creates events, let me edit just the functional code needed, and run; without \"compiling UICs\", without switching editors, without going into the command line.", "While for Large scale applications it matters very little, my current domain is fast and small scale programs."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I was never able to setup Qt to cross compile.", "I remember seeing something from Trolltech saying that they don't officially support cross compilation, although I can't find it now."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There are many guides and such detailing how to get Qt to cross compile, so its possible (likely) that I was doing something wrong."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["When choosing a framework, I recommend considering and testing out their cross compilation abilities. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]