[[{"text": ["Python doesn't allow it because there is no sensible way to do it.", "You could invent arbitrary rules about how to handle such a case (and perhaps some languages do), but since there is no actual gain in doing so, Python refuses to guess.", "Classes are required to have a stable, predictable method resolution order for a number of reasons, and so weird, unpredictable or surprising MROs are not allowed."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["That said, there is a special case in Python: type and object.", "object is an instance of type, and type is a subclass of object.", "And of course, type is also an instance of type (since it's a subclass of object).", "This might be why OWL allows it: you need to start a class/metaclass hierarchy in some singularity, if you want everything to be an object and all objects to have a class."], "childNum": 11, "tag": "p", "senID": 1, "childList": [{"text": "is", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "type", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "object", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "object", "childNum": 0, "tag": "code", "pos": 3, "childList": []}, {"text": "type", "childNum": 0, "tag": "code", "childList": []}, {"text": "type", "childNum": 0, "tag": "code", "childList": []}, {"text": "object", "childNum": 0, "tag": "code", "childList": []}, {"text": "type", "childNum": 0, "tag": "code", "childList": []}, {"text": "also", "childNum": 0, "tag": "em", "childList": []}, {"text": "type", "childNum": 0, "tag": "code", "childList": []}, {"text": "object", "childNum": 0, "tag": "code", "childList": []}]}], [{"text": ["The MRO scheme implemented in Python (as of 2.3) forbids cyclic subclassing.", "Valid MRO's are guaranteed to satisfy \"local precedence\" and \"monotonicity\".", "Cyclic subclassing would break monotonicity. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This issue is discussed in the section entitled \"Bad Method Resolution Orders\""], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "\"Bad Method Resolution Orders\"", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/download/releases/2.3/mro/"}]}], [{"text": ["Part of this \"disconnect\" is because OWL describes an open world ontology.", "An Ontology has little or nothing to do with a program, other than a program can manipulate an ontology.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Trying to relate OWL concepts to programming languages is like trying to relate A Pianist and A Piano Sonata.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The sonata doesn't really have a concrete manifestion until someone is playing it -- ideally a Pianist, but not necessarily.", "Until it's being played, it's just potential relationships among notes manifested as sounds.", "When it's being played, some of actual relationships will be relevant to you, the listener.", "Some won't be relevant to the listener."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "potential", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["I think the answer is \"When you construct class C ... it must create instance of class B .. which must create instance of class C ... and so on\" This will never end.", "This is forbidden in most languages (in fact i don't know other case).", "You can only create an object with a 'reference' to other object that can be initially null."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["For a semantic reasoner, if A is a subclass of B, and B is a subclass of A, then the classes can be considered equivalent.", "They are not the \"same\", but from a reasoning perspective, if I can reason an individual is (or is not) a member of the class A, I can reason the individual is (or is not) a member of the class B.", "The classes A and B are semantically equivalent, which is what you were able to express with OWL."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'm sure someone can up with an example where this makes sense.", "However, I guess this restriction is easier and not less powerful."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Eg, Let's say class A holds fields a and b.", "Class C holds b and c. Then the view on things from C would be: A.a, C.b, C.c and the view from A would be: A.a, A.b, C.c. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Just moving b into a common base class is far easier to understand and implement, though."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]