[[{"text": ["Sounds like the classic conundrum :-)  In Python, there's nothing dirty or shameful about choosing to use a module if that's the best approach.", "After all, modules, functions, and the like are, in fact, first-class citizens in the language, and offer introspection and other properties that many other languages use objects to obtain."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The way you've described your options, it kinda sounds like you're not too crazy about a class-based approach in this case."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I don't know if you've used the Django framework, but if not have a look at their documentation on how they handle settings.", "These are app-wide, they are defined in a module, and they are available gobally.", "The way they parse the options and expose them globally is quite elegant, and you may find such an approach inspiring for your needs."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The second approach seems better.", "I'd use the first one only for configuration files or something."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Anyway, to avoid the problem you could always:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n from myapp.appstate import AppState\n</code>\n</pre>\n", "senID": 2}, {"text": ["That way you don't have to write the long line anymore."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The second approach is only significantly different from the first approach if you have application state stored in an instance of AppState, in which case your complaint doesn't apply.", "If you're just storing stuff in a class and using static/class methods, your class is no different than a module, and it would be pythonic to instead actually have it as a module."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "instance", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["I would go with the classes route as it will better organize your code.", "Remember that for readability you can do this:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n from appstate import AppSate\n</code>\n</pre>\n", "senID": 1}], [{"text": ["I'd definitely go for the second option : having already used the first one, I'm now forced to refactor, as my application evolved and have to support more modular constructs, so I now need to handle multiple simulataneous 'configurations'."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The second approach is, IMO, more flexible and future proof.", "To avoid the longer lines of code, you could use from appstate import AppState instead of just import appstate."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "from appstate import AppState", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "import appstate", "childNum": 0, "tag": "code", "childList": []}]}], [{"text": ["Why not go with an instance of that class?", "That way you might even be able later on to have 2 different \"sessions\" running, depending on what instance you use.", "It might make it more flexible.", "Maybe add some method get_appstate() to the module so it instanciates the class once.", "Later on if you might want several instances you can change this method to eventually take a parameter and use some dictionary etc.", "to store those instances."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "get_appstate()", "childNum": 0, "tag": "code", "pos": 3, "childList": []}]}, {"text": ["You could also use property decorators btw to make things more readable and have the flexibility of storing it how and where you want it stores."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I agree that it would be more pythonic to use the module approach instead of classmethods. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["BTW, I am not such a big fan of having things available globally by some \"magic\".", "I'd rather use some explicit call to obtain that information.", "Then I know where things come from and how to debug it when things fail."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Consider this example:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n configuration\n|\n+-&gt; graphics\n|   |\n|   +-&gt; 3D\n|   |\n|   +-&gt; 2D\n|\n+-&gt; sound\n</code>\n</pre>\n", "senID": 1}, {"text": ["The real question is: What is the difference between classes and modules in this hierarchy, as it could be represented by both means?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Classes represent types.", "If you implement your solution with classes instead of modules, you are able to check a graphics object for it's proper type, but write generic graphics functions."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["With classes you can generate parametrized values.", "This means it is possible to initialize differently the sounds class with a constructor, but it is hard to initialize a module with different parameters."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "sounds", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["The point is, that you really something different from the modeling standpoint."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]]