[[{"text": ["The point of SQLAlchemy is not code golf."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["SQL wins code golf all the time."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If this is your metric \"... take more code than custom SQL code, ... even simple filters are more verbose...\" you're doing the wrong thing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you want the most compact representation possible, you MUST use SQL.", "No choices.", "SQL is always the most compact notation."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If, on the other hand, you value readability, maintainability, database neutrality, a way to migrate your schema without breaking your applications, then SQLAlchemy is for you."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["If you value short SQL statements, do not waste time with ORM."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["SQL Alchemy has the following advantages:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Session management for transactions, rollback, etc, including ", "tag": "none", "senID": 1}, {"text": "You can write ", "tag": "none", "senID": 2}, {"text": "You don't ", "tag": "none", "senID": 3}, {"text": "Note also that you can select specific columns, contrary to what is stated in your question, even with the ORM (", "tag": "none", "senID": 4}]}, {"text": ["See also SQLAlchemy's author's most recent blog entry for some more reasons."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "most recent blog entry", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://techspot.zzzeek.org/?p=33"}]}], [{"text": ["Advantages of SqlAlchemy:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "You can easily build complex queries from code fragments. If you try the same with SQL, you'll run into all sorts of issues (adding parentheses in the right places, escaping values, mapping data from DB columns to something your code can use).", "tag": "none", "senID": 1}, {"text": "You can run the same code against different databases (say your data is in a MySQL and an Oracle DB)", "tag": "none", "senID": 2}]}, {"text": ["Of course, SA will not produce as compact code as an SQL expert.", "For people who are in the SQL mindset, using a tool that creates SQL under the hood, is always a horror.", "But SQL is harder to maintain than Python code.", "So if you're not a SQL pro, the result will be good enough and you will be much faster."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Lastly, the SA will help you avoid many silly mistakes and security holes which is very important if you write something for the web."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Also, with SA, you can pass query from one function to another, filter it and so on.", "It can be very handy sometimes and it is completely ugly, if you tring to build RAW SQL in that way. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["With relationships, it is much easier to access the related objects."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For instance, to give a raise to a whole group of staff who work at a given location:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n for person in location.staff:\n    person.salary *= 1.05\n</code>\n</pre>\n", "senID": 2}, {"text": ["It is much easier to do complicated operations in python than in SQL."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I've also used SQLAlchemy to migrate data from one database to another, keeping relations intact."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I'm quite good with SQL and I had a similar problem figuring out why on earth I'd want to learn a complex orm like sqlalchemy."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Bottom line it's harder to make security gaffes, it's easier to do complex things (most of the time), and it's just plain nice to work directly with objects. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I often spent quite a lot of work writing update and delete queries, but with an orm that's automatic and as natural as it can possibly be."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I also really liked the database agnostic part.", "I never thought it was an issue, we only used MySQL - until we switched to Postgres, then it saved the day."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["And it is very nice to add methods and properties to the model classes, it makes using the data layer of the code very natural."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Well, by abstracting away of a raw SQL code to the SQLAlchemy construct, you can support multiple RDBMS without worrying about compatibility."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["On the other hand, the power of such ORMS unleashes when you start adding relations to your schema - in such case ORM code would be definitely shorter that it's JOIN-esque SQL equivalent."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You shouldn't be drilling into soup every time you want to access a table.", "It would be much cleaner to just bust it out once (mytable = soup.mytable)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "mytable = soup.mytable", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["So your verbose query looks more like this:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n mytable = soup.mytable\nmytable.filter_by(and_(mytable.foo &lt; 'x',mytable.foo &gt;= 'y'))\n</code>\n</pre>\n", "senID": 2}, {"text": ["You could get really carried away, and actually write reusable code:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n # Note, nobody likes a show-off, or an architecture astronaut. \n# Don't do this without a good reason, and consulting a co-worker. \ndef get_in_range(table, attribute, min, max):\n    return table.filter_by(and_(attribute &gt; min, attribute &lt; max))\n</code>\n</pre>\n", "senID": 4}, {"text": ["This takes you away from the COBOLesque global variables and lack of structure that SQL encourages.", "If, for some reason, you want to rename a table then it's easy to just change one variable, rather than searching through SQL scripts."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["SQL doesn't usually need flexible, reusable code.", "You can usually just get away with hardwired one-liners.", "But it just feels better to know you have the flexibility, if you need it. "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["Yesterday I spend four hours for writing simple subquery in SQLAlchemy for SQLite then turn directly to pysqlite which allow me to wrote and execute simple human-understandable SQL request."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I mean that SQLAlchemy is a freaky way to using some specified database's SQL engine."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]