[[{"text": ["I'm primarily a (happy) Drupal developer these days, but a friend whose dev skills surpass mine has switched happily from Drupal to Django.", "Here's his set of reasons."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Here's his set of reasons", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://nicksergeant.com/blog/django/drupal-v-django"}]}], [{"text": ["I've built several sites on Drupal and Django, my conclusion is: if you need to create something similar to the standard drupal (or Ubercart) feature-set, you don't have much time for development, and you don't expect hight load pressure on a site - you should pick Drupal."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But if you do need to create something more or less custom (no drupal modules already available) you should go with Django - it is quicker and more pleasurable to implement custom complex features using Django.", "For example if my goal is to implement a second stackoverflow, I'll prefer Django because it will be extremely complicated to implement this badge-based rating system with Drupal. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["P.S.", "Studying Python (and Django) is an investment in your future, I think.", "You'll never be able to implement something similar to DropBox using drupal and php, although it could be implemented with java - but java is not so good from development speed perspective."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Drupal and Django doesn't make for a good comparison, as they are quite different."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If all you need is a simple website with a CMS and Paypal, I would go for Drupal.", "Drupal's strength compared Django is it's many modules (modular system), which most of the time can get you where you want.", "Drupal is also extremely flexible, and you can change almost anything from within your own code, and there is a huge demand for Drupal developers.", "You can also let site builders create content, display content and much from from within the AI."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Django on the other hand, is more simple and structured.", "It's based a lot more on code, making it fast and easy to develop something, but hard for non coders to change certain things.", "For sites that require a lot of custom coding, I usually prefer working with Django.", "Python is also a more structured programming language than PHP (IMO), and it's easier to make more maintainable code."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Jump into what you like or what attracts you most after getting a little overview of the capabilities and constraints.", "I never worked with drupal, but I can recommend django."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Consider your deployment.", "Pretty much every host will support Drupal.", "If you go with Django, you will need to select a host that supports fast_cgi or wsgi"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You already know php, so just for that you might want to stick with Drupal.", "However, I prefer Django over Drupal for many reasons."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.reddit.com/r/django/comments/bhvhz/the_onion_uses_django_and_why_it_matters_to_us/ provides some excellent background."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.reddit.com/r/django/comments/bhvhz/the_onion_uses_django_and_why_it_matters_to_us/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.reddit.com/r/django/comments/bhvhz/the_onion_uses_django_and_why_it_matters_to_us/"}]}, {"text": ["Basically if want things done properly with lots of flexibility, go with Django.", "If you're very familiar with php, don't feel like learning python, and your site requirements are basic, go with Drupal."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Something to keep in mind is that Django is a bona fide web framework, whereas Drupal is more of a web platform.", "That is, sometimes you have to hack Drupal to get what you want or that it doesn't fit all situations."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I had never heard of Spring Python but based on the fact that their own site is powered by Drupal, I wouldn't recommend it.", "Especially if you know Java already, why not consider the original Spring platform?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I've been developing with Django for more than 2 years and have built a couple of Drupal sites in the meantime (per client's specific request to use Drupal).", "My conclusions are the following:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Even for a smaller site I would have done it quicker building it from scratch with django (or maybe even PHP) for a simple reason, writing code for me is faster than hunting through drupal's unorganized mess of menus and options, or hunting on the web for a module that implements hack X to enable feature Y."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Migrating a site from development to production with Drupal is a big PITA.", "You can forget about using a VCS tool.", "All your work is in in the MySQL dump (including configurations, programming logic, views etc.", "), a few hacked up modules and the uploaded files."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]