[[{"text": ["You should figure out why you want to learn.", "If you're interested in making money, developing small standalone games is probably not a good idea.", "If you're just interested in learning fundamentals, there are plenty of good libraries out there."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Some examples:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "PyGame - ", "tag": "none", "senID": 2}, {"text": "SDK - ", "tag": "none", "senID": 3}, {"text": "Allegro - ", "tag": "none", "senID": 4}]}, {"text": ["Reference"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["http://code.reddit.com/wiki/help/faqs/programming#WhatprogramminglanguageshouldIuseformynewgame"], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "http://code.reddit.com/wiki/help/faqs/programming#WhatprogramminglanguageshouldIuseformynewgame", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.reddit.com/wiki/help/faqs/programming#WhatprogramminglanguageshouldIuseformynewgame"}]}], [{"text": ["Python's Pygame is certainly a good choice as others have said.", "If you want to get in to deep video game programming though.. move on to something like C++ or another lower level language.. from experience, most higher level languages tend to put artificial hurdles up in regards to decent video games.", "Though for a simple 2d game you cant go wrong with python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["another decent environment to use is Ogre3d, but you would need C++ or the PyOgre bindings (which are not up to date, but I hear they do work okay)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Going from web to game design really is a decent step, as long as you have a good sense of design.", "the physics and game logic can be learned, but ive yet to see anyone who could properly learn how to write a decent GUI.. as is seen in most cases these days, the final GUI lay out tends to be a process of elimination or beta with trial and error."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Only suggestion i have left is keep your game logic as far away as possible from your graphics.", "Be Modular."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["-edit-\noh and a note.. stay away from Tkinter in python for anything more than a simple tool..", "I have found it most frustrating to use.", "there is wxPython, GTK, pygame, and PyQT.. and all of them (in my opinion) are far better graphic frameworks."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["A good starting point might be trying a turn-based game or two, if PHP is currently your main strength.", "Those work well over HTTP, bouncing requests and responses back &amp; forth, while an action platformer is a very different beast - you might make an HTTP request to log high score or level-clear info, but actual gameplay would have to be run client-side to maintain any sense of action - either Javascript &amp; canvas or Flash, if it's web-based."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There are some (mostly dead but) open source turn-based PHP games worth a look, to get a feel for some general concepts - the wittily-named phpMud and phpMMORPG come to mind, and a few board &amp; card games."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "phpMud", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://sourceforge.net/projects/phpmud/"}, {"href": "http://freshmeat.net/projects/phpmmorpg/", "text": "phpMMORPG", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["It's just a baby step towards what you want to do and might not sound as fun, but game programming of any kind involves a lot of learning and hard work.", "Designing maps &amp; system mechanics, animation &amp; visual effects, physics, hitboxes, tons of math everywhere, and the hardest part, getting it all to actually run smoothly - it's a struggle to get something working, and an all-out war to get it \"right."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["That said, if you just want to get up to your elbows in a platformer to see what it's like and your Javascript is fairly solid, this set of articles is a great starting point.", "Brent Silby made a few neat shmups &amp; platformers that pre-date canvas too, also worth a look."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "this set of articles", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.brighthub.com/hubfolio/matthew-casperson/blog/archive/2009/06/29/game-development-with-javascript-and-the-canvas-element.aspx"}, {"text": "Brent Silby", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://def-logic.com/main/?cat=3"}]}], [{"text": ["Looking at your tags, web games are mostly client side, and since you aren't going to use flash, i would say JavaScript would work for 2D.", "With all the libraries and plug-ins out there, JavaScript can actually handle it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Taking a look at OpenGL may not be a terrible idea.", "You can use the library in many languages,  and is supported with  in HTML5 (WebGL).", "There are several excellent tutorials out there."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you want to learn more Python while doing so, you may want to take PyGame or an equivalent program.", "PHP, Ruby and JavaScript aren't going to help you in the video game section, though.", "They're all related to the internet. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to start of real easy, try out Genesis3D.", "you can make awesome 3D FPS games, and its quite easy to get the hang of too.", "Took me only 5 days :D"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Unity made me sick to my stomach, and so did Blender3D's game engine, so I personally say not to use those.", "It intimidated me."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]