[[{"text": ["Yes.", "Period.", "Study EveOnline game for more information.", "Look at pygame framework.", "Free free to use Google to find more."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "EveOnline", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://play.eveonline.com/en/home.aspx"}, {"text": "pygame", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.pygame.org/news.html"}]}, {"text": ["Yes.", "Look at the number of Python web frameworks plus the Twisted framework.", "Feel free to use Google to search for Python networking."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Twisted framework", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/trac/"}]}, {"text": ["Not usefully.", "This isn't C."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Look at the TIOBE index."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "TIOBE index", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.tiobe.com/content/paperinfo/tpci/index.html"}]}], [{"text": ["I think that Python is very powerful to do a lot of things, but just like Java and C++, it often depends on good third-party libraries.", "I come from a Java background but use Python for a lot of things, and it's been a fun ride.", "I've done things like statistics, and automation, not sure about the UI though that often depends on the toolkit more than the language. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python networking works well.", "I don't know if I'd use it to build a fast algorithmic trading system or a VOIP application, but for most intents and purposes, especially at higher levels of abstraction, it's fine and easy to use.", "You would need external libraries for things like SSH or FTP."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python is quite popular and has very good online support, active community, and major corporations (likeGoogle) that use it.", "I found the official online tutorial and reference to be excellent. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I have to say that I disagree with the \"every idiot with a computer\" line.", "There's a difference between knowing a language and using it right, and that's true about every language, even natural ones :)  Python does have a lot of functional elements that are not as trivial to use for people coming from a procedural background, so there's always room for growth. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The one problem with Python compared to languages like C and Java is that it is not statically typed.", "This makes it much faster to write code, but also makes it *much easier) to make mistakes that can be quite nasty to debug.", "For instance, the same variable can contain a String reference at some point, and a reference to a list of strings at some other point. "], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "much faster", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [], [{"text": ["Definitely.", "Python is a good tool for all of those except automating install processes, where it might be the right tool but more likely the right tool will likely be decided by what specifically you are automating."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Yes.", "You will want to look into Twisted."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Twisted", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/"}]}, {"text": ["\"Open source\" refers to the licensing of your code, not the viewability of its source code.", "Hiding Python source code isn't especially possible, and the results of decompiling Python bytecode will result in much more readable code than the equivalent tools in languages like C. Don't worry about this!", "You can't prevent people from stealing your car or your computer if they are willing to break the law, and you can't do the same for your code in any language."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Don't worry about this!", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["This is an unanswerable question.", "Google will give you lots of conflicting results with different metrics, most of them useful.", "You're also being a bit silly ;)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["As far as learning materials go, I recommend How to Think Like a Computer Scientist, which is a good text that does not presume any existing programming knowledge.", "It is available for free online, or you could buy a print copy if you prefer.", "(Don't bother learning 3.x yet.", "There is not enough library support to do much useful stuff like you want to do, and when there is picking it up will be a breeze; it's not very different than 2.5/6/7."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "How to Think Like a Computer Scientist", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://openbookproject.net/thinkcs/python/english2e/index.html"}]}], [], [{"text": ["Points 1 and 2: HELL YEAH."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Point 4: kind of.", "Python is good at some network stuff.", "It's not Java or C++.", "Just use zlib (zip library) and pickle (serialization) for everything, and look at xmlrpclib if you need IPC."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Point 3: No.", "However, you can write C modules (for the performance critical, and hard-to-copy) parts of your code, and that would make it non-trivial to reverse-engineer."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Python is up to the task (and better) for 1, 2 and 4."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The best solution for 3 from what you describe would probably be to make your programs really open-source with GPL or BSD like licence.", "This way people will edit your super-cool sources (but often experienced programmers, not just script kiddies) and build on then but leave your name in for posterity."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]