[[{"text": ["The standard way to distribute packages with setuptools includes an ez_setup.py script which will automatically download and install setuptools itself - on Windows I believe it will actually install an executable for easy_install.", "You can get this from the standard setuptools/easy_install distribution."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "ez_setup.py", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "easy_install", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["In most librarys I ever installed for python, a warning apears \"You have to install setuptools\".", "You could do it as well I think, you could add a link so the user don't have to search the internet for it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I have used setuptools to compile many python scripts that I have written into windows EXEs.", "However, it has always been my understanding (from experience) that the computer running the compiled EXE does not need to have setup tools installed."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Hope that helps"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You can't assume it's installed.", "There are ways around that, you can fall back to distutils (but then why have setuptools in the first place) or you can install setuptools in setup.py (but I think that's evil)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Use setuptools only if you need it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["When it comes to setuptools vs distrubute, they are compatible, and choosing one over the other is mainly up to the user.", "The setup.py is identical."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You can download Windows EXE installers and a Linux RPM from here"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://pypi.python.org/pypi/setuptools"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://pypi.python.org/pypi/setuptools", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pypi.python.org/pypi/setuptools"}]}, {"text": ["Then, once you have setuptools in place you can use the easy_install command to both download and install new packages.", "Because easy_install, also automatically downloads and installs dependencies, you might want to set up virtualenv before you actually use it.", "That way you can decide whether or not you want to install a bunch of packages into your system's default Python install."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "easy_install", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "virtualenv", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://pypi.python.org/pypi/virtualenv/1.3.4"}]}, {"text": ["Yes, this means that your users will have to have setuptools installed in order for them to use it.", "Of course, you could take the setuptools installers, rename them, and package them up with like NSIS and distribute that to your users.", "The fact is, that you have to install something, so if you don't want to put your application in the installer, you can package up setuptools instead."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "NSIS", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://nsis.sourceforge.net/"}]}], [{"text": ["I would say it depends on what kind of user you are addressing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If they are simply users and not Python programmers, or if they are basic programmers, using setuptools might be a little bit too much at first.", "For those the distutils is perfect."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For clients, I would definitely stick to distutils."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For more enthusiast programmers the setuptools would be fine."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Somehow, it also depends on how you want to distribute updates, and how often.", "For example, do the users have an access to the Internet without a nasty proxy setup by their company that would block setuptools?", "- We do have one and it's an extra step to configure and make it work on every workstation."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]