[[{"text": ["There's a number of components required to make an app fully portable:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "The runtime environment itself. This can be ported relatively simply, by setting up a CGI or FastCGI server that emulates the App Engine environment (which itself is basically slightly-enhanced CGI). Most of the code to do this is already in the SDK. Unfortunately, there's no easy pre-packaged toolkit for this yet.", "tag": "none", "senID": 1}, {"text": "The datastore. By far the most complicated API to port. There are a number of efforts underway: ", "tag": "none", "senID": 2}, {"text": "The users API needs replacing with something else, such as an OpenID based API. Again, fairly simple, but no premade solutions yet.", "tag": "none", "senID": 3}, {"text": "The Memcache API needs a backend that uses standard C memcache backends.", "tag": "none", "senID": 4}, {"text": "The other APIs have perfectly functional backends as part of the SDK, so don't really need porting.", "tag": "none", "senID": 5}, {"text": "Cron support would also need implementing, as would background processing, XMPP, etc, when they become available.", "tag": "none", "senID": 6}]}, {"text": ["As you can see, there's a lot of work to be done, but no fundamental barriers to making your App Engine app run outside Google's environment.", "In fact, if you're interested, you're more than welcome to participate - I and others have plans to combine the solutions for the various pieces into a single 'OpenEngine' solution for hosting your own apps."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Use a high level framework that works on App-Engine.", "That way you can port your code to other servers when you want."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["django has been patched and ported to work in the Appengine patch project and is the most used FW on appengine."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Appengine patch", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/app-engine-patch/"}]}, {"text": ["You may want to refer this step by step intro to running a django app on App engine"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "running a django app on App engine", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://uswaretech.com/blog/2009/04/develop-twitter-api-application-in-django-and-deploy-on-google-app-engine/"}]}, {"text": ["As far as the parallel infrastructure to run an app engine application is concerned, it is still way far.", "App Engine itself hasn't got as popular as people believed it to and google wanted it to be.", "Plus it is harder to develop on the builtin WebApp framework than on django."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Its quite unlikely to see a parallel infrastructure to run app engine application on, atleast for years to come.", "Rather it is likely to see django and other popular frameworks work out of the box on app engine and the work on this is currently underway in the referred project."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["So far, I found an experimental host called app-drop which is capable of hosting google app-engine projects.", "This should mean that it's atleast possible to run app engine projects outside of google's infrastructure. "], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "app-drop", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://jchrisa.net/drl/%5Fdesign/sofa/%5Fshow/post/announcing%5Fappdrop%5Fcom%5F%5Fhost%5Fgo"}, {"text": "possible", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["This is however clearly not yet suitable for production."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You can build AppEngine applications using the Django python framework (although the supported version is a bit behind the most recent Django release).", "Where you lose portability (at least right now) is when using GQL/BigTable for persistence.", "This is Google proprietary database platform.", "As Hank mentioned this is one of the biggest reasons to actually use AppEngine, but it is also the single largest locking point."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Here are a couple of  links to Django support in AppEngine and GQL/BigTable:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["http://code.google.com/appengine/articles/django.html"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}, {"text": ["http://code.google.com/appengine/docs/python/datastore/gqlreference.html"], "childNum": 0, "tag": "a", "senID": 3, "childList": []}]}], [{"text": ["The code should be mostly portable (they do a pretty good job of indicating which modules you can't use on AppEngine and which AppEngine-specific code corresponds to which forbidden modules), but the whole point of AppEngine is to get access to Google's infrastructure.", "There's not much point to writing your code to the AppEngine restrictions if you aren't going to be using their infrastructure."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["AppDrop is a proof of concept port of AppEngine to Amazon Web Services / Elastic Computing completed in April of 2008.", "It uses a flat file instead of BigTable and runs in a single instance, so there are scaling issues; but it's developer says it took him only four days, and perhaps these limitations can be addressed by others."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'm dealing with the same problem, and the only real problem is the datastore.", "I mean, the memcache and wsgi app have the exact same interfaces as outside appengine."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So I abstracted the memcache in some cache module where I can replace the backend (pretty much like django does it)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And I'm planning on implementing a subset of the datastore api objects and methods (basically get, put, query, Model) on top of a different backend like tokyo cabinet.", "You could even do this on top of an sql database with a smart data model, but I wouldn't recommend it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I did the reverse migration from vanilla Unix to app engine recently  very easily by using WHIFF resources.", "Basically configure anything platform dependant as a resource and then swap/replace the resources on different configurations."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://piopio.appspot.com/W1000_1000.resources"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://piopio.appspot.com/W1000_1000.resources", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://piopio.appspot.com/W1000_1000.resources"}]}, {"text": ["also see "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["http://aaron.oirt.rutgers.edu/myapp/docs/W1100_1200.wwiki"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://aaron.oirt.rutgers.edu/myapp/docs/W1100_1200.wwiki", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://aaron.oirt.rutgers.edu/myapp/docs/W1100_1200.wwiki"}]}, {"text": ["for a detailed example of resource swapping/configuration.", "(note: links may go away eventually, app is experimental."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Check out typhoonae.", "it's in beta, but quite usable – we moved one of our apps to inhouse server running this stack."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "typhoonae", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/typhoonae/"}]}]]