[[{"text": ["I recommend Python.", "It easily fits all your criteria.", "Great documentation and tutorials are available on line."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I have little experience with Ruby.", "I guess a Ruby programmer would recommend Ruby."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["F#?", "Not so sure about that.", "I have a feeling that you would probably have more concepts to wrap your head around before being productive on F#."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["F# is obviously incredibly bad for learning a language with a dynamic type system, because it doesn't have a dynamic type system.", "Quite the opposite: it's got a much more advanced static type system than the current mainstream languages, for example Java, C, C++ or its cousins C# and Visual Basic.NET."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "incredibly", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "static", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["As for the other two, I don't think that there is a clear winner."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["However, for your first dynamic language, I would recommend Self, Newspeak or Ioke.", "All three of these are incredibly dynamic, much more so than Ruby or Python."], "childNum": 4, "tag": "p", "senID": 2, "childList": [{"text": "Self", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://SelfLanguage.Org/"}, {"text": "Newspeak", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://NewspeakLanguage.Org/"}, {"text": "Ioke", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://Ioke.Org/"}, {"text": "incredibly", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Unfortunately, Ioke and Newspeak are very new and Self hasn't been updated in a while (although it has picked up steam in the recent months), so, as an alternative I would suggest Io."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Io", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://IoLanguage.Com/"}]}, {"text": ["I personally find that when I want to learn about some new concept, it's easiest to learn it with a language that takes it to the extreme: static typing, functional programming and lazy evaluation in Haskell, OO in Self, class-based OO in Newspeak, syntactic metaprogramming in Scheme, concurrency in Clojure, fault-tolerance in Erlang, Design-by-Contract in Spec#, concatenative programming in Factor and so on."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["One of the biggest problems newcomers on the Ruby mailinglists have, is that they are still writing Java, C#, PHP, C++, C, Pascal, but just with Ruby syntax.", "That won't happen with Self!", "The language is just too different, so that it will force you to embrace its dynamism.", "In Ruby or Python you will have to force yourself."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "still", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Def look at Python if you are going to do a lot of scripting from a terminal.", "Dive into python is a very useful book to start with."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Dive into python", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://diveintopython.org/toc/index.html"}]}, {"text": ["The newest version of Python is the Python 3000 version (Python 3.1), but I'm still doing the bulk of my work on Python 2.5.", "There are a lot useful libraries that haven't been migrated yet. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'd recommend installing version 2.5 or 2.6 to get started.", "Once you have an interpreter installed, you can start in on the file system right away."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "the file system right away", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://diveintopython.org/file%5Fhandling/file%5Fobjects.html"}]}], [{"text": ["If you're going to consider Python, here are some of the things that you'll like:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 7, "lis": [{"text": "Fantastic ", "tag": "none", "senID": 1}, {"text": "A handful of built-in ", "tag": "none", "senID": 2}, {"text": "The standard library ships with ", "tag": "none", "senID": 3}, {"text": "Great community sites, such as ", "tag": "none", "senID": 4}, {"text": "The free ", "tag": "none", "senID": 5}, {"text": "It's very easy to interface with your own or existing C/C++ libraries--for when you need that raw speed. When I say easy, it's just a matter of including ", "tag": "none", "senID": 6}, {"text": "There's already a plethora of Python software in the open. Whatever your needs may be, there's probably someone who's already done it. You'll be surprised with the ease of using someones distributed code: you hook it in and it simply just works.", "tag": "none", "senID": 7}]}], [{"text": ["I was in the same position a couple of months ago. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I found Ruby easier/nicer to learn than Python, basically because I found the OO characteristics more refined ( and I have strong OO background having programming in Java all my [professional] life )"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python is multiparadigm, which means some things are not as I expect them."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For instance to know the length of a string I would type:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n \"oscar\".length()\n</code>\n</pre>\n", "senID": 4}, {"text": ["In Ruby this worked fine. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["In Python you have to type:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"code": "<pre>\n<code>\n len( \"oscar\" )\n</code>\n</pre>\n", "senID": 7}, {"text": ["Also from the interpreter if I wanted to display the available methods for a given object in Ruby what I expected did work"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"code": "<pre>\n<code>\n \"oscar\".methods()\n</code>\n</pre>\n", "senID": 9}, {"text": ["But I Python I have to spend some time to find out I have to type:"], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"code": "<pre>\n<code>\n dir( \"oscar\" )\n</code>\n</pre>\n", "senID": 11}, {"text": ["I found also the constant need of using the \"self\" a bit annoying ( just a little because I don't really use Python that much ) "], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["I did a couple of scripts with Ruby, to extract information from log files, fetch data, etc.", "etc. "], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["Currently I know too little about both anyway, and right now my choice is Python just because of the \"Google App Engine\" :) "], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"text": ["Still, I think they both terrific languages.", "Learn both if you can.", "As for F# no comments. "], "childNum": 0, "tag": "p", "senID": 15, "childList": []}], [{"text": ["F# is a statically typed language - which is not a drawback per se.", "However, its functional paradigm might not be best choice if your main objective is writing programs for manipulating files, and could be hard to grasp if you've programmed in a procedural language before.", "Another disadvantage of F# is that it isn't entirely cross platform (yes, there is Mono, but it's lagging behind)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python and Ruby seem quite similar really (even though I only know some Ruby basics), especially for your purpose.", "Python's main advantage would probably be a larger community and hence a larger body of libraries and learning material."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["F# is both statically typed and more complex."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python and Ruby are both good fits for your requirements.", "Note, however, that Python 2 and Python 3 have some significant differences -- if you choose Python, you need to choose which one.", "I prefer Ruby myself."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Both python and ruby meet the criteria.", "F# will have more of a learning curve if you've never done functional programming before."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "F#", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["Python, IMHO.", "F#, as has been mentioned, is \"right out\" (to be pythonic ;).", "Ruby has more magic characters in its syntax than Python, you have to worry about braces, etc.", "On the other hand, it's closer to being 100% object-oriented.", "You can't go wrong with either Python or Ruby."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The best one language i seen to fun and learn is Scheme.", "It's described by nice and classic SICP book (it's free and video course free also).", "Scheme implementation for scripting in Unix environment is named Scsh.", "Current language definition and it's library described by short standart known as R[56]RS.", "Language is LISP based, has macro system, continuation and tail call support."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you know scheme then scsh is perfect tool to write small batch scripts.", "Just see examples here"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "here", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.scsh.net/docu/howto.html"}]}], [{"text": ["I'm a python developer.", "It's quite good if you want to earn money in science, finance.", "At the bank where I work there are major projects both in F# and Python.", "Both are proven platforms."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If I HAD to learn a pure functional language alongside python I'd probably go for Haskell rather than F# - it's the daddy when it comes to advanced type-systems. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Having been a Perl programmer for years who converted to Python, I would like to throw in vote for Python as it is my favorite language I know.", "Some people hate that it forces readable code on you by the required indentation, but I love it.   "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In many ways the sheer elegance in which Python gets the job done is in itself a lesson."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Down with braces, up with spaces!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]