[[{"text": ["Am I right in thinking it's currently implemented in CPython?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Have you tried profiling your code yet to identify exactly what is slow about it?", "First step in trying to improve something should always be identifying what exaclty is wrong :-)"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "what", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["I voted up the 'profile it' answer, but wanted to add this: where possible the best optimisation you can make is to use Python standard libraries or built-in functions to perform the tasks you want.", "These are typically implemented in C and will provide performance broadly equivalent to any extension, including extensions written in Cython.", "If your algorithms are performing character by character loops in Python then those should be the first things to go, if possible."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But if you have algorithms that can't be reworked in terms of built-ins or other existing standard libraries, Cython seems like a reasonable approach.", "It just compiles pseudo-Python down to native code and is as suited to string operations as any other operation, really.", "But I'm not convinced you will see a great benefit from using Cython if you just hand it idiomatic Python code.", "The maximum benefit will come if you are able to rewrite some or all of each algorithm in C so that low-level operations are not constantly translating variables across the Python/C barrier."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Finally, Unicode - you've implied it might be 'a big issue' but haven't specified how you're using it.", "Cython will presumably produce C code that calls the relevant Python APIs that handle Unicode so the functionality is unlikely to be limited.", "However handling Unicode strings in C is non-trivial and may mean that the idea of rewriting some of your algorithms in C for better performance isn't worth the effort.", "A lot of classic string algorithms simply won't work on many Unicode encodings, which aren't 'strings' in the traditional sense of having 1 unit of storage per character."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["\"Ridiculously easy\" is a very relative term.", "\"Getting started\" is just that.", "Writing robust extensions in C requires very careful attention to things like reference counting, memory allocation/freeing, and error handling.", "Cython does much of that for you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A non-unicode string in Cython is either a Python str object, or it's an array of char, as in C. What Cython-specific documentation do you think that you need?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I recommend that you try Cython for yourself.", "BUT before you do that, I strongly recommend that you examine your Python code for inefficiencies.", "Sometimes you can get big speedups ridiculously easily."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For example, compressing runs of space characters ... using"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n re.sub(' +', ' ', s) # one space in pattern\n</code>\n</pre>\n", "senID": 4}, {"text": ["means that in the presumably not uncommon case where a run has a length of 1, it will be replacing a space with a space.", "If all the runs have length 1, it will create a new replacement string when it could easily just increment (or not decrement, or whatever) the reference count of the input string and pass that back."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n re.sub('  +', ' ', s) # two spaces in pattern\n</code>\n</pre>\n", "senID": 6}, {"text": ["produces exactly the same results and may run faster ... let's see:"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["All runs length 1: It runs at 3.4 times the speed.", "Not shown: the longer the input string, the better it gets."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"code": "<pre>\n<code>\n \\python26\\python -mtimeit -s\"s='now is the winter of our discontent'; import re; x = re.compile(' +').sub\" \"x(' ', s)\"\n100000 loops, best of 3: 8.26 usec per loop\n\n\\python26\\python -mtimeit -s\"s='now is the winter of our discontent'; import re; x = re.compile('  +').sub\" \"x(' ', s)\"\n100000 loops, best of 3: 2.41 usec per loop\n</code>\n</pre>\n", "senID": 9}, {"text": ["With one run having length 2, the speed ratio is 2.5.", "With all runs having length 2, the speed ratio is 1.2.", "All things considered, not a bad return on an investment of 1 keystroke."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}], [{"text": ["This is a very interesting issue.", "Cython at it's core is a tool to integrate python with C data types.", "It doesn't supply any functionality to assist in dealing with strings, probably because there isn't as much demand for that as there is for specific Numpy functionality."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Having said that, you could well use Cython to interface with existing C/C++ libraries designed to handle the types of problems you describe.", "For processing HTML/XML you might want to look into libxml for example.", "However there are (of course) ready-made python bindings already available for just that.", "I've used lxml extensively for processing HTML and it does all I need and does it fast, plus it handles unicode pretty well."], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "libxml", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://xmlsoft.org/"}, {"text": "ready-made python bindings", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://codespeak.net/lxml/"}, {"text": "fast", "childNum": 0, "tag": "em", "pos": 3, "childList": []}]}, {"text": ["In your case I would imagine a combination of lxml and custom made C functions would be best.", "For example you could \"easily\" make a fast function for finding longest substrings in C, as that could be done at the byte level (recall that a string in C is just a char*, which is an array of bytes).", "Then you could map those back to python (which Cython will make real easy for you) and carry on in unicode abstracted heaven :).", "Certainly not trivial, but may be worth the effort if your app's performance relies on it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Then there are of course nice (albeit non-trivial) approaches to working with unicode in C/C++.", "This article by Evan Jones may help you decide if it's worth the effort."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "This article", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://evanjones.ca/unicode-in-c.html"}]}], [{"text": ["Just for completeness, what I ended up doing is just write (some of) the string manipulation code in C."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As it turns out, it's ridiculously easy to get started writing c extensions to python.", "Unicode strings are just arrays of Py_UNICODE, which is an int or a short depending on the python build."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "ridiculously easy", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikibooks.org/wiki/Python%5FProgramming/Extending%5Fwith%5FC"}]}, {"text": ["I got a x20 improvement converting code like"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n s = re.sub(r' +', ' ', s)\n</code>\n</pre>\n", "senID": 3}, {"text": ["to c. I got similar improvements with more complicated regexps, but the c code becomes crazy complex very quickly."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Overall, my throughput went up 20% after the rewrite.", "I am now looking for more things to rewrite..."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Note that Cython actually has support for CPython's Py_UNICODE type, so, for example, you can directly iterate over unicode strings or compare characters at C speed.", "See"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://docs.cython.org/src/tutorial/strings.html"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://docs.cython.org/src/tutorial/strings.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.cython.org/src/tutorial/strings.html"}]}]]