[[{"text": ["Removing spaces, commas and dashes will be ambiguous .", "It will be better to replace them with a single space."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Take for example this address"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n 56 5th avenue\n</code>\n</pre>\n", "senID": 2}, {"text": ["And this"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n 5, 65th avenue\n</code>\n</pre>\n", "senID": 4}, {"text": ["with your method both of them will be:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n 565THAV\n</code>\n</pre>\n", "senID": 6}, {"text": ["What you can do is write a good address shortening algorithm and then use string comparison to detect duplicates.", "This should be enough to detect duplicates in the general case.", "A general similarity algorithm won't work.", "Because one number difference can mean a huge change in Addresses."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["The algorithm can go like this:"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["This should be helpful in building your dictionary of abbreviations:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.usps.com/ncsc/lookups/usps%5Fabbreviations.html"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.usps.com/ncsc/lookups/usps%5Fabbreviations.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.usps.com/ncsc/lookups/usps%5Fabbreviations.html"}]}], [{"text": ["First, simplify the address string by collapsing all whitespace to a single space between each word, and forcing everything to lower case (or upper case if you prefer):"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n adr = \" \".join(adr.tolower().split())\n</code>\n</pre>\n", "senID": 1}, {"text": ["Then, I would strip out things like \"st\" in \"41st Street\" or \"nd\" in \"42nd Street\":"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n adr = re.sub(\"1st(\\b|$)\", r'1', adr)\nadr = re.sub(\"([2-9])\\s?nd(\\b|$)\", r'\\1', adr)\n</code>\n</pre>\n", "senID": 3}, {"text": ["Note that the second sub() will work with a space between the \"2\" and the \"nd\", but I didn't set the first one to do that; because I'm not sure how you can tell the difference between \"41 St  Ave\"  and \"41 St\" (that second one is \"41 Street\" abbreviated)."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Be sure to read all the help for the re module; it's powerful but cryptic."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Then, I would split what you have left into a list of words, and apply the Soundex algorithm to list items that don't look like numbers:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["http://en.wikipedia.org/wiki/Soundex"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "http://en.wikipedia.org/wiki/Soundex", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Soundex"}]}, {"text": ["http://wwwhomes.uni-bielefeld.de/gibbon/Forms/Python/SEARCH/soundex.html"], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "http://wwwhomes.uni-bielefeld.de/gibbon/Forms/Python/SEARCH/soundex.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wwwhomes.uni-bielefeld.de/gibbon/Forms/Python/SEARCH/soundex.html"}]}, {"code": "<pre>\n<code>\n adrlist = [word if word.isdigit() else soundex(word) for word in adr.split()]\n</code>\n</pre>\n", "senID": 9}, {"text": ["Then you can work with the list or join it back to a string as you think best."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["The whole idea of the Soundex thing is to handle misspelled addresses.", "That may not be what you want, in which case just ignore this Soundex idea."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["Good luck."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}], [{"text": ["In order to do this right, you need to standardize your addresses according to USPS standards (your address examples appear to be US based).", "There are many direct marketing service providers that offer CASS (Coding Accuracy Support System) certification of postal addresses.", "The CASS process will standardize all of your addresses and append zip + 4 to them.", "Any undeliverable addresses will be flagged which will further reduce your postal mailing costs, if that is your intent.", "Once all of your addresses are standardized, eliminating duplicates will be trivial. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "CASS", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/CASS"}]}], [{"text": ["I had to do this once.", "I converted everything to lowercase, computed each address's Levenshtein distance to every other address, and ordered the results.", "It worked very well, but it was quite time-consuming."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You'll want to use an implementation of Levenshtein in C rather than in Python if you have a large data set.", "Mine was a few tens of thousands and took the better part of a day to run, I think."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I regularly inspect addresses for duplication where I work, and I have to say, I find Soundex highly unsuitable.", "It's both too slow and too eager to match things.", "I have similar issues with Levenshtein distance."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["What has worked best for me is to sanitize and tokenize the addresses (get rid of punctuation, split things up into words) and then just see how many tokens match up.", "Because addresses typically have several tokens, you can develop a level of confidence in terms of a combination of (1) how many tokens were matched, (2) how many numeric tokens were matched, and (3) how many tokens are available.", "For example, if all tokens in the shorter address are in the longer address, the confidence of a match is pretty high.", "Likewise, if you match 5 tokens including at least one that's numeric, even if the addresses each have 8, that's still a high-confidence match."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "numeric", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["It's definitely useful to do some tweaking, like substituting some common abbreviations.", "The USPS lists help, though I wouldn't go gung-ho trying to implement all of them, and some of the most valuable substitutions aren't on those lists.", "For example, 'JFK' should be a match for 'JOHN F KENNEDY', and there are a number of common ways to shorten 'MARTIN LUTHER KING JR'."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Maybe it goes without saying but I'll say it anyway, for completeness:  Don't forget to just do a straight string comparison on the whole address before messing with more complicated things!", "This should be a very cheap test, and thus is probably a no-brainer first pass."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Obviously, the more time you're willing and able to spend (both on programming/testing and on run time), the better you'll be able to do.", "Fuzzy string matching techniques (faster and less generalized kinds than Levenshtein) can be useful, as a separate pass from the token approach (I wouldn't try to fuzzy match individual tokens against each other).", "I find that fuzzy string matching doesn't give me enough bang for my buck on addresses (though I will use it on names)."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]