[[{"text": ["PHP probably has a lower barrier to entry in that it's embedded in what are essentially HTML documents.", "Python is a more full-blown general-purpose programming language.", "If you just want to throw some Web pages together, it's hard to beat the simplicity of PHP."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PHP is by far more common although with Django, Python is becoming increasingly common for Web development."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Django", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}]}], [{"text": ["I think you ask the wrong questions..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The concept of \"best\" applied to language is nebulous and misleading..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I don't see how it is important.", "I mean, neither are going to die next year, so it is quite irrelevant.", "You will find plenty of information, help, books for both languages."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For Web development, I think PHP is leading, partly because lot of hosts offer PHP out of the box, and more rarely Python, Perl or Java.", "And partly because of tradition.", "If the question is for job offers, you will probably find more offers if you know PHP."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["That doesn't mean that Python is unsuited to Web development, of course.", "Somehow, you should have a superficial look at both languages, at some frameworks they offer, and choose along your taste.", "And nothing prevent you to learn both, at least after mastering at least one of them..."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}], [{"text": ["If you go by the TIOBE index:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.tiobe.com/index.php/content/paperinfo/tpci/index.html"}]}, {"text": ["PHP has a pretty good lead on Python.", "However, I wouldn't use this as a measure.", "You should learn both, I would say.", "As far as what's becoming trendy, Python is definitely on the rise, there's no doubt about that."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You can learn Python quickly reading Dive Into Python online."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Dive Into Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://diveintopython.org"}]}], [{"text": ["Disclaimer: I use PHP to earn my bread and butter, so I may be more readily critical of that language than Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PHP is more popular, but popular is not a measure of good taste; a glance at the Top 40 album charts should confirm this :)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think the most significant difference between these languages is that Python design was clearly led by one person, whereas PHP has grown more organically.", "This means that there are more apparent inconsistencies in PHP than in Python, and these can lead to \"uglier\" code."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Like any language, both have developed design flaws or inconsistencies over time.", "In my observation Python moves more agressively to address these than PHP does."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["One of Python's orginal design goals - at least a major focus of it's aims today - is as an educational tool.", "So by focussing on Python initially, you may make yourself a better programmer for future tasks in other languages.", "I would be reluctant to say the same of what PHP might teach you."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["My advice is to try both to achieve a few simple tasks, and see which makes sense to you more intuitively.", "Also, dig into a few of your favourite existing pieces of software (assuming you aren't an \"everything from scratch\" type) and see which make more sense."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["That should make the decision clear enough."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Best of luck - hope you enjoy your learning experiences!"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["In addition to which language, you might want to ask yourself which framework are you interested in using?", "I think learning a framework can take more effort than learning the syntax and idioms of a language.", "Do you plan on learning either PHP or Python for web development?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Python might be a good language to learn, since easier to read (makes it mandatory to indent the code)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Another thing to consider: are you only ever going to be programming web sites?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PHP isn't commonly used in other domains; Python is."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I suppose it depends on whether or not your code is going to be run on a lot of web servers.", "PHP, due to high demand, is usually available on most shared hosting servers, and thus is the choice of projects such as Wordpress and Drupal.", "I've also found that most of those shared hosting web servers have a pretty ancient version of Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["While I haven't done a lot of web stuff in it, I feel that Python is the better language in general, and may even replace PHP (assuming software inertia doesn't keep PHP going)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["In terms of which language is leading overall, the answer is clearly PHP.", "This is true not only in the number of sites which currently use PHP, but also in the number of PHP resources out there compared to Python. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This is by no means a knock against Python, which as stated before can be a very useful language to use for educational/learning purposes. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Python has a nice syntax and it is far more better than PHP!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you are just beginning I would advise..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["learning Python first, PHP second and/or in tandem. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python will be the absolute best language for learning program for a beginner IMO, especially for one that sees themselves in the web world, or linux scripting world, etc. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["From Python you will be able to go to Ruby or PHP fairly easily. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If you start off with PHP, it will teach you bad coding habits. "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Once you learn how to program efficiently, the language will not matter as much. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Python is used a lot in academia as well."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Now if you want to build full scale enterprise apps, I would skip all of them and just go to c# or Java."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["If you are working in the web dev community you are going to NEED to know PHP...not necessarily python, but just learning PHP will hold you back in the long run."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}]]