[[{"text": ["Visual Studio - the best IDE out there."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["A lot of us really like working with strongly/statically-typed languages.", "That's a big one there.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "like working with strongly/statically-typed languages", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/859186/why-is-c-statically-typed/859226#859226"}]}], [{"text": ["There are lots of differences, advantages as well as disadvantages.", "I guess the main advantages would be along the lines of"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "Excellent Windows integration, including access to all standard GUI functions and other libraries.", "tag": "none", "senID": 1}, {"text": "JIT compilation, resulting in better performance than Python, in some or most circumstances. ", "tag": "none", "senID": 2}, {"text": "On Windows, the IDE support is arguably better for C#. Visual Studio is a well established and advanced development environment and the \"Express\" editions are free ", "tag": "none", "senID": 3}]}, {"text": ["The rest is basically up to personal preference (statically typed versus dynamically, C-like syntax or not, etc.", ")."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"tag": "ul", "num": 7, "lis": [{"text": "C# is supported by ", "tag": "none", "senID": 0}, {"text": "C# is ", "tag": "none", "senID": 1}, {"text": "Nothing is better when you are developing windows applications.", "tag": "none", "senID": 2}, {"text": "Its syntax is also very well designed. Code looks pretty good.", "tag": "none", "senID": 3}, {"text": "Its worth learning because lots of code is written and is being written in it.", "tag": "none", "senID": 4}, {"text": "It feels so good when you code in C# in Visual Studio. I am still searching for such a nice IDE for Python.", "tag": "none", "senID": 5}, {"text": "With C# you can explore lots of interesting things .NET,WPF,WCF,XNA,ASP.NET,", "tag": "none", "senID": 6}]}], [{"text": ["The JITer, and the fact that it can produce tighter code due to it supporting static typing.", "The JITer can be worked around by using one of the non-CPython implementations, or dropping to i386 and using psyco, but the static typing can't be worked around as trivially (nor do I believe that it should be)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I've found it helpful to work with different languages, since they each have their strengths.", "Python is extremely powerful, but relies heavily on good coding conventions and practices to keep code maintainable.", "In particular, it does not enforce type safety or insulation, which means it is easy to abuse.", "C# is a modern object oriented language, with strong typing and other features to help enforce insulation and encapsulation.", "It's not as wildly flexible, but I've also found that larger C# programs are much easier to maintain (especially when you inherit them from other developers."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Well, the ease of coding is debatable.", "I find C# easier to code when you factor in the help you get from teh IDEs (e.g.", "the free Visual Web Developer).  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So, portability is less of an issue if you factor in Mono.", "Performance can be better in some scenarios.", "I find the online documentation to be generally better in .NET."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Have you considered IronPython?", "If you guys are willing to use one of the .Net distros that have the DLR in them (4.0's your best bet there, but some of the DLR betas are alright), then you can write C# code and Python code and have them work together w/o any difficulties outside naming conventions being a bit different."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["C# can directly access pointers via \"unmanaged code\", which can give it a performance advantage in some situations."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you prefer Python, but need to write code for .Net, apart from IronPython there's also Boo, which is a heavily-Python-inspired .Net language (including static types).", "You might want to give it a try."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Boo", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://boo.codehaus.org/"}]}]]