[[{"text": ["It depends on what your goals are.", "In terms of your resume, Java certainly has a much larger market than Python.", "In terms of your personal \"knowledge portfolio\", Python offers a greater potential for growth than Java does. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As many people have pointed out already, Java is very similar to C++ syntactically and has a better library.", "Python makes it very easy to just Get Things Done.", "Yes there is a performance penalty for interpreted languages, but often this is of little to no consequence for a project.", "CPU time is much cheaper than developer time.", "Without digressing into a comparative languages discussion, I wouldn't worry about the performance too much.", "Use your head and pick the right tool for the job."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I believe you can write your applications \"faster\" in Python than you can in Java - the language is certainly more terse.", "Python is a better choice for rapid prototype in my opinion.", "Also, you can use Eclipse w/ Python as a first class language (with things like PyDev) and do unit testing (with things like PyUnit)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["As a slight aside, if you are considering Java, I would highly suggest you seriously consider C# instead.", "C# has broad market applicability (similar to Java), \"evolutionary\" rather than revolutionary syntax from C++ (like Java), is a newer and in many ways, better language than Java (from a purely language perspective).", "Quite frankly, I find C# a much more enjoyable language than Java, as do many others.", "In terms of the goals you have laid out however, the Python vs C# decision has all the same points as the Python vs Java decision."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Python: Java won't teach you much, and will subtly annoy you, at least at first.", "(\"Why can't I just chuck this new class at the bottom of this file?", "Why does this function have to be in a class?", "\") Python will be weird as well, but you should at least be learning new ways to think.", "If Python is too weird, or you can't use it on a project for some reason, there is a reason C# is popular: it is pretty much Java for C++'ers."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "too", "childNum": 0, "tag": "strong", "pos": 4, "childList": []}, {"text": "reason", "childNum": 0, "tag": "em", "childList": []}]}], [{"text": ["I really don't understand how people can claim that C++ and Java are more or less the same.", "Yes, the syntax is (superficially) similar, but everything else from execution model to memory allocation is (very) different."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I'd go with Python for just about everything, unless performance is a real issue.", "And if performance is a real issue, you may need to resort to C/C++ anyway."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Python\nJava is just C++ with a decent library, you don't learn a lot by putting an extra word in front of the class definition."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}], [{"text": ["Why only pick one?", "I recommend you learn both.", "Only when familiar with both languages can you know when either is best suited for a given task.", "Chances are you will find that you want to use Java for some projects and Python for others.", "Also, the combination of Java and Python in the same application is becoming increasingly popular, i.e.", "with Jython."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I don't think you need to&mdash;or even should&mdash;try to learn both at the same time, so I would recommend starting with Python, it's more \"different\" from C++ than Java, so it might provide you with more new \"insights\"."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["For rapid development you should go with python.", "Reason for that is all of the built in methods, great documentation and simplicity."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This document here is a great overview and resource on python and its built in functionality."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "This document here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.xminc.com/mt/archives/pythontut2.html"}]}, {"text": ["Many items there are done in 2-3 lines where it would take a magnitude of code in either java or c++ to do."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you want to learn a different way of doing things, I would go Python.", "It has a lot of features that make your coding just easier."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, if you want marketable skills, Java is still the way to go.", "Just about every corporation person I talk to will baulk if you mention Python but has no issues with Java, simply because it's so ubiquitous."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["First Java (as you see a semplification in a lot of aspects of C++), and then you will eat Python for breakfast."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Personally, if you want to write OO code quickly then you want to go with Python.", "Since Java is so similar to C++ there really isn't a benefit to learning it.", "At least, not the speed increase you will see by using Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python supports extension/embedding using C/C++.", "You can write code in C/C++ and then import that code into your Python program.", "Java is strictly Java, AFAIK."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Plus, there is Jython, which is essentially Python written in Java .", "You can use the Java libraries and everything while still coding in Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Java may give you points on your resume but, subjectively, dynamic languages like Python and Ruby are starting to make a dent (at least from comments and articles around the 'net)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["IMO, unless you have a definite need to learn Java, try Python."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["It all depends on what you're after.", "If it's GUI applications, then Java or C# would be the way to go.", "I find Python is great for quick little apps to help me automate mindless tasks, but it's also powerful enough to get some cool stuff going."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Some points to consider:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "Java is more similar to C++ than Python", "tag": "none", "senID": 2}, {"text": "Python is easier to learn (pseudocode, anyone?)", "tag": "none", "senID": 3}, {"text": "Python is an interpreted scripting language, so it's comparatively slow-running", "tag": "none", "senID": 4}]}], [{"text": ["If you are programming for fun, python has more features and is a good language.", "It will probably expose you to a few more programming concepts than Java will."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to do it for work, most of the work I've seen is in Java.", "I'm not saying there aren't any python programming jobs around, but (at least according to my recruiter), the market is almost all split down the middle between Java and .net right now."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you want to go to the extreme, you might also glance at Scala.", "If you're just picking up a language to mess with, that's going to probably expose you to more features than either of the others you mentioned."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You want a rapid development cycle so definitely choose Python over Java.", "I have never heard anyone describe Java as a rapid development language.", "I do, however, know plenty of ex Java developers who, once they've learned Python, never go back to Java.", "They cite the verbosity of Java (and consequent longer development time) as a primary reason."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also there are plenty of test suites for Python and a Python Eclipse plugin if you prefer an IDE."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["java has the best open and closed source library support and a syntax that should be fairly easy for someone coming from C++(I should know --  I came from C to C++ and then to Java)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Having worked on Java for the last 8 years and in-between trying out ruby and python, I feel that, it was useful for me to know Java to appreciate Ruby and Python.", "Java can be pretty verbose and Ruby/Python just the opposite."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you've coded in C++ using Visual Studio or Sun Studio, you will come to appreciate nice IDEs available for Java, like Eclipse, Netbeans or IDEA.", "If you go to python/ruby directly from C++, you can still use Eclipse/Netbeans, etc BUT you will NOT quite get the same level of support for debugging, profiling, etc."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Then again, it depends on what kind of apps you want to do.", "Python has its strength.", "Google AppsEngine allows only python apps(for now).", "You might want to consider that Google uses 4 languages inside -- C++, Java, python and Javascript."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I would say Python as well, but with the following caveats:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["None of this is probably an issue.", "It does need getting used to moving to a run-time model vs the compile-time model."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Other than that Python is just fine (together with Boost::Python) and you can accomplish a lot with it. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["This really depends on what are you going to apply this newly learned language for.", "If you want to create smaller applications, in small(er) teams, getting faster thing done then I'd recommend Python (It doesn't mean Python is not used in big projects/organisations, it simply means Python is less popular in 'enterprise' development)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But if you are after improving your CV regarding work for big organisations, on big projects etc then I think Java is better choice.", "Personally I don't love Java (it can be very verbose) but I am happy to use it at work because of stability, libraries and tool set."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Two more comments after reading other answers:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["1) Java and C++ do not share much apart from some syntax.", "Execution model, memory model, libraries, tools, best practices are usually very different.", "Learning Java is not so much learning syntax, it's learning its libraries, API, frameworks etc. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["2) You can use Eclipse for Python development.", "Try Pydev, it also supports unit testing."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["First you should learn Python:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I dont have personal experience with java programming, but as others have pointed out, its more like C++ with extended libraries."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python makes it real easy to code, so its ideal for rapid development.", "The annoying thing is it being a interpreter based language rather a compiler based language, so debugging is a time consuming process and it becomes more CPU intensive than Java(or any compiled language)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Assuming that rapid development is your preference, over saving CPU time, I would suggest Python over Java.", "Its uber-cool and you will simply fall in love with its simplicity. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I would say Python.", "After C++ Java should be very easy to pick up as it is quite similar.", "Both are pretty widely used these days, and support for Python is growing, so that's my recommendation."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would try JAVA"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["good luck!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I upvoted mgb because I agree with him."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, I think there would be value in learning both... though Python first."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The advantage of learning both is because right now Java is so pervasive... there are a lot of libraries you can leverage, both third party and built into the Java standard libraries.", "Then, with the library knowledge of Java, you can leverage it with Jython and have the power and rapid development of Python with the library support of Java."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I can't help but mention Ruby, as it is my favorite language... it is a very fun language once you learn it, and you get the same kind of power and rapid development capabilities as with Python, and there is JRuby also to leverage Java libraries.", "Just brought it up in case you hadn't considered it yet, I'm sure you would be just as happy with Python, as both are going to serve you much better than Java/C++ in terms of giving you a broader vision and alternative paradigms to aid in problem solving."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I think it completely depends on what you want to make.", "I choose Python over Java when I want to make websites.", "I find it easier to host and I love Django and did not like JSP/Struts/J2EE.", "I'm not sure that there's much that would make me choose Java over anything, but if you want to play with Processing, then you have a good excuse -- you could try Jython or Processing.js."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Processing.js", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://ejohn.org/blog/processingjs/"}]}, {"text": ["When I choose a language (or any other tool) it's because it's the best at making what I am trying to make -- it makes the right deployable -- not because of the language itself."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Well... this is a Holy War question, but I'll foolishly dive right in :-) ..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Personally I greatly prefer Python.", "I believe Java has nearly all the hassles of C++, and none of the rapid-prototyping advantages of dynamic languages."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But I'm sure all the Java people can give you arguments in the other direction."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["You'll never get a useful answer taking a straw poll like this, sorry.", "You're going to have to try both, at least a little bit, and see what works for you.", "There's just no way around it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I am asking myself the same question nowadays.", "I am in GIS development.", "Like in many many other domains, GIS is also being expanded towards the mobile world.", "Although I'd choose Python without hesitation for all the reasons people wrote about, I think I will eventually have to choose JAVA :o( as it is the de-facto standard for mobile applications... Python is still very much absent in the mobile world."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Please correct me if I am wrong."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]