[[{"text": ["Along the lines of ghostdog74's answer, I would first ask what your objective is.", "You don't necessarily need to close source a program to make money off of it, or even to make money off of licensing it.", "A lot of companies have dual licensing models for their open source products, which means the source code is all out there (or at least 98% of it is), but they're still charging licensing fees for certain use cases (e.g.", "commercial uses, or commercial use in organizations with more than X number of users)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also, most scripting-language-based products are web/intranet applications.", "And with a lot of web apps there just isn't any point in trying to hide the code, even if it is closed source.", "In most cases there's really nothing novel about the implementation of a particular product, and what you're selling to customers is just:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "is", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["None of these selling points receive any sort of benefit or protection from concealing the source code.", "Number 2 is the same regardless of whether the source is open or closed.", "Selling points 1 and 3 can both be undermined by IP infringement, but source code availability is irrelevant in both cases.", "Someone can pirate your software just as easily if the source code were hidden or obfuscated, and your competitors don't need your source code to copy your feature set."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["There are cases where one may want to protect a proprietary algorithm or formula (e.g.", "if you've not secured a patent on it yet or are seeking to achieve security through obscurity), but I'd wager to say that for most projects, obfuscating your source code is a moot point."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "are", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "most", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["We have legislation in place to protect intellectual property.", "So, unless you're selling a product on the black market, concealment of source code would only serve to protect the parts of your source code that cannot be considered your intellectual property."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit:\nObviously a lot of people don't feel this actually answers the question, and I can understand that sentiment.", "I do generally try to give direct answers to questions, except when there might be a better/simpler way to achieve the poster's goals than the approach taken by the question."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["So, yes, you could conceal your code by compiling it into an intermediate language or using a code obfuscator, but there isn't any point IMO.", "If someone wants to see your original source code, they can just decompile it, and even commercial code obfuscators like RubyEncoder have proven easy to defeat."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["I don't know enough about metaprogramming in Ruby to say with any confidence whether it will work for this application or not, but my gut tells me that the concept is likely as fundamentally flawed as DRM."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Fully seconding the various \"business model\" observations made in other answers; if nevertheless you decide you really want to make it hard for users to read your sources, and that objective is worth the inconvenience, the first line of defense is to use a \"packager into executable\" that doesn't make it totally trivial to recover the bytecode -- for example, for Python for Unix systems, freeze."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "totally", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"href": "http://wiki.python.org/moin/Freeze", "text": "freeze", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Of course, even the best such tool won't make your executable any harder to disassemble and understand than any typical executable -- indeed, perhaps easier, since inevitably the code that the tool generates (typically C code that then gets compiled into machine code) is highly \"stereotypical\" compared to hand-written machine code... and even the code that's most craftily built to be hard to disassemble, understand and modify (especially popular video games) seems to be inevitably cracked very, very little time after release."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As I wrote back in 2006,"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "2006", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mail.python.org/pipermail/python-list/2006-April/1079623.html"}]}], [{"text": ["There are 3 options of encrypting Perl code:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["For a Perl solution you can:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "Buy PerlApp from ActiveState and use it to package your apps as an executable bundle.", "tag": "none", "senID": 1}, {"text": "Create a small C program that includes a Perl compiler and all your application source code.  Unpack your Perl source in memory and then let the embedded compiler run the application.  (Note:  this is pretty much what PAR::Packer and PerlApp do).", "tag": "none", "senID": 2}]}, {"text": ["A similar approach should be possible with any interpreter that is embeddable in a C application."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I have used both Par::Packer and PerlApp with great success.  "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["If source code hiding is part of your goal, you will need to use one of the obfuscating filters for PAR.", "PAR packages are executable zip files, and are very easy to open up.", "PerlApp works pretty well to obfuscate code.", "I am 100% certain that a dedicated and skilled person could find a way to extract the code if it was worth their time.", "The good news is that there is a 99.99999999% certainty that it won't be."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["With Python at least you can distribute the compiled bytecode along with the appropriate interpreter and libraries."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["One possibility is for you to make your \"logic\" a compiled module and then wrap it with Python for the higher level stuff.", "Some games do this (engine is in C and levels are in Python/lua) although they do it for performance."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Obfuscation, on the surface, is a problem for metaprogramming.", "Consider the Rails framework.", "Ordinarily, a class named MissileLaunchCommand could just as well be named BananaEatingObject; the interpreter doesn't care.", "Rails, however, assumes suffixes like Controller and _mailer, so naïve obfuscation will yield a broken application."], "childNum": 4, "tag": "p", "senID": 0, "childList": [{"text": "MissileLaunchCommand", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "BananaEatingObject", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "Controller", "childNum": 0, "tag": "code", "pos": 3, "childList": []}, {"text": "_mailer", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Lacking bytecode, the most common ways to avoid exposing the source code basically revolve around providing services as opposed to standalone apps: "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "services", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["I am not aware of a shared practice for releasing a fully independent app in an interpreted language.", "Language-specific options (like RubyEncoder, mentioned by Lèse majesté) are out there."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "RubyEncoder", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.rubyencoder.com/"}]}], [{"text": ["Ruby might not be the way to go.", "You need to clarify what your project is going to do and what you want to accomplish."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Even compiled code can be reverse engineered, keep that in mind.", "Minifying/Obfuscating is primarily used to deter kiddie programmers - if someone wants to see/learn what you did, they'll take the time and walk through it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["There is no way to distribute the code w/o giving the logic.", "As an alternative, you can host the code from your servers and run the application locally, which doesn't sound like something you want.", "Otherwise, you're going to want to use a compiled language, such as C, which you will need to have different versions of based on the clients' environment."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["First, why do you want to make it closed source?", "Do you want to collect revenue when you sell your software?", "If not, then why are you afraid of giving out the logic?", "If you really insist, then use a compiled language. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you were doing this in Tcl, I'd recommend using the Tcl Dev Kit from ActiveState.", "It includes a \"compiler\" (really a bytecode saving engine; the compiler is the one built into Tcl itself) that lets you distribute code that can't be simply read, and a packaging system that lets you combine the saved bytecodes into a single executable file that most users can't defeat.", "It's not a perfect defense against the nefarious, but it does work well enough for most cases (especially where users aren't motivated too much to take things apart) and there aren't any pre-existing tools for doing that.", "I don't know whether there are other similar tools for other scripting languages."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Tcl Dev Kit", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.activestate.com/tcl-dev-kit"}, {"text": "compiler", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["If you only want to stop people from poking their fingers in, distributing some sort of packed archive form would perhaps do.", "For example, for most people a Java JAR file is just unreadable binary, despite being just a renamed ZIP (with a manifest inside).", "Moreover, that's about the limit of what I'd recommend for anyone doing this with open source software; you should not want to lock things down more tightly than that in that case!"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "want", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}]]