[[{"text": ["Well, I would expect this to be heavily I/O bound task.", "As such, optimizations on python side would be quite ineffective; the only optimization I could think of is some different way of accessing/listing files, in order to reduce the actual read from the file system.", "This of course requires a deep knowledge of the file system, that I do not have, and I do not expect python's developer to have while implementing os.walk."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "os.walk", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["What about spawning a command prompt, and then issue 'dir' and parse the results?", "It could be a bit an overkill, but with any luck, 'dir' is making some effort for such optimizations."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It seems as if os.walk has been considerably improved in python 2.5, so you might check if you're running that version. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "considerably improved", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mail.python.org/pipermail/python-list/2006-October/408667.html"}]}, {"text": ["Other than that, someone has already compared the speed of os.walk to ls and noticed a clear advance of the latter, but not in a range that would actually justify using it."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "someone has already compared the speed of os.walk to ls", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://randomfoo.net/blog/id/4214"}]}], [{"text": ["You might want to look at the code for some Python version control systems like Mercurial or Bazaar.", "They have devoted a lot of time to coming up with ways to quickly traverse a directory tree and detect changes (or \"finding basic stats about the files\")."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["When you look at the code for os.walk, you'll see that there's not much fat to be trimmed."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "os.walk", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["For example, the following is only a hair faster than os.walk."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n import os\nimport stat\n\nlistdir= os.listdir\npathjoin= os.path.join\nfstat= os.stat\nis_dir= stat.S_ISDIR\nis_reg= stat.S_ISREG\ndef yieldFiles( path ):\n    for f in listdir(path):\n        nm= pathjoin( path, f )\n        s= fstat( nm ).st_mode\n        if is_dir( s ):\n            for sub in yieldFiles( nm ):\n                yield sub\n        elif is_reg( s ):\n            yield f\n        else:\n            pass # ignore these\n</code>\n</pre>\n", "senID": 2}, {"text": ["Consequently, the overheads must he in the os module itself.", "You'll have to resort to making direct Windows API calls."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "os", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Look at the Python for Windows Extensions."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Python for Windows Extensions", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://python.net/crew/mhammond/win32/"}]}], [{"text": ["I'm wondering if you might want to group your I/O operations.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For instance, if you're walking a dense directory tree with thousands of files, you might try experimenting with walking the entire tree and storing all the file locations, and then looping through the (in-memory) locations and getting file statistics.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If your OS stores these two data in different locations (directory structure in one place, file stats in another), then this might be a significant optimization.  "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Anyway, that's something I'd try before digging further."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The os.path module has a directory tree walking function as well.", "I've never run any sort of benchmarks on it, but you could give it a try.", "I'm not sure there's a faster way than os.walk/os.path.walk in Python, however."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["This is only partial help, more like pointers; however:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I believe you need to do the following:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n fp = open(\"C:/$MFT\", \"rb\")\n</code>\n</pre>\n", "senID": 2}, {"text": ["using an account that includes SYSTEM permissions, because even as an admin, you can't open the \"Master File Table\" (kind of an inode table) of an NTFS filesystem.", "After you succeed in that, then you'll just have to locate information on the web that explains the structure of each file record (I believe it's commonly 1024 bytes per on-disk file, which includes the file's primary pathname) and off you go for super-high speeds of disk structure reading."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]