[[{"text": ["For the basics, yes, the standard Python library is probably all you'll need.", "But as you continue programming in Python, eventually you will need some other library for some task -- for instance, I recently needed to generate a tone at a specific, but differing, frequency for an application, and pyAudiere did the job just right."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A lot of the other libraries out there generate their documentation differently from the core Python style -- it's just visually different, the content is the same.", "Some only have docstrings, and you'll be best off reading them in a console, perhaps."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Regardless of how the other documentation is generated, get used to looking through the Python APIs to find the functions/classes/methods you need.", "When the time comes for you to use non-core libraries, you'll know what you want to do, but you'll have to find how to do it."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "what", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "how", "childNum": 0, "tag": "em", "childList": []}]}, {"text": ["For the future, it wouldn't hurt to be familiar with C, either.", "There's a number of Python libraries that are actually just wrappers around C libraries, and the documentation for the Python libraries is just the same as the documentation for the C libraries.", "PyOpenGL comes to mind, but it's been a while since I've personally used it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["As others have said, it depends on what you're into.", "The package index at http://pypi.python.org/pypi/ has categories and summaries that are helpful in seeing what other libraries are available for different purposes.", "(Select \"Browse packages\" on the left to see the categories."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://pypi.python.org/pypi/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://pypi.python.org/pypi/"}]}], [{"text": ["One very common library, that should also fit your current needs, is the Python Image Library (PIL).", "Note: the latest version is still in beta, and available only at Effbot site."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Python Image Library", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://effbot.org/zone/pil-index.htm"}, {"text": "", "childNum": 0, "tag": "br", "pos": 1, "childList": []}, {"href": "http://effbot.org/zone/pil-index.htm", "text": "Effbot site", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["If you're just beginning, all you'll need to know is the stuff you can get from the Python website.", "Failing that a quick Google is the fastest way to get (most) Python answers these days."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As you develop your skills and become more advanced, you'll start looking for more exciting things to do, at which point you'll naturally start coming across other libraries (for example, pygame) that you can use for your more advanced projects."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It's very hard to answer this without knowing what you're planning on using Python for.", "I recommend Dive Into Python as a useful resource for learning Python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Dive Into Python", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.diveintopython.org/"}]}, {"text": ["In terms of popular third party frameworks, for web applications there's the Django framework and associated documentation, network stuff there's Twisted ... the list goes on.", "It really depends on what you're hoping to do!"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Django framework", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}, {"text": "Twisted", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.twistedmatrix.com/"}]}], [{"text": ["Assuming that the standard library doesn't provide what we need and we don't have the time, or the knowledge, to implement the code we reuse 3rd party libraries.", "This is a common attitude regardless of the programming language."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}, {"text": "", "childNum": 0, "tag": "br", "pos": 1, "childList": []}, {"text": "attitude", "childNum": 0, "tag": "em", "childList": []}]}], [{"text": ["If there's a chance that someone else ever wanted to do what you want to do, there's a chance that someone created a library for it.", "A few minutes Googling something like \"python image library\" will find you what you need, or let you know that someone hasn't created a library for your purposes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]