[[{"text": ["The Python source technique absolutely rules."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["XML is slow to parse, and relatively hard to read by people.", "That's why companies like Altova are in business -- XML isn't pleasant to edit."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python source db = {\"a\": [1, 2], \"b\": ...} is "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "db = {\"a\": [1, 2], \"b\": ...}", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["If you have programs that read and write giant dictionaries, use pprint for the writing so that you get a nicely formatted output.", "Something easier to read."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "pprint", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["If you're worried about portability, consider YAML (or JSON) for serializing the object.", "They parse quickly also, and are much, much easier to read than XML."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I would consider using one of the many graph libraries available for python (e.g.", "python-graph)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "python-graph", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://code.google.com/p/python-graph/"}]}], [{"text": ["You need to specify your problem a bit better.", "I'll make a few assumptions:\n1) your data is static and you just want to search it,\n2) you have enough memory to store it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If application startup speed is not critical, the data format is up to you, just as long as you can get it into Python memory.", "Use simple data types (dicts, lists, strings) to store data, not an XML graph, if you want to access it quickly.", "You might consider writing a lightweight class of your own to express nodes and store links to other nodes in a dict or array."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If application startup time is critical, consider loading your data in a Python program and pickling it out to a file; you can then load the pickled data structure (which should be really fast) in the production application."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If, on the other hand, your data is too big to fit in memory, or you want to be able to modify it persistently, you could use SQL for storage (either an external server or an SQLite database) or ZODB (a Python object database). "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["If you store your data on an XML file it will be easier to modify (i.e.", "using notepad ...) but you must take in account that reading and parsing all that amount of data from a XML file is a heavy duty.", "Using a SQL database (maybe PostGres) will make the choiche some more performant, DMBS are  more optimized than direct filesystem reading/parsing.", "If you store all your data in some Python structure on a separate file, you can than have the advantage of bytecode compilation (.pyc) that doesn't give a boost in computational therms but allows for a faster load (wich is what you want).", "I would choose the last one."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["XML is really oriented to tree structures and is very verbose.", "You can look at RDF for ways to describe a graph in XML but it still has other disadvantages, e.g.", "the time to read, parse, and instantiate 500k+ objects and the amount of file space used."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["SQL is really oriented to describing rows in tables.", "You can store graphs of course, but you'll see a performance penalty here too."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I would try python pickling first to see if it meets your needs.", "It will probably be the most compact and the fastest to read in and instantiate all the objects."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Really the only reason to use other formats is if you need something they offer, e.g.", "transactions in SQL  or cross-language processing of XML."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The python file approach will surely be the fastest if you have a way to maintain the file."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]