[[{"text": ["The USE of py2exe doesn't require that you release the source code you're compiling."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you CHANGE py2exe itself, then you MAY need to release your code under the GPL."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But if you're only using it to compile your own non-gpl code, you don't have to release your own code."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The py2exe project itself is MIT licensed.", "It may be more complicated than that if it also uses GPL components, but as far as releasing your own code with the py2exe compiled files you should not have an issue."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Your code is compiled to python byte code.", "It is NOT linked in any way shape or form with the DLLs and other files incident to a py2exe compiling."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The python...dll is the actual interpretor and IS linked to the other files."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["YOUR code does NOT have to be under GPL - it's just interpreted, it's never linked to any other code."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["When you distribute these files you MUST include the license info and point out the source code for all the incidental files that have GPL licenses, but you do NOT need to release your own code.", "Given that the project is under MIT license you may not need to do much depending on which files your project requires."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["As always, check with a lawyer - "], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Your byte code is inserted as a resource into the EXE file that starts the interpreter and feeds it your bytecode.", "Given that this portion is definitely MIT license you should be fine."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["However, the waters are murky if py2exe is using any GPL code.", "Still, unlikely to cause problems."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["Be aware that py2exe is a method that allows you to release python code to a windows environment without installing a python interpretor."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["It is not a protection against copying, or viewing the source code - your compiled bytecode can be pulled from the EXE and presumably decompiled - your code is never converted to machine code - it's still an interpreted language."], "childNum": 1, "tag": "p", "senID": 12, "childList": [{"text": "not", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["It seems that it is not GPL after all."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The comment from Zach Scrivena:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I guess the py2exe page  mentioned in my original question should be a little more clear as it is pretty confusing. "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "py2exe page", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.py2exe.org/"}]}, {"text": ["The bottom of the py2exe home page is refering to MoinMoin which is a Wiki Engine.", "It does not refer to the py2exe project itself. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Unless you plan to modify parts of py2exe itself and distribute those, there is no problem with using it in a commercial product."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Unless I misunderstand the situation, there is nothing about the GPL which prevents it from being used in a commercial context.", "Is the concern here that you are effectively linking against GPLed code? "], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "used", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "linking", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Have you asked the authors about a bison style modification to the license?", "(Bison is distributed with a license modification that excepts the generated code from the terms of the GPL.", "Still looking for a link on this...)"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "bison", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "generated", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["There are some GPL programs that place restrictions on the output of a program, for instance GNU Bison (at last check) did just that.", "GCC will also be placing restrictions on intermediate output (compiled code prior to optimizations being run) to prevent people from writing proprietary plug-ins to gcc itself."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["py2exe is not one of those programs.", "You are under no obligation to follow the GPL when you are distributing its output.", "Likewise, you can feel free to modify py2exe, use it to compile and you still aren't facing GPL restrictions when distributing the final product (your compiled code)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Now, if you have modified py2exe and want to distribute your modified version of py2exe, you would be required to distribute your changes to py2exe as well."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "of py2exe", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Now, to be perfectly clear, be careful what you compile.", "If you are using python code that is covered by the gpl2, gpl3 or AGPL3, you MUST distribute the source code with your compiled code.", "However, for just this reason, most things you'll be importing will be LGPL2/3 anyway."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "what", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["The GPL2/3 do not come into play until you distribute software.", "AGPL3 goes the extra mile by saying if you make software available for use over a network (i.e.", "as Google makes G-Mail available to us), you are distributing the software."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["There's also this link : http://www.py2exe.org/LICENSE.txt"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.py2exe.org/LICENSE.txt", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.py2exe.org/LICENSE.txt"}]}]]