[[{"text": ["Your direct question is \"Which complements Python best?", "\", but the implicit question seems to be \"what do I need to do to deal with a twisted academia?\".", "The answer to the latter question is Java."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["On the other hand, if you truly want a complement to Python, I'd pick the one with the least overlap with Python, while being the most useful in direct conjunction with Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Of the three languages you mentioned, the one that fits those criteria best is, in my opinion, C."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "There are very few projects where the question arises \"Python or C?\", because they generally serve very different needs.", "tag": "none", "senID": 3}, {"text": "The reference implementation for Python, CPython, is written in C.", "tag": "none", "senID": 4}, {"text": "Python extensions are often written in C either for performance or for ease of integration with other non-Python libraries.", "tag": "none", "senID": 5}]}, {"text": ["One final thing that pushes for C: it shows you how computers actually work, instead of a very high-level abstraction.", "Once you're proficient in C, lots of things in higher level languages make more sense, and you can think more clearly about performance and memory implications of your programs."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "actually", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["I think C would be a good language to learn.", "Yes, it isn't OOP but in the same way you shouldn't learn only procedural languages, you also shouldn't learn only OOP languages.", "C is also the lowest level of the three and will give you a very good insight to how the processor actually handles your code.", "Also, there is something to be said of working without a garbage collector and without a nice and spiffy String class"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["first of all - heartily agree with aaa - Python isnotjust a scripting language"], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "first of all - heartily agree with aaa - Python isnotjust a scripting language", "childNum": 1, "tag": "em", "pos": 0, "childList": [{"text": "not", "tag": "strong"}]}, {"text": "not", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["I would recommend learning C - it's a much lower level than Python and gives you none of the higher level structures that make programming 'easy'."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Building ADTs and writing functional C code really gives you an appreciation of how much work higher level languages such as Python can save us."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Then, once you're comfortable with how the underlying concepts are built, you never need to write them again.", ":)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Having spent a year in C++, a semester in Java (Spring 2010 - this last one), and learning Python mostly on my own throughout, and brief collisions, I'll give you an analysis of my experiences, along with my own opinions.", "I won't bother further addressing the silly comment that indicates how little you should pay attention to that professor (although he may be perfectly competent and amazing elsewhere)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["C++"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "C++", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["An old language, with tons and tons of documentation, most of it useless.", "This is just about the best reference that I've come across on the internet.", "The best thing that you can possibly learn from C++ is pointers.", "If you don't understand pointers, you don't understand computers.", "They feel really simple to me, but apparently tons of people have problems with them.", "Of course I also spent a few hours playing with them to really understand the difference between &amp;, *, and [].", "It's been a few years now, and I've kinda forgot most of the implementation details, but the understanding never leaves."], "childNum": 4, "tag": "p", "senID": 2, "childList": [{"text": "This", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.cplusplus.com/reference/"}, {"text": "&amp;", "childNum": 0, "tag": "code", "pos": 5, "childList": []}, {"text": "*", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "[]", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["Other than pointers, C++ objects kinda suck, the namespaces kinda suck, and the standard libs aren't anywhere close to as awesome as Python.", "Pointers (and manual memory management) are the only things that you can learn in C++ (that I know of), that you can't learn in Python."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Assembly"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Assembly", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["My favorite other language.", "You really learn how the computer works at a hardware level.", "You learn how your data structures (more or less) are implemented - things like strings, etc."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "really", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Assembly is so very very basic, but you really learn about what your computer is doing when you type x += 3."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "x += 3", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["I loved Assembly - it was one of the best languages I've learned so far, and I learned a lot about the basic stuff.", "There's not a lot more I can say about it because I didn't learn any abstract ideas or concepts - it was a bit like working on a car and then taking physics and chemistry courses.", "It may not help much in the way of putting a carburetor back together, but you really understand why that particular gear ratio allows you to get up and go."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "really", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": [], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "C", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["I've only had the teeniest exposure to this language, and honestly I'd probably recommend learning this rather than C++.", "Why?", "Because even though C++ gives you higher level features, you won't get any benefit because they're simply less powerful versions of Python types.", "At the best you might get some speed from C++, but you can get that same speed from C, and C gives you a good intermediate step between Assembly and C++.", "I may have to go teach myself C sometime soon - especially if I have any (hahah!", ") free time this next semester."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["Java"], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "Java", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I saved the best worst for last.", "I know there are tons of Java fans out there (my brother is one), but honestly I don't get it.", "I went into this class expecting to learn something and all I learned wassyntax!", "Oh I guess I learned some of their toolkits, but that was literally it - syntax.", "I think this quote by sums up my experience and feelings:"], "childNum": 4, "tag": "p", "senID": 11, "childList": [{"text": "best", "childNum": 0, "tag": "s", "pos": 0, "childList": []}, {"text": "tons", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "all I learned wassyntax!", "childNum": 1, "tag": "em", "pos": 2, "childList": [{"text": "syntax!", "tag": "b"}]}, {"text": "syntax!", "childNum": 0, "tag": "b", "pos": -1, "childList": []}]}, {"text": ["That's quite how I felt, too."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["Summary"], "childNum": 1, "tag": "p", "senID": 13, "childList": [{"text": "Summary", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["You should learn a new, lower level language that teaches you something new and gives you something that Python can't.", "Java won't (compiled to byte-code is not giving YOU something, it's giving the computer something).", "If you have the choice I would 100% recommend C - it's closer to Assembly and so it offers two things: Speed, and a greater comprehension of what's really going on \"under the hood\", so to speak.", "If you have the chance I'd also recommend taking an Assembly class.", "If you can't choose C, then go with C++ because even if you aren't quite as low level as C, you're 100x better than Java because you'll actually learn something new.", "You can pick up syntax in a week, but a true understanding of a computer really needs lower level comprehension.", "And as an added bonus, if you learn C or C++ you can easily extend Python, whee!"], "childNum": 3, "tag": "p", "senID": 14, "childList": [{"text": "should", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "new", "childNum": 0, "tag": "em", "pos": 4, "childList": []}, {"text": "new", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["(Also, if your professor continues to make fallacious statements like that, and if they don't offer REAL courses like Assembly and C/C++, I might look for a new university)."], "childNum": 0, "tag": "p", "senID": 15, "childList": []}], [{"text": ["Avoiding the trap of commenting on \"it's just a scripting language\"..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For these purposes, I'll eliminate C, as I expect they'd prefer an object-oriented language.", "Otherwise, I'd follow Joel Spolsky's advice (starting about 3/4 through the transcript) and say to learn it (C)."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Joel Spolsky's advice", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "https://stackoverflow.fogbugz.com/default.asp?W12"}]}, {"text": ["Admittedly, I've done a lot more Java than C++ (and more Python and C than either of those), but I'd say that learning Java is easier and I find it less painful to work with as long as you can accomplish what you need with it, so I'd recommend that."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["You may want to look at Joel's article about Java in schools."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Java in schools", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.joelonsoftware.com/articles/ThePerilsofJavaSchools.html"}]}, {"text": ["Edit in reply to the updated question:  While there will be some differences in the specifics between the languages, the only subject I'd say you will learn in C++ but not in Java is dynamic allocation (and some may argue that), as in C++ (and C), you have to call functions to tell the operating system to supply more memory to the program.", "In my mind, that is dynamic allocation."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["They are all pretty different from Python and they are all somewhat similar to one another.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "somewhat", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Opinions will no doubt be strong about which one would be the best.", "I would recommend Java based on object-orientation and garbage collection."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As far as the benefit goes, there is always a benefit in learning a new language that is different in some significant way from what you already know.", "Also, you're highly more likely to get a job working in Java."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you really want to stick with Python, it's worth noting that the most commonly used implementation (CPython) is written and extended in C. Not C++, but C."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Falling into being trolled by your professor, Python is truly a very powerful language.", "It's not bash.", "See: django, pylons, numpy, zope, etc."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "etc", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.python.org/about/success/"}]}, {"text": ["Personally, I write C for work.", "Anything I don't have to write in C gets written in Python.", "I'm not in school, and my educational background isn't CS, but that's what life can be like in industry.", "When coder time matters, Python is a solid high level language.", "When code size matters, C is the point beyond which most returns diminish quickly."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I would say it depends on what you're planning to study in the program.", "If you're on the \"systems track\" (i.e.", "operating systems, deep networking, etc.", "), you're going to need C.  C is definitely the most different from Python of those you listed.", "As an added bonus, it's by far the smallest of the three in terms of syntactical structure and library content--thus, the easiest to learn, if you can wrap your head around pointers."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["C++ is a nice middle ground between C &amp; Python.", "You'll get operator overloading and other pythonesque niceties, as well as a more capable standard library, with the power of C.  There are also nice facilities for interoperability with Python (e.g.", "SWIG &amp; boost.python).", "But C++ is a huge language syntactically, so it will be a long time before you're fully able to harness it's power.", "That said, you'll be able to do useful work in it before too long."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Java has the advantage (and disadvantage) of having an absolutely enormous standard library--Java programs tend to be exercises in integrating already existing components, rather than creating a lot of new capability from scratch."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["My recommendation would be to start with C because you'll get the most benefit in the limited time before your degree program starts.", "You'll have time to pick up Java &amp; C++ later while doing SW engineering courses or other \"applications track\" work."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Good luck in school!"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["If you already know Python, I would recommend learning C. They’re often employed in quite different environments, so it would be great for expanding your knowledge.", "C is also particularly useful to know because it will help your understanding of low–level concepts (which in my experience has made me a better coder in higher–level languages)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The answer depends much on what you are trying to achieve with a programming language.", "If you need the speed and ease of working then any dynamic language like python, ruby etc are languages of choice. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you are looking for performance, finer control and robustness then its difficult to find a substitute for C/C++.", "You can even mix and match these languages to create robust and scalable applications (see Boost::Python and SWIG). "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you need the best of both worlds in a single language then \"Google Go\" is the one for you.", "Though its in a pretty nascent stage, but still the language design and the thought behind it is pretty impressive.", "Programming is fun with \"Google Go\"."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you prefer conciseness of expression and you are a fan of JVM then try Scala."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Since you already know some programming, and probably most concepts they want to teach you in this course, I suggest the Bruce Eckel route:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "read \"Thinking in C++\"", "tag": "none", "senID": 1}, {"text": "no, first read his introduction \"Thinking in C\"\n", "tag": "none", "senID": 2}, {"text": "if you still have time left\n", "tag": "none", "senID": 3}]}, {"text": ["This will give you a background in C and some C++ while still being entertaining: It is not so much about the syntax as about the why stuff is done in C++ the way it is.", "You will have ever so many enlightened moments."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "syntax", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "why", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["If you decide to go the Java path (way less syntax to learn than C++ and will leave you more or less sane in the head), then you should probably also read the intro chapters from Java in a Nutshell..."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I would learn Java for your studies, as it's more closely related to Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to learn how a computer really works then take a look and possibly learn a bit about writing c programs."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Learn them all!", "C, C++ and Java has similarities, learn C, then C++, and then java (the strictest first)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In my studies I have been required to program in C, C++ and Java, but also PHP, Basic, LISP and ML.", "This did that when I got my first Python assignment on work, it did not take me any time at all to understand how to program in python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So my tip is learn as many languages as possible, it will make you a better programmer."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["As someone who started out writing in assembler, then C, then C++, then Java, I agree..learn them all (eventually).", "Your experience in lower languages (how a computer actually works, how registers and memory management works, what REALLY happens on the stack ) serves you well in any higher level language. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["(Side note, knowing assembler made pointers a nonissue.", "Bonus!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For your exam, though, my vote is for C, and for your career, my advise is always learn something new and stretch your mind.", "Why be a developer if you aren't learning something new all the time?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I am Agreeing with the Kent,even though, i like to say, Study Java, it will make the development easy and more over you will get high scalable application"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["First of all, don't worry too much; learning a second programming language is much easier than learning the first one :)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Second, I'd like to challenge the opinion underlying many of the answers that your professor is an idiot ;).", "I spend most of these days coding python, and love it, so this is not an anti-python rant.", "Also, \"just a scripting language\" is clearly wrong and I'm not even going to go into this.", "Still, there's something to be said about having experienced a language in which you have to care about the declaration, type, and (in the case of C/C++) storage in memory of your variables. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["To finally answer your question (again ;), I'd agree on C as the most unrelated to python.", "Looking at the topics however, it seems that OOP is an issue, so I'd then go for C++."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I would recommend Java, as it has less learning overhead (memory allocation, different architectures), and allows you to easily tie any new knowledge into the writing of Jython libraries, which will let you speed up your Python programs."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]