[[{"text": ["The web service is the best way, but there are some caveats:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The web hit is the way to go, but make sure you pick a good URL - your app will be hitting it for years to come. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You only need a username and password for authenticating yourself to a smarthost.", "You don't need it to send mail directly, you need it to send mail through a relay, e.g.", "your ISP's mail server.", "It's perfectly possible to send email without authentication - that's why spam is so hard to stop."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Having said that, some ISPs block outbound traffic on port 25, so the most robust alternative is an HTTP POST, which is unlikely to be blocked by anything.", "Be sure to pick a URL that you won't feel restricted by later on, or better yet, have the application periodically check for updates, so if you decide to change domains or something, you can push an update in advance."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Security isn't really an issue.", "You can fairly easily discard junk data, so all that really concerns you is whether or not somebody would go to the trouble of constructing fake tracebacks to mess with you, and that's a very unlikely situation."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["As for the payload, PyCrash can help you with that."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "PyCrash", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pycrash.sourceforge.net/"}]}], [{"text": ["PyCrash?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PyCrash", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pycrash.sourceforge.net/"}]}], [{"text": ["Whether you use SMTP or HTTP to send the data, you need to have a username/password in the application to prevent just anyone from sending random data to you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["With that in mind, I suspect it would be easier to use SMTP rather than HTTP to send the data."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Some kind of simple web service would suffice.", "You would have to consider security so not just anyone could make requests to your service.."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["On a larger scale we considered a JMS messaging system.", "Put a serialized object of data containing the traceback/error message into a queue and consume it every x minutes generating reports/alerts from that data."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]