[[{"text": ["IronPython with Mono is cross platform - to whatever platforms supported by Mono, and for the feature set supported by Mono (which pretty much means Windows Forms is supported fairly well).", "Other options for GUI toolkits are available, however, which may provide better \"cross platform\" capabilities, or at least a better feel on non-Windows platforms."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "IronPython with Mono", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.mono-project.com/Python"}, {"text": "GUI toolkits are available", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://mono-project.com/Gui_Toolkits"}]}, {"text": ["CPython will depend on the GUI suite you choose.", "Personally, I've found CPython with PyQt to be the most usable, cross platform GUI option from Python.", "It's very powerful, feature-rich, and works quite well."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "CPython with PyQt", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.riverbankcomputing.co.uk/software/pyqt/intro"}]}, {"text": ["Jython will work, but I personally don't like the GUI options as much (this is a 100% personal preference, however)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'd say that if cross-platform is a goal, forget IronPython.", "A lot of people hate the dependency hell it causes so it'll be too much work to get it up in running in some OSes/distributions.", "Jython will suffer this also, albeit to a lesser degree."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "lot", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["Well, Mono does not come with the base of most Linux distributions.", "It's not a terribly lightweight dependency either, and I think Java is considerably more likely for people to already have.", "Would you plan on using \"Winforms\" with Mono?", "If so, and you don't have experience with Winforms, read about what others have to say :-)  The other .NET GUI toolkit is WPF, which unfortunately Mono has no plans to implement."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Jython would be better too, because you can use SWT, which renders native widgets and provides lots of layout possibilities easily.", "Or you can use Jython with Swing, or whatever else -- even AWT if you love ugliness."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I really like wxPython (which you can use with CPython, which is on most distros by default), because it renders good-looking native widgets in OSX, Windows and Linux (I've only seen the Gnome widgets in person).", "wxPython is by far the easiest to use GUI toolkit I've used -- even programatically (i.e.", "layout without Glade or similar).", "I've also used SWT, which I found quite nice, and Swing, which I personally don't really like the looks of, and Winforms, which was a nightmare to try to do even simple layouts with."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Here's a quick comparison of the existence of the interpreter/language runtime by OS"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "CPython", "tag": "none", "senID": 4}, {"text": "\n", "tag": "none", "senID": 5}, {"text": "Jython", "tag": "none", "senID": 6}, {"text": "\n", "tag": "none", "senID": 7}, {"text": "IronPython", "tag": "none", "senID": 8}, {"text": "\n", "tag": "none", "senID": 9}]}, {"text": ["I would choose a GUI toolkit first, since that will very much impact the user experience and overall difficulty (I would choose wxPython but SWT would be a close second) then consider the above as well maybe as a tiebreaker."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}], [{"text": ["Take a look at comparable GUI's written in python/jython/ironpython.", "Look for programs that you like and find out what they use.", "I guess most if not all will be written in cpython + gtk or cpython + qt.", "I think all gui toolkits in python are cross platform.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I faced this same question roughly a year ago.", "After looking at all the alternatives, I ended up with CPython and PyQt.", "IMO, Qt/PyQt is by far the best choice amongst all of the Python GUI toolkits.", "After hitting many bugs in wxPython I switched to PyQt and never looked back.", "Qt/PyQt are much more solid than the wx toolkits in my experience."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I use the exact same code base and build stand alone executables with PyInstaller for Windows and Py2App for the Mac (PyInstaller can be used for Linux as well).", "Because these builders embed the Python interpreter and all of the dependencies, it takes a lot of the hassle away.", "The only rub is that you'll need both a Windows and Mac to do the builds.", "Getting all of the configurations correct can be a pain too, but it's possible and time worth investing."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "PyInstaller", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pyinstaller.org/"}, {"text": "Py2App", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://svn.pythonmac.org/py2app/py2app/trunk/doc/index.html"}]}], [{"text": ["There are plenty of answers already, but I'd like to add one important thing - regardless of which library you learn, most of the principles will be the same when you move to another library."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I don't know about Qt, but for most graphics programs (in PyGTK or Tkinter) the best thing to do, as far as editing goes, is to use a PIL image (or something similar) to draw on and then draw that image on your canvas widget, otherwise you can lose pixel data if your window gets covered."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You may use Python 2.7 or 3.1 (CPython) with ttk (in Standart Library in 2.7, 3.1), ttk support themes (looks nice and very simple coding)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "ttk", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/ttk.html"}]}, {"text": ["(1-st screen is text-editor with tabs and syntax highlighting) ttk screenshots"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "(1-st screen is text-editor with tabs and syntax highlighting)", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"href": "http://code.google.com/p/python-ttk/wiki/Screenshots", "text": "ttk screenshots", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["Java is the most portable platform.", "Jython is written in 100% pure Java.", "'Nuff said."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "is", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["BTW I just switched a CPython/GTK project to Jython (trying to remove as much unmanaged code as possible), the only problem is that Jython is at 2.5 still, which kind of sucks when you're used to 2.6/2.7/3 :)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]