[[{"text": ["Learning C (or, for the added fun, C++) as a device of increasing your understanding of programming is a good idea IMHO.", "But it doesn't have anything to offer you as regards web development."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You always need to know enough c to port headers to your language of choice when there are no ports for a library you want to use yet.", "Many libraries are written in c since then they can be used from almost all platforms/languages."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Learning C won't necessarily make you a better programmer; there's a superstition that because C is moderately difficult to learn (true) and doesn't have an extensive toolkit (also true), you gain a deeper insight into programming in general (not necessarily true).", "C's just another language, no better or worse than any other.", "You'd get as much benefit learning Fortran.", "If you're really interested in how things work at the machine/OS level, you'd be better served learning an assembler; just remember that assemblers are specific to their platforms, and some of the concepts that apply to x86 don't apply to other platforms such as MIPS or PPC."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "just another language", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "really", "childNum": 0, "tag": "em", "pos": 3, "childList": []}]}, {"text": ["Learning C won't help you much in your day-to-day work in web development. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Having said that, it's always a good idea to pick up new languages if you can, especially languages that are as different as possible from what you're currently using, just because it helps you to learn the difference between a general programming concept vs. a particular language's implementation of that concept.", "I've seen plenty of people proficient in a language like C# flail helplessly when forced to work in C because all of their shiny tools are missing.  "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Given that you have experience of object orientated programming in C#, I would recommend learning C++ as opposed to C. It will indeed make you a more rounded programmer.", "While you could program web sites using C or C++, it's not commonly done for small scale web sites.", "Facebook created HipHop for PHP for instance to improve performance:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "HipHop for PHP", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["Good luck with your learning, never stop :-)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["no :)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["C is not targeted for web development"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You should definitely check this out:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Native Client is an open-source technology for running native code in web applications, with the goal of maintaining the browser neutrality, OS portability, and safety that people expect from web apps."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Native Client", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.youtube.com/watch?v=nP8Mo0jGQDk"}]}]]