[[{"text": ["Pick the language you are most familiar with.", "If you know them all equally and speed is a real concern, pick C. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["While I am a huge fan of Python and personaly I'm not a great lover of Java, in this case I have to concede that Java is the right way to go."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For many projects Python's performance just isn't a problem, but in your case even minor performance penalties will add up extremely quickly.", "I know this isn't a real-time simulation, but even for batch processing it's still a factor to take into consideration.", "If it turns out the load is too big for one virtual server, an implementation that's twice as fast will halve your virtual server costs."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For many projects I'd also argue that Python will allow you to develop a solution faster, but here I'm not sure that would be the case.", "Java has world-class development tools and top-drawer enterprise grade frameworks for parallell processing and cross-server deployment and while Python has solutions in this area, Java clearly has the edge.", "You also have architectural options with Java that Python can't match, such as Javaspaces."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I would argue that C and C++ impose too much of a development overhead for a project like this.", "They're viable inthat if you are very familiar with those languages I'm sure it would be doable, but other than the potential for higher performance, they have nothing else to bring to the table."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["C# is just a rewrite of Java.", "That's not a bad thing if you're a Windows developer and if you prefer Windows I'd use C# rather than Java, but if you don't care about Windows there's no reason to care about C#."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Write it in your preferred language.", "To me that sounds like python.", "When you start running the system you can profile it and see where the bottlenecks are.", "Once you do some basic optimisations if it's still not acceptable you can rewrite portions in C. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A consideration could be writing this in iron python to take advantage of the clr and dlr in .net.", "Then you can leverage .net 4 and parallel extensions.", "If anything will give you performance increases it'll be some flavour of threading which .net does extremely well."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Edit:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Just wanted to make this part clear.", "From the description, it sounds like parallel processing / multithreading is where the majority of the performance gains are going to come from."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I would pick Java for this task.", "In terms of RAM, the difference between Java and C++ is that in Java, each Object has an overhead of 8 Bytes (using the Sun 32-bit JVM or the Sun 64-bit JVM with compressed pointers).", "So if you have millions of objects flying around, this can make a difference.", "In terms of speed, Java and C++ are almost equal at that scale."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So the more important thing for me is the development time.", "If you make a mistake in C++, you get a segmentation fault (and sometimes you don't even get that), while in Java you get a nice Exception with a stack trace.", "I have always preferred this."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In C++ you can have collections of primitive types, which Java hasn't.", "You would have to use external libraries to get them."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you have real-time requirements, the Java garbage collector may be a nuisance, since it takes some minutes to collect a 20 GB heap, even on machines with 24 cores.", "But if you don't create too many temporary objects during runtime, that should be fine, too.", "It's just that your program can make that garbage collection pause whenever you don't expect it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Why only one language for your system?", "If I were you, I will build the entire system in Python, but C or C++ will be used for performance-critical components.", "In this way, you will have a very flexible and extendable system with fast-enough performance.", "You can find even tools to generate wrappers automatically (e.g.", "SWIG, Cython).", "Python and C/C++/Java/Fortran are not competing each other; they are complementing. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would go with pypy.", "If not, http://lolcode.com/."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://lolcode.com/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://lolcode.com/"}]}], [{"text": ["It is useful to look at the inner loop of your numerical code.", "After all you will spend most of your CPU-time inside this loop. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If the inner loop is a matrix operation, then I suggest python and scipy, but of the inner loop if not a matrix operation, then I would worry about python being slow.", "(Or maybe I would wrap c++ in python using swig or boost::python)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The benefit of python is that it is easy to debug, and you save a lot of time by not having to compile all the time.", "This is especially useful for a project where you spend a lot of time programming deep internals."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]