[[{"text": ["100,000 - 200,000 pageviews/day is on average 2 pageviews/s, at most you'll get 10-20 pageviews/s during busy hours.", "That's not a lot to handle, especially if you have caching."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Anyways, I'd go for VPS.", "The problem with shared server is that you can never know the pattern of use the other ppl have."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Webfaction hosting hosts nearly 10 sites of ours handling over 10k users each day, easily.", "I am also told that Slicehost is just as good."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Webfaction and Slicehost are often looked upto for mod_wsgi python hosting, which is fast becoming the preferred way to host django apps."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["These hosts seem to be on a slightly higher side of the charges/month; but its worth it, as they are reliable."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Most hosts support multiple sites without extra charge.", "Don't pick GoDaddy because of that.", "I never used GoDaddy hosting, but use them for domain registration, and they are absolutely terrible.", "Terrible UI, terrible performance.", "I would never trust them to host a website.", "The only reason I use them for domain registration is that they seem to be the cheapest option."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For shared web hosting, especially Python/Django, I recommend WEBFACTION."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I'm with GoDaddy.com and it's true that you can have an unlimited number of sites on the same hosting plan but you are limited to 100 unique users.", "This means that it doesn't matter if you have 1 website or 1000 websites on your hosting plan, you can only have 100 visitors at the same time throughout all of your sites combined.", "Some visitors could leave and some new ones can arrive but never more than 100 at a time on your GoDaddy hosting plan.", "I have 10 sites myself so if I have 100 visitors to http://www.milliondollarmysterychallenge.com then none of my other sites can get any traffic     until someone leaves!", "this stinks!", "if anybody knows of a better place to host please post a link in the comments."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.milliondollarmysterychallenge.com", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.milliondollarmysterychallenge.com"}]}], [{"text": ["If your application is optimized, you shared hosting account can handle 10k unique visitors per day."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You can find a great hosting for your needs at WFT (WebHostingTalk)"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "WebHostingTalk", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.webhostingtalk.com"}]}, {"text": ["One of the biggest hosting provider is GoDaddy (I RECOMMEND IT).", "Their shared hosting plan with Python starts from $7/month.", "With them you can host multiple websites on the same account without extra charge."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["http://www.godaddy.com/gdshop/hosting/shared.asp?ci=9009"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://www.godaddy.com/gdshop/hosting/shared.asp?ci=9009", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.godaddy.com/gdshop/hosting/shared.asp?ci=9009"}]}, {"text": ["And also take a look at this offer: http://mediatemple.net/webhosting/gs/features/"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://mediatemple.net/webhosting/gs/features/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mediatemple.net/webhosting/gs/features/"}]}, {"text": ["(mt) MediaTemplate company is not that big as GoDaddy but is also in good standing.", "Reliable.net is too small."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["So, here recommended options are:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["GoDaddy"], "childNum": 0, "tag": "a", "senID": 7, "childList": []}, {"text": ["HostGator"], "childNum": 0, "tag": "a", "senID": 8, "childList": []}]}], [{"text": ["I have been using mysql on shared hosting for a while mainly on informational websites that have gotten at most 300 visits per day.", "What I have found is that the hosting was barely sufficient to support more than 3 or 4 people on the website at one time without it almost crashing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Theoretically i think shared hosting with most services could support about about 60 users per hour max efficiently if your users all came one or two at a time.", "This would equal out to about about 1500 users in one day.", "This is highly unlikely however because alot of users tend to be online at certain times of the day and you also have to throw in the fact that shared servers get sloppy alot due to abuse from others on the server."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I have heard from reliable sources that some vps hosting thats 40-50 dollars per month have supported 500,000 hits per month.", "I'm not sure what the websites configurations were though, i doubt the sites ran many dynamic db queries or possibly were simply static."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["One other thing that is common on shared hosting is breaking up the file managers with the database hosting.", "Sometimes your files will do well appearing online but the database that runs your actual website will be lagging extremely due to abuse from your neighbors."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I am hosting with Godaddy.", "But I am not aware of this 100 users at the same time thing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["That sounds like a stretch for a $5/month shared hosting service.", "I'd suggest looking in to MediaTemple Grid-Service which is a bit more expensive at $20/month but is more likely to be able to handle your volume and grow with you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]