[[{"text": ["It sounds like people will have to write their own decryption utility, or use something off-the-shelf, or use off-the-shelf components to decrypt your posts."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PBKDF2 is a standardized algorithm for password-based key derivation, defined in PKCS #5.", "Basically, you can tune \"iterations\" parameter so that deriving the key from a password (the answer to the Euler problem) would take several seconds.", "The key can then be used for any common symmetric encryption algorithm, like AES-128."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This has the advantage that most crypto libraries already support PBKDF2.", "In fact, you might find mail clients that support password-based encryption for S/MIME messages.", "Then you could just post an S/MIME and people could read it with the mail client.", "Unfortunately, my mail client (Thunderbird) only supports public-key encryption."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I think Yin Zhu pegged the social aspect of it and Whirlwind the technical.", "Using your preferred approach of:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n python decrypt.py --problem=123 --key=1234567\n</code>\n</pre>\n", "senID": 1}, {"text": ["the key number is readily available to Google, and even without that, slamming through a million keys (assuming a median key length of 5 decimal digits yields less than 20 bits of key) is pretty fast.", "If I wanted to be more clever I could use plain-text assumptions (e.g.", "import, for) and vastly reduce my search space."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "import", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "for", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["For all the trouble you're probably best off using something really complicated like:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n &gt;&gt;&gt; print codecs.getencoder('rot_13')('import codecs')[0]\nvzcbeg pbqrpf\n</code>\n</pre>\n", "senID": 4}, {"text": ["And if you want the solution to Project Euler problem 123, you'll have to beat it out of me..."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Yes, you can do this with virtually any symmetric encryption algorithm: DSA, or AES, for example; just use the integer as the key, and pad the key out to the required length of the encryption algorithm's key, and use that key to decrypt the answer."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Keep in mind that if you extend a short key, the encryption won't be very good.", "The strength of the encryption has a lot more to do with key length and the algorithm itself than how long it takes to run."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This question seems to have some examples of libraries to use with python."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "question", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/172486/what-pure-python-library-to-use-for-aes-256-encryption"}]}], [{"text": ["Just use triple DES and use different keys for each iteration, use the number to generate a each of the 3 keys.", "Pad up the key length with some text, and you're good."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Tripple DES was designed to increase effectiveness against brute force."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It's not the world's most secure option, but I'll keep most bruter's at bay."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you encrypt your answers, those who have solved the problem simply do not want to see your answers with such effort, provided that they already have plenty of answers to see in the answer page.", "Those who haven't cannot see.", "Then your work becomes less useful. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Btw, there are many places providing answers to Project Euler, e.g.", "Haskell answers, Clojure answers, F# answers.", "If somebody only wants the answer to a question, he/she could simply run the program.", "Provided that Python is so popular, google \"Python Euler xx\" would give you plenty of blogs solving a specific problem. "], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "Haskell answers", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.haskell.org/haskellwiki/Euler_problems"}, {"text": "Clojure answers", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://clojure-euler.wikispaces.com/The+Optimal+Toolkit"}, {"text": "F# answers", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://fsharp-euler.wikispaces.com/"}]}], [{"text": ["The simplest approach would be to hash the answer using a secure hash function such as SHA-1, then provide the hash so users can verify their answer.", "If you want to make brute-forcing more difficult, iterate the hash - eg, provide the result of n recursive applications of SHA1, where n is some parameter you choose to make it difficult to brute-force."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If the number of possible answers is small, though, it'll be difficult to impossible to prevent someone from brute-forcing it even with an expensive hash function."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Edit: Sorry, I misread your original question.", "If you want to encrypt your answer, you could do that by using the resulting hash, above, as the encryption key for your answer, rather than posting the hash."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you want an encryption routine that is easy to use and distribute, I recommend Paul Rubin's p3.py.", "It's probably on the fast side, for how secure it is, but since you seem to be in need of a hurdle to be jumped rather than a siege-resistant wall, it may be a good choice for your purposes."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "p3.py", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.nightsong.com/phr/crypto/p3.py"}]}, {"text": ["You could also look into rijndael.py, which is an implementation of AES, and slower than p3.py."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "rijndael.py", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://bitconjurer.org/rijndael.py"}]}]]