[[{"text": ["It's hard to answer your question without any background information.", "Is the complexity justified if you just want a blog?", "No.", "Is the complexity justified if you're building a company intranet for 400+ people?", "Yes.", "Is it a good investment if you're looking to be a consultant?", "Absolutely!", "There's a lot of Plone work out there, and it pays much better than the average PHP job."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I'd encourage you to clarify what you're trying to build, and ask the Plone forums for advice.", "Plone has a very mature and friendly community — and will absolutely let you know if what you're trying to do is a poor fit for Plone.", "You can of course do whatever you want with Plone, but there are some areas where it's the best solution available, other areas where it'll be a lot of work to change it to do something else."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Some background:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The reason for the complexity of Plone at this point in time is that it's moving to a more modern architecture.", "It's bridging both the old and the new approach right now, which adds some complexity until the transition is mostly complete."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Plone is doing this to avoid leaving their customers behind by breaking backwards compatibility, which they take very seriously — unlike other systems I could mention (but won't ;). "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["You care about your data, the Plone community cares about their data — and we'd like you to be able to upgrade to the new and better versions even when we're transitioning to a new architecture.", "This is one of the Plone community's strengths, but there is of course a penalty to pay for modifying the plane while it's flying, and that's a bit of temporary, extra complexity."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Furthermore, Plone as a community has a strong focus on security (compare it to any other system on the vulnerabilities reported), and a very professional culture that values good architecture, testing and reusability."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["As an example, consider the current version of Plone being developed (what will become 4.0):"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "It starts up 3-4 times faster than the current version.", "tag": "none", "senID": 8}, {"text": "It uses about 20% less memory than the current version.", "tag": "none", "senID": 9}, {"text": "There's a much, much easier types system in the works (Dexterity), which will reduce the complexity and speed up the system a lot, while keeping the same level of functionality", "tag": "none", "senID": 10}, {"text": "The code base is already 20% smaller than the current shipping version, and getting even smaller.", "tag": "none", "senID": 11}, {"text": "Early benchmarks of the new types system show a 5&times; speedup for content editing, and we haven't really started optimizing this part yet.", "tag": "none", "senID": 12}]}, {"text": ["— Alexander Limi, Plone co-founder (and slightly biased ;)"], "childNum": 0, "tag": "p", "senID": 13, "childList": []}], [{"text": ["If you want to see the complexity of Plone, you have to ask for it.", "For most people, it's just not there.", "It installs in a couple of minutes through a one-click installer.", "Then it's one click to log in, one click to create a page, use a WYSYWIG editor, and one click to save.", "Everything is through an intuitive web GUI.", "Plone is a product."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to use it as a \"platform,\" then the platform is a stack of over one million lines of code which implements a complete content management suite.", "No one knows it all.", "However, all those \"acronyms\" and \"files\" are evidence of a software which is factored in components so that no one need know it all.", "You can get as deep or shallow in it as you need.", "If there's something you need for some aspect of content management, it's already there, you don't have to create it from scratch, and you can do it in a way that's consistent with a wide practice and review."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I found an anonymous comment here which is much better than that post itself, so I'm reposting it here in full, with a couple of typos corrected."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://bitubique.com/content/im-done-plone#comment-10"}]}, {"tag": "hr", "senID": 1}, {"text": ["This summer my chess club asked me to make a new website, where the members of the board should be able to add news flashes, articles, ...", "Sounded like a CMS.", "Being a Python developer, I looked at Plone and bought the Aspeli book Professional Plone development (excellent written btw)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I took 3 weeks of my holiday the study the book and to setup a first mock up of the site."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["After 3 weeks I realized that Plone has some very nice things but also some very frustrating things\nOn the positivie side"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "if you don't need to customize Plone, Plone is great in features and layout", "tag": "none", "senID": 5}, {"text": "Plone has a good security model", "tag": "none", "senID": 6}, {"text": "Plone has good off the shelf workflows", "tag": "none", "senID": 7}, {"text": "Plone is multi language (what I needed)", "tag": "none", "senID": 8}]}, {"text": ["On the downside"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["I assume that Plone is so slow because of points 4, 5, 6 and 7."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["Points 6 and 7 made me dropping Plone.", "I looked around for other options and eventually decided to develop my own CMS on Pylons, which is blazingly fast compared to Plone.", "On the same development server I have a startup time of 1 second, and a reload page time is not measurable."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["The site www.kosk.be is running (it is in Dutch).", "The CMS behind it, named Red Devil, will be launched as a separate open source project beginning next year"], "childNum": 0, "tag": "p", "senID": 12, "childList": []}], [{"text": ["I see four things that can justify an investment of time in using Plone:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Plone has a large and helpful community. Most of the things you need, somebody else", "tag": "none", "senID": 1}, {"text": "You won't need to understand the whole complexity for many of your customizing needs.", "tag": "none", "senID": 2}, {"text": "Plone developers are aware of their complex stack, and are discussing how this can be\nreduced. Plone has proven in the past that it is able to renew itself and drop old\ninfrastructure in a clean way with defined deprecation phases.", "tag": "none", "senID": 3}, {"text": "There are many local user groups with helpful people.", "tag": "none", "senID": 4}]}, {"text": ["Oh wait, I was told the plone developer meetings are one of the best!", "Like that one"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Like that one", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://plone.org/events/conferences/vienna-2004"}]}], [{"text": ["From a system administrator standpoint, Plone is just shy of being the absolute devil.", "Upgrading, maintaining, and installing where you want to install things is all more painful than necessary on the Linux platform.", "That's just my two cents though, and why I typically prefer to avoid the Zope/Plone stack."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Note: it's better with newer releases, but older releases.... ugh "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Accretion."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["About the comment here I think Plone doesn't work like that (at least not anymore). "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/348044/what-could-justify-the-complexity-of-plone/446659#446659"}]}, {"text": ["1 - Plone is somehow slower than other CMS solutions indeed, but from the out-of-the-box setup to a Apache-Varnish-Zope-Relstorage solution, there is a lot of optimization space."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["2 - That is true.", "The answer here kind of explains it, but indeed Plone is a complex animal."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "here", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/348044/what-could-justify-the-complexity-of-plone/348508#348508"}]}, {"text": ["3 - Not sure what you mean.", "TAL Path expressions are based on the concept of object attribute traversal.", "Seems OO to me."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["4 - True.", "Although after you understand how Acquisition works, it stays out of your way.", "And in Plone not many things depend on Acquisition, I guess."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["5 - Not true.", "Zope Page Templates are all about separating content from presentation.", "The fact that content and presentation can be viewed from the ZODB (and actually most of the templates stay in the filesystem, you just see a \"view\" of them in the ZODB) is more related to the fact that the ZODB is a big object database - which in turn does not mean that they are all content.", "Everything in \"pure\" OO system is an object, it is just the kind of object (presentation objects, content object, etc) that matters."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["6 - Plone does distinguish between webdesigners and content creators.", "The designers do all customizations (templates, CSSs, JSs,etc) and then content creators create the content using Plone UI.", "The point here is that Plone is mainly a CMS, which means that content creators are supposed to be laymen in terms of design."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["7 - Partially true.", "Considering that the UI structure won't change, all presentation specification is contained in CSS files.", "If the UI structure needs to change, the designer might work with a plogrammer :-) to adequate the templates."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["I guess in no system that outputs dynamic pages the designer is completely free to speak only HTML, CSS and JS, and leave out some other technology, be it PHP, Python, ASP or Java.", "If he does, there will be definitely a programmer that will get the HTML,CSS and JS from the designer and \"dynamize it\".", "This model definitely exists in Plone."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}]]