[[{"text": ["Here's a good list."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Here's a good list.", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/GuiProgramming"}]}], [{"text": ["I've used Tkinter and wxPython.", "Tkinter is quite basic, and doesn't use native widgets.", "This means that Tkinter applications will look the same on any platform – this might sound appealing, but in practice, it means they look ugly on any platform :-/  Nevertheless, it's pretty easy to use.", "I found Thinking in Tkinter very helpful when I was learning, because I'd never done any GUI programming before.", "If things like frames and layout algorithms and buttons and bindings are familiar to you, though, you can skip that step."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Thinking in Tkinter", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.ferg.org/thinking_in_tkinter/index.html"}]}, {"text": ["You can augment Tkinter with Tix (but be warned, Tix doesn't play well with py2exe).", "Also check out Python Megawidgets, which builds some more advanced controls using the Tkinter basics."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Finally, Tkinter plays nice with the shell: you can start the interpreter, do things like 'import tkinter' 'tk = tkinter.Tk()' etc.", "and build your GUI interactively (and it will be responsive).", "(I think this doesn't work if you use IDLE, though)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["wxPython is much better looking, and ships with a much greater range of controls.", "It's cross-platform (though it seems a bit finicky on my Mac) and uses native controls on each platform.", "It's a bit confusing, though.", "It also ships with a demo application that shows off most of its features, and provides a test-bed for you to experiment.", "Some specific thoughts on wxPython:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "There are three (?) different ways to lay widgets out.  Ignore two of them; just use Sizers.  And even then, you can do just about any layout using only BoxSizer and GridBagSizer.", "tag": "none", "senID": 4}, {"text": "All wx widgets have IDs.  You don't need to care what the IDs are, but in the old days (I think) you did need to know, so some old code will be littered with explicit ID assignments.  And most demo code will have -1 everywhere as the ID parameter (despite the fact that the methods all have ID as a keyword parameter that defaults to -1 anyway).", "tag": "none", "senID": 5}, {"text": "Make sure you get the standard wxWidgets docs as well as the wxPython Demo – you need them both.", "tag": "none", "senID": 6}, {"text": "If you want to use wxPython with py2exe and you want it to look good on Windows XP, you need a bit of trickery in your setup.py.  See ", "tag": "none", "senID": 7}]}], [{"text": ["Instead of posting a list of your options I will give my humble opinion:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I am in love with wxPython."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I have used Qt in C++ and Tk way back in the Tcl days but what really makes me like wxPython is the demo that you get with it.", "In the demo you can browse through all the different widgets frames etc that are part of the framework see the source code and actually see how it looks while it is running."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I had some problems getting the Linux version build and installed but now that I have it available I use it all the time.", "I have used wxPython for small data analysis applications and I have written several internal tools related to comparing test results, merging source code etc."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["PythonCard is really easy to use.", "That's what I would recommend."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PythonCard", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pythoncard.sourceforge.net/"}]}, {"text": ["Here's there writeup:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["PyQt is excellent if you have experience or interest in Qt."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.riverbankcomputing.co.uk/software/pyqt/intro"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.riverbankcomputing.co.uk/software/pyqt/intro", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.riverbankcomputing.co.uk/software/pyqt/intro"}]}], [{"text": ["Most python GUI APIs will be wrappers around the most common c/c++ GUI APIs.", "You've got a python wrapper for gtk, a python wrapper for qt, a python wrapper for .NET, etc etc. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So really it depends on what your needs are.", "If you are looking for the easiest way to draw native-looking widgets on Linux, Mac, and Windows, then go with wxPython (python wrapper for WX Widgets).", "If cross-platform isn't one of your needs though, other libraries might be more useful. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I found this link a long time a go: http://www.awaretek.com/toolkits.html.", "It suggests a tookit based on your criteria.", "For me it suggests wxPython all the time.", "Anyway it gives you a bunch of scores on the various toolkits.", "What is right for me may not be right for you.", "But it gives you how all the tookits scored according to your criteria, so if you don't like the top toolkit for some reason you can see which ones are closest to your criteria."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.awaretek.com/toolkits.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.awaretek.com/toolkits.html"}]}, {"text": ["QT/GTK/WxWidgets (formerly wxWindows) seem to be among the most mature cross platform GUI toolkits.", "The only issue is that none is installed with the default installation of Python, so you may have to compile the libraries.", "If you want something with no installation required that just runs, then go with TKInter because as has been mentioned it is installed by default with Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Anyway my criteria were 9 on Ease of Use, 10 on maturity of documentation/widgets, 10 on installed base, 5 on gui code generators, 10 on native look and feel for both windows/linux and 1 and 5 for the last two, I'm not big into Mac OSX (even with a 10 here it suggests wxpython)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I like wxPython or Tk."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Tk comes with the standard Python distribution so you don't need install anything else."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["wxPython (wxWigets) seems much more powerful and looks a lot nicer.", "It also works well cross-platform (though not perfectly because it uses different underlying graphic API's on diff system types)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["EasyGui Website"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "EasyGui Website", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://easygui.sourceforge.net/"}]}], [{"text": ["I prefer PyGTK, because I am a GNOME guy.", "Using PyGTK feels very pythonic to me.", "The code organization feels consistent, the documentation is clean and thorough, and it's a very easy toolkit to get used to (except for maybe Treeviews)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I've been working with wxPython for a few years now and I like it quite a bit.", "The best thing about wxPython is that the UI feels native on the different platforms it runs on (excellent on Windows and Linux though not as good on OS/X)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "wxPython", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.wxpython.org"}]}, {"text": ["The API lacks some consistency, but you quickly get used to it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You can check out Testuff (shameless plug, as it's my own product) to get a feeling of what can be done with wxPython (although I must say, with quite a bit of effort)."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Testuff", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.testuff.com"}]}], [{"text": ["wxPython, and I'm assuming PyGTK also, can use wxGlade to help you design most UIs you will create.", "That is a big plus.", "You don't have to learn how to hand-code the GUI until you're ready.", "I made several GUI programs straight from wxGlade before I was comfortable enough in how wxPython worked to take a shot at hand-coding."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PyQt has a similar graphic layout device but I've never had good luck getting PyQt to compile correctly.", "There was also a lack of tutorials and documentation that showed how to create the final Python code; many of the documents I found referred to the C++ version of Qt."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Tkinter is good for quick and dirty programs but, realistically, if you use wxGlade it may be faster to make the program with wxPython.", "At a minimum, you can use wxGlade to show a visual representation of the program to a client rather than take the time to hand-code the \"dummy\" program."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["There doesnt exist an easy to use gui creator for Python, That's amazing really considering small scripting languages like AutoIt and AutoHotkey have great and very simple to use gui makers, Come on Python followers cant you do better?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]