[[{"text": ["I was a PHP dev for about 5 years before switching to Python almost exclusively a year ago.", "The experience has been a mostly positive one; I'll answer your questions but also list a few gotchas I ran into."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Here are a few of the gotchas to be aware of:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This is a broad topic with much, much more to say, but I hope this was helpful."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["disclaimer: I never really moved from php."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "moved from", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Well, I started with PHP, and have delved into Python recently.", "I wouldn't say that I've \"moved to\", but I do use both (still PHP more, but a fair bit of Python as well)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I wouldn't say that I have more \"fun\" with Python.", "There are a lot of really cool and easy things that I really wish I could take to PHP.", "So I guess it could be considered \"fun\".", "But I still enjoy PHP, so..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'm more productive with PHP.", "I know PHP inside and out.", "I know most of the little nuances involved in writing effective PHP code.", "I don't know Python that well (I've maybe written 5k lines of Python)...", "I know enough to do what I need to, but not nearly as in-depth as PHP. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I wanted to try something new.", "I never liked Python, but then one day I decided to learn the basics, and that changed my views on it.", "Now I really like some parts (and can see how it influences what PHP I write)..."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I am still doing PHP projects.", "It's my best language.", "And IMHO it's better than Python at some web tasks (like high traffic sites).", "PHP has a built in multi-threaded FastCGI listener.", "Python you need to find one (there are a bunch out there).", "But in my benchmarks, Python was never able to get anywhere near as as fast as PHP with FastCGI (The best Py performed it was 25% slower than PHP.", "The worst was several hundered times, depending on the FCGI library).", "But that's based on my experience (which admittedly isn't much).", "I know PHP, so I feel more comfortable committing a large site to it than I would PY..."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I'll try my best to answer your questions as best I can:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I really enjoy how minimalist python is, having modules with non-redundant naming conventions is really nice.", "I found this to be especially convenient when reading/debugging other peoples code.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I also love all of the python tricks to do some very elegant things in a single line of code such as list comprehensions and the itertools library.  "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I tend to develop my applications using mod_wsgi and it took some time to wrap my head around writing thread-safe web applications, but it was really worth it.  "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I also find unicode to be much less frustrating with python especially with python 3k."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["For simple websites python can be less fun to setup and use.", "One nice feature of PHP that I miss with python is mixing PHP and HTML in the same file.", "Python has a lot of nice template languages that make this easy as well, but they have to be installed.  "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I became frustrated with a lot of the little nuances of PHP such as strange integer and string conversions and so forth.", "I also started to feel that PHP was getting very bloated with a lot of methods with inconsistent naming schemes.", "I was referring to the PHP documentation quite frequently despite having a large portion of the php library memorized."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["I would develop a PHP project again, it has a lot of nice features and a great community.", "Plus I have a lot of experience with PHP.", "I'd prefer to use python, but if the client wants PHP I'm not going to force something they don't want."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Last year I switched job to get away from PHP and work in Python.", "I'm very much satisfied with the decision I made :)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To answer the individual questions:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Yes!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["More productive I'd say.", "But the overall increased experience in programming also had something to with that."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["You are not expected to be a jack of all trades in non-PHP jobs.", "(Photoshop/Web Design/Flash is required for many PHP jobs, and I hate Flash).", "And I liked Python/Django a lot."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "hate", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["If it's small stuff that's better done without any framework, then yes."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I run a self-developed private social site for 100+ users.", "Python was absolutely fantastic for making and running this."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Most definitely."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Mostly yes.", "Python coding style, at least for me is so much quicker and easier.", "But python does sometimes lack in included libraries and documentation over PHP.", "(But PHP seems second to none in that reguard).", "Also requires a tad more to get running under apache."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Easier to manage code, and quicker development (A good IDE helps there, I use WingIDE for python), as well as improving my python skills for when I switch to non-web based projects."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Perhaps if I were working on a large scale professional project.", "PHP is so ubiquitous on the web A company would have a much easier time finding a replacement PHP programmer."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I've never really worked with PHP (nothing major) and come from the .NET world.", "The project I am currently on requires a lot of Python work and I must say I love it.", "Very easy and \"cool\" language, ie.", "FUN!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": [".NET will always be my wife but Python is my mistress ;)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Yes.", "Lot more."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["No.", "I think more."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Django."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Only if it is required."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "required", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}]]