[[{"text": ["My motto is (and has long been) \"Python where I can, C++ where I must\" (one day I'll find opportunity to actually use Java, C#, &amp;c &amp;C, in a real-world project, but I haven't yet, except for a pilot project in Java 1.1, more tha ten years ago...;-) -- Javascript (with dojo) when code has to run in the client's browser, and SQL when it has to run in the DB server, of course, but C++ and Python are my daily bread on the \"normal\" servers and clients I develop, and that's the case in all parts of Google I've been working in in 4+ years (there are many parts using Java, too, I just never happened to work there;-).", "Hmmm, there's pure C when I'm working on the Python core and related extensions, too, of course;-)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Neither Python nor C++ are \"strictly OO\" -- they're multi-paradigm, and therein lies a good part of their strength in the hands of programmers who are highly skilled at OO and other paradigms, such as functional, generic, declarative, and so forth.", "I gather C# has pulled in some of each of these too (sometimes surpassing C++, e.g.", "by offering lambdas), and even Java has had to succumb to some (at least generic) to a tiny extent, so surely it's clear that \"one size fits all\" doesn't -- multi-paradigm programming is alive and well!-)"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "and", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "doesn't", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["C++ (like C) forces me to control all memory carefully (our internal c++ style guide forbids the use of \"smart pointers\" that amount to poor implementations of garbage collection!-), which multiplies my work a lot, but helps ensure I'm not using one bit of memory more than strictly needed at any time: so, C++ (or C when needed) is the choice when memory is tight and precious.", "Otherwise, the extremely high productivity of Python (and Ruby or Javascript aren't all that different, if that's what you are used to) makes it preferable."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I'm sure there IS a niche in-between for a language that's garbage collected but mostly static, like Java (or C# before it started piling on more and more features, including dynamic ones in 4.0, I hear), or else those languages and cognate ones wouldn't be so widespread -- I've just never found myself inhabiting that peculiar niche, as yet."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I select Python as often as possible.", "It is the most useful and productive programming environment that I know of."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If I run into projects where Python cannot be used directly or for the entire project (for instance a .NET-based app.", "server) my approach is usually to do as much with Python as possible.", "Depending on the situation that might mean:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "Embed a python interpreter", "tag": "none", "senID": 2}, {"text": "Use Jython", "tag": "none", "senID": 3}, {"text": "Use IronPython", "tag": "none", "senID": 4}, {"text": "Use some IPC mechanism (usually http or sockets) to call an external python process", "tag": "none", "senID": 5}, {"text": "Export data - process using python - import data", "tag": "none", "senID": 6}, {"text": "Generate code using Python", "tag": "none", "senID": 7}]}, {"text": ["From my answer to a previous question: I know C#.", "Will I be more productive with Python?"], "childNum": 2, "tag": "p", "senID": 8, "childList": [{"text": "my answer", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/819056/i-know-c-will-i-be-more-productive-with-python/824064#824064"}, {"text": "I know C#. Will I be more productive with Python?", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/819056/i-know-c-will-i-be-more-productive-with-python"}]}, {"tag": "hr", "senID": 9}, {"text": ["In my experience, what makes me more productive in Python vs. C#, is:"], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "It is a dynamic language. Using a dynamic language often allows you to remove whole architectural layers from your app. Pythons dynamic nature allows you to create reusable high-level abstractions in more natural and flexible (syntax-wise) way than you can in C#.", "tag": "none", "senID": 11}, {"text": "Libraries. The standard libraries and a lot of the open-source libraries provided by the community are of high quality. The range of applications that Python is used for means that the range of libraries is wide.", "tag": "none", "senID": 12}, {"text": "Faster development cycle. No compile step means I can test changes faster. For instance, when developing a web app, the dev server detects changes and reloads the app when the files are saved. Running a unit test from within my editor is just a keystroke away, and executes instantaneously.", "tag": "none", "senID": 13}, {"text": "'Easy access' to often-used features: lists, list comprehensions, generators, tuples etc.", "tag": "none", "senID": 14}, {"text": "Less verbose syntax. You can create a WSGI-based Python web framework in fewer lines of code than your typical .NET ", "tag": "none", "senID": 15}, {"text": "Good documentation. Good books.", "tag": "none", "senID": 16}]}, {"tag": "hr", "senID": 17}], [{"text": ["I almost exclusively use Python to support my development of software in other languages.", "I should stress, this is not a result of some failing in Python, rather that the software domains I am working in tend to have other languages/frameworks that are more appropriate or simply the only option:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "Web Development : I would love to check out Python on Google App Engine, but at the moment I am doing all my personal web development in PHP.", "tag": "none", "senID": 1}, {"text": "Desktop Application Development : I use the ", "tag": "none", "senID": 2}, {"text": "Server Application Development : Writing server side software for Windows professionally is almost always in C++.", "tag": "none", "senID": 3}]}, {"text": ["However, for all of these application domains I use Python regularly write tools, process data and generally to streamline my development efforts.", "A few examples here are probably the best way to describe how I tend to use Python:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "To ", "tag": "none", "senID": 5}, {"text": ["Generate reports"], "childNum": 0, "tag": "a", "senID": 6, "childList": []}, {"text": "Generate sets of SQL queries to populate databases based on other data formats.", "tag": "none", "senID": 7}, {"text": "Parse entire C++ projects and pull out a distinct set of error messages and their corresponding error codes.", "tag": "none", "senID": 8}, {"text": ["Compare"], "childNum": 0, "tag": "a", "senID": 9, "childList": []}, {"text": ["Image processing"], "childNum": 0, "tag": "a", "senID": 10, "childList": []}]}, {"text": ["Python is such an empowering and useful language that although I have never used it as the primary language for software development, I would like to."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}], [{"text": ["JavaScript and Python have affected how I program even in C now.", "I think the best thing about knowing multiple languages is that you get more tools to use mentally, because you often don't have a choice of which language to use."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Python is much more strictly OO than Java and C#."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But if your question is when to use Python and when Java or C#, I find Python useful for small programs that build on existing libraries and don't involve much domain modelling.", "For example, little desktop utilities written with the Python Gtk bindings or website maintenance scripts written with lxml and elementtree."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["When there is a lot of application domain modelling to do, especially if the domain is poorly understood or changing rapidly, I find Python's limited tooling makes changing the code very arduous compared to Java (not so relevant for C# because .NET tool support trails Java by a few years).", "So for projects like that I'll use Java and IntelliJ. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Both C and python are my languages of choice, but I almost always start doing something in python for correctness, and then dive into C when needed.", "I am mostly using programming for research/numerical code, where the specifications keep changing, and C is an awful language for prototyping (this is true for most statically typed languages in my experience).", "When you have something working in C, you rarely change it significantly so that it is 'better', because you don't have the time.", "But sometimes, C is easier than python when you need to control resources (be it CPU, memory, etc...)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So the question really is \"when is python not enough for the task\", rather than the contrary."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Generally the language is dictated by the job, who wants the stuff done and who you are working with.", "I only use java and c/c++ for my programming needs, mainly because the people i work with use it.", "That being said ive used python for fast prototyping and such."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["All of them. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "All", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Except for code that is already written in different language, obviously."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Even if something seems too big for python to handle, I usually make Python prototype anyway, mainly because it's goes so smooth.", "Often I'll stick with Python eitherway and just use C API or ctypes to tackle bottlenecks (after I rewrite the prototype in a nice clean manner, that is)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]