[[{"text": ["Unicode strings in Python are stored internally either as UCS-2 (fixed-length 16-bit representation, almost the same as UTF-16) or UCS-4/UTF-32 (fixed-length 32-bit representation).", "It's a compile-time option; on Windows it's always UTF-16 whilst many Linux distributions set UTF-32 (‘wide mode’) for their versions of Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You are generally not supposed to care: you will see Unicode code-points as single elements in your strings and you won't know whether they're stored as two or four bytes.", "If you're in a UTF-16 build and you need to handle characters outside the Basic Multilingual Plane you'll be Doing It Wrong, but that's still very rare, and users who really need the extra characters should be compiling wide builds."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Yes, it's quite wrong.", "To be fair I think that tutorial is rather old; it probably pre-dates wide Unicode strings, if not Unicode 3.1 (the version that introduced characters outside the Basic Multilingual Plane)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["There is an additional source of confusion stemming from Windows's habit of using the term “Unicode” to mean, specifically, the UTF-16LE encoding that NT uses internally.", "People from Microsoftland may often copy this somewhat misleading habit."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Meanwhile, I did a refined research to verify what the internal representation in Python is, and also what its limits are.", "\"The Truth About Unicode In Python\" is a very good article which cites directly from the Python developers.", "Apparently, internal representation is either UCS-2 or UCS-4 depending on a compile-time switch.", "So Jon, it's not UTF-16, but your answer put me on the right track anyway, thanks."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "The Truth About Unicode In Python", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.cmlenz.net/archives/2008/07/the-truth-about-unicode-in-python"}]}], [{"text": ["This is a nice slideshow about how to use unicode with python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "slideshow", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://farmdev.com/talks/unicode/"}]}], [{"text": ["Python stores Unicode as UTF-16.", "str() will return the UTF-8 representation of the UTF-16 string."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["From Wikipedia on UTF-8: "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Wikipedia on UTF-8", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/UTF-8"}]}, {"text": ["So, it's anywhere between one and four bytes depending on which character you wish to represent within the realm of Unicode."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["From Wikipedia on Unicode:"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "From Wikipedia on Unicode:", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Unicode"}]}, {"text": ["So it's able to represent most (but not all) of the world's writing systems. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I hope this helps :)"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Python 'knows' that your string is Unicode.", "Hence if you do regex on it, it will know which is character and which is not etc, which is really helpful.", "If you did a strlen it will also give the correct result.", "As an example if you did string count on Hello, you will get 5 (even if it's Unicode).", "But if you did a string count of a foreign word and that string was not a Unicode string than you will have much larger result.", "Pythong uses the information form the Unicode Character Database to identify each character in the Unicode String.", "Hope that helps. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]