[[{"text": ["Coming from the django world, I'd recommend using a third party app such as django-cms and mezzanine.", "Although, the framework is very much dependent to its authentication framework so instead of implementing your own, I suggest taking advantage of this and customize it based on your needs."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "django-cms", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://www.django-cms.org/"}, {"text": "mezzanine", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://mezzanine.jupo.org/"}]}], [{"text": ["+1 for mezzanine.", "I have done quite a bit of work with mezzanine and you can have custom templates on a per slug basis http://mezzanine.jupo.org/docs/content-architecture.html#page-templates and add special logic through page processors http://mezzanine.jupo.org/docs/content-architecture.html#page-processors (I've submitted a pull request which would allow them to be specified on a per slug basis as well, right now you can specify them based on custom models which inherit from mezzanine's page model)."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "http://mezzanine.jupo.org/docs/content-architecture.html#page-templates", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://mezzanine.jupo.org/docs/content-architecture.html#page-templates"}, {"href": "http://mezzanine.jupo.org/docs/content-architecture.html#page-processors", "text": "http://mezzanine.jupo.org/docs/content-architecture.html#page-processors", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["What this means is you could go into the admin, create a page called random page, and then create a template called random-page.html and random page will be rendered using your new template rather than the default.", "If my patch is accepted then you could also create a file called page_processors.py, use a decorator giving it the slug random-page and write custom code implementing form processing or whatever."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In my experience it is very extensible and quite easy to work with and understand as well as having good docs at mezzanine.jupo.org/docs"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["my 2 cents"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["If you are comfortable with hands-on programming, use Drupal.", "It is one of the, if not the most powerful, configurable and tested CMS around."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There are lots of CMSs' available out there and most of them are good also but the three that always stand out are Drupal, Joomla and Wordpress.", "Joomla and wordpress are easier to configure but not as customizable as Drupal is."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Cake php is  nice php framework which you can quickly use build a custom CMS.", "It is also quite similar to django in its setup.", "An added bonus with it is that it has caching implemented from the start.", "It uses a MVC structure, so it very easy to get your head around."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Cake php", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://cakephp.org"}]}, {"text": ["If you know and are comfortable using django then why not stick with that?", "as django is perfect for all your requirements."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Two highly versatile and configurable CMSs I have used:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["Wolf CMS"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": ["Symphony CMS"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}]}, {"text": ["So, neither Python-based, and Symphony requires getting up to speed with XML/XSLT.", "Both tick all your boxes and put a fair bit of power into developer's hands."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Several fine suggestions already."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Django is definitely fairly hands-on, but if you go the Django route give Pinax a look, http://pinaxproject.com/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://pinaxproject.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pinaxproject.com/"}]}, {"text": ["Pinax combines many apps together to give you a lot of functionality right out of the box.", "Since it's still Django under the hood, you can still customize it as much as you want."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]