[[{"text": ["SICP is so much more than learning a programming language, it's about fundamentals like language design and elemental program design.", "Scheme is crucial to this, as its simplicity is essential as a platform for language implementation and experimentation."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["While Python is an excellent choice as a language itself, it's an order of magnitude more difficult to implement a Python interpreter or compiler than it is with Scheme.", "So the debate shouldn't be Python vs. Scheme as a practical language, it should be Scheme vs.", "Anything as a suitable language for learning about languages themselves, and to my mind there is no better choice."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Fortunately we can get a glimpse of 6.001 and SICP on the web ([1], [2]), but the world can only become intellectually poorer if universities start handing out fish instead of teaching people how to fish (or how to conjure up their own superfish."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["(1) http://mitpress.mit.edu/sicp/ \n(2) http://groups.csail.mit.edu/mac/classes/6.001/abelson-sussman-lectures/"], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "http://mitpress.mit.edu/sicp/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mitpress.mit.edu/sicp/"}, {"href": "http://groups.csail.mit.edu/mac/classes/6.001/abelson-sussman-lectures/", "text": "http://groups.csail.mit.edu/mac/classes/6.001/abelson-sussman-lectures/", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["I was taught Scheme as part of my introduction course at University (ITCR, heh) and, as probably as \"uninteresting\" or \"useless\" as Scheme might be considered nowadays, I thought starting with that was a pretty fascinating idea and was pretty useful as a way to introduce useful terms and concepts in functional languages and programming in general.", "Curiously, as soon as I was done with the course, subsequent semesters started to use Python along with Scheme, probably to make a gradual transition into Python-only.", "It's not necessarily a shame, but losing a functional language as the first before going into OOP and other concepts seems like a lose to me.", "Python is used in many other courses anyway."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "ITCR", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.itcr.ac.cr/"}]}], [{"text": ["Abelson and Sussman's goal is to teach students about computation; not to promote Scheme."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Using Python is an experiment in teaching, and it is very much in the spirit of Scheme!", ":)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["SICP will always be a classic, that will never change."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'm sure that MIT teaches a functional language later on in their curriculum.", "To do otherwise would be to leave the functional side of lots of more advanced computer science topics out in the cold, as an introductory course can only touch on so much.", "Python has some functional elements in it, like lambda functions and it even has a map function!", "I attend Carnegie Mellon and we don't hit on a functional language (Standard ML) until typically sophomore year.", "So all is not lost..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["At my uni (UQ) I was in the second last group of students to go through a subject that was practically 6.001.", "I enjoyed it as it was something I'd never encountered before.", "I'm largely undecided about the whole switch.", "It's a shame because it was advantageous to know, but Python will (arguably) be more \"practical\" in industry"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I totally agree with matt curtis  , i feeel almost all of computer science basics (or complexity basics) are covered in SICP."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["someone may argue about the rationale Prof GJS put forward ..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["http://john-conti.com/gin/1097/controversy-in-the-glass-palace-of-nerds/"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://john-conti.com/gin/1097/controversy-in-the-glass-palace-of-nerds/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://john-conti.com/gin/1097/controversy-in-the-glass-palace-of-nerds/"}]}, {"text": ["in any case it's sad that such legendary course had come to an end."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]