[[{"text": ["I'll tell you how I've improved my productivity with Python on Windows.", "I just try to write everything in Python - every application I need, unless I know it won't scale and I'll need more efficient tools (in which case I personally use C++, but you could also use C#/Delphi). "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It turns out that for most (> 95%) of the tools and utilities are need, Python (coupled with PyQt for the GUI) is good enough, and it's a much more productive language for me than C++.", "The key is stop thinking of Python as a \"scripting language\".", "It is no less a programming language than C++/Java/C#/Delphi/what say you.", "It has it strengths, and it has its limitations.", "As long as you're aware of them and know how to pick the appropriate tool for the job, you'll do just fine."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You don't need any special IDE.", "I use Scite for all my Python coding (on Windows and Linux, by the way), and it works great."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "Scite", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.scintilla.org/SciTE.html"}, {"text": "and", "childNum": 0, "tag": "em", "childList": []}]}], [], [{"text": ["Scripting languages can be very powerful.", "Here's how I believe Lua improves my productivity:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Lua", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://lua.org/"}]}, {"tag": "ul", "num": 2, "lis": [{"text": ["The central data is the associative array (mutable hash table).", "Lua's implementation is extraordinarily efficient and serves well as hash, table, set, and list."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The string processing sits in an excellent sweet spot: almost as powerful as regular expressions, and a lot more readable.", "The pattern escape character % is different from the string escape char \\.", "Lua's \"pattern with capture\" is simpler than POSIX regexps and much simpler than Perl regexps, and it meets 90% of my string scanning needs.", "A superb example of engineering design."], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "%", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "\\", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "much", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}]}, {"text": ["These two features cover the major data.", "On top of this,"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 8, "lis": [{"text": ["The table is the only mutable type, making programs easier to reason about."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Lua has first-class, nested functions, so all the power of the functional paradigm is available if you need it&mdash;but if you don't use it, you don't pay."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Lua has a built-in iteration construct, native to the language, which is suitable for iterating over collections, filesystems, you name it.", "Much better than having some \"iterator object\" with \"iterator methods\".", "Iteration is sufficiently important that I benefit greatly from having a language construct devoted to it (the generic for loop)."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "for", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["The language is simple enough that after modest study, I understand all of it."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "all", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["There is a lightning-fast interactive implementation."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["At need, I can import any existing C library into Lua."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["The standard Lua libraries meet most of my needs while remaining small enough to be comprehensible.", "If I need a special purpose library (XML, HTTP, parsing), it is generally already available and easy enough to understand."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["Again at need, I can readily extend with my own data types."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}]}, {"text": ["I find that I am using Lua for all the tasks I used to get done with sh, awk, sed, perl, and that crowd.", "I also find that 90% of the time I can write a simple, useful Lua program much more quickly than a simple, useful C program.", "(The other 10% is when I'm mostly making system calls."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["Although I've lost count of the number of languages I know well (over 10,000 lines of code written), these days almost all of my needs are met by just 3:"], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Lua for almost all lightweight programs, including the quick-and-dirty string/file processing that you mention"], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"text": ["C for teaching (because I must teach C)"], "childNum": 0, "tag": "p", "senID": 15, "childList": []}, {"text": ["Haskell for prototyping (and sometimes implementing) sophisticated or large systems, especially compilers"], "childNum": 0, "tag": "p", "senID": 16, "childList": []}]}, {"text": ["I've also used a mix of Lua and C for some fairly substantial applications, like nbibtex and noweb 3."], "childNum": 2, "tag": "p", "senID": 17, "childList": [{"text": "nbibtex", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cs.tufts.edu/~nr/nbibtex/"}, {"href": "http://www.cs.tufts.edu/~nr/noweb/why3.html", "text": "noweb 3", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["The short answer would be, you can do many many things with scripting languages - but you can still call it programming or software development."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But, answering your questions, what i find the most helpful in my work, to increase my productivity, is lots of shell/perl/python scripts."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think the most common use of scripts are various kinds of reports (in a broad sense),\nsay having a logfile and wanting to retrieve certain information (or some sort of statistics), script can help you to achieve that in very short time."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Some hint keywords for you: shell scripting, regular expressions, output formatting."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Thanks"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["So you probably got the picture already, you'll perform certain tasks lot quicker using scripting language (and regarding the word scripting: I just don't consider it derogatory anymore, quite the contrary).", "Hell, I have some friends (accidentally Delphi-only programmers) still using Delphi to perform some one-time tasks, searching in text files etc, spending hours writing Delphi classes and forms, compiling over and over again, instead of couple of minutes writing Python/Ruby/Perl one-liners."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "scripting", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["But I think there's even more important thing to it (given the right choice): you will learn new programming concepts.", "You will grow as a programmer.", "You will outgrow that old \"you got the hammer, so everything looks like a nail\" point of view.", "You will learn how to breathe again."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "you will learn new programming concepts", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["BTW, when I say \"given the right choice\", I strongly advice choosing a properly devised language with powerful functional programming concepts.", "So I'd really skip PHP and go for either Python or Ruby."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["So, I have frequently been using Python to prototype solutions to various programming tasks (it's good to get the algorithm right before implementing with all the bells and whistles in some other programming language), and I have been using BASH shell scripting to automate a variety of tasks (e.g.", "running a program over multiple differents sets of input, saving the results, piping to grep and other utilities, etc.", ")."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["When it comes to tedium, really I would strongly recommend BASH.", "You can get it on Windows by installing Cygwin.", "For example, I frequently find myself doing things like the following for my various courses:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\nfor i in {1..10} ; do\n    ./process_data input-$i.txt | tee result-$i.transcript\ndone\n</pre>\n", "senID": 2}, {"text": ["You don't need a good editor... any text editor will do just fine.", "That said, if you are looking for a good Python editor, Eclipse with PyDev is pretty good.", "Personally, I just use Xcode as a general purpose code editor for everything... even though it doesn't really bring anything to the table for Python or BASH shell scripts... of course, you don't have Xcode on Windows.", "However, you can use Notepad++, Notepad, or Wordpad."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["As a 50/50 windows/linux user at work, python is especially useful, since nearly everything I write is cross-platform, and also because windows doesn't really have a very useful shell language.", "With pyqt, I can create a pretty impressive GUI in just a few hours.", "I'm fairly certain than in the next few years, python will take over the world."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["i'm TextMate user and actively develop extensions (\"bundles\") for it for my own use in php, ruby and javascript. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "TextMate", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://macromates.com/"}]}], [{"text": ["I use scripting languages to do a lot of pre/post processing of data.", "Small or large."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Nearly all scripting languages have superb/fast file, text, graphic, etc.", "handling.", "And very very easy without masses of boiler plate code and the compilation step."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And as someone mentioned, you'll be flexing your muscles and learning a new world of possibilities."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I jump from one scripting language to another, sometimes mix them up, just to get what I want done faster.", "Makes me fearless knowing that you can do most anything you can think.", "If you can't then there's always stackoverflow and the more languages (the language-agnostic tag) you can accept for a solution the faster (and better usually) you'll get one."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]