[[{"text": ["Since the coffee pot position is stationary, get a sample frame and locate a single column of pixels where the minimum and maximum coffee quantities can easily be seen, in a spot where there are no reflections.", "Check the green vertical line segment in the following picture:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "single", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"senID": 1}, {"text": ["The easiest way is to have two frames, one with the pot empty, one with the pot full (obviously under the same lighting conditions, which typically would be the case), convert to grayscale (colorsys.rgb_to_hsv each RGB pixel and keep only the v (3rd) component) and sum the luminosity of all pixels in the chosen line segment.", "Let's say the pot-empty case reaches a sum of 550 and the pot-full case a sum of 220 (coffee is dark).", "By comparing an input frame sum to these two sums, you can have a rough estimate of the percentage of coffee in the pot."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "colorsys.rgb_to_hsv", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "v", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["I wouldn't bet my life on the accuracy of this method, though, and the fluctuations even from second to second might be wild :)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["N.B: in my example, the green column of pixels should extend to the bottom of the pot; I just provided an example of what I meant."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["First do thresholding, then segmentation.", "Then you can more easily detect edges."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Steps that I'd try:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You're looking for edge detection.", "But you only need to do it between the brown/black of the coffee and the color of the background behind the pot."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "edge detection", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Edge_detection"}]}], [{"text": ["There is the Python Image Library which can do edge detection.", "But I'm not a Python user :)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python Image Library", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pythonware.com/products/pil/"}]}], [{"text": ["You should turn this question into a school assignment for an IT student.", "Most IT schools teach Computer Vision.", "Asking the question here is funny, getting a student and a teacher researching the subject would be hilarious!"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Computer Vision", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://cved.org/"}]}], [{"tag": "ul", "num": 5, "lis": [{"text": "make pictures of the pot with different levels of coffe in it.", "tag": "none", "senID": 0}, {"text": "downsample the image to maybe 4*10 pixels.", "tag": "none", "senID": 1}, {"text": "make the same in a loop for each new live picture.", "tag": "none", "senID": 2}, {"text": "calculate the difference of each pixels value compared to the reference images.", "tag": "none", "senID": 3}, {"text": "take the reference image with the least difference sum and you get the state of your coffe machine.", "tag": "none", "senID": 4}]}, {"text": ["you might experiment if a grayscale version or only red or green might give better results."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["if it gives problems with different light settings this aproach is useless.", "just buy a spotlight for the coffe machine, or lighten up, or darken each picture till the sum of all pixels reaches a reference value."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]]