[[{"text": ["I'd say it depends on your target audience.", "For enterprise stuff I think RedHat (certainly CentOS 5) are still on 2.4 - so if you want typical RedHat/CentOS using people to able to install without resorting to third party python installations then I think you need to keep 2.4 for a while.", "If most of your users are more 'desktop' based running Fedora/Ubuntu then they probably have 2.5/2.6 already so it wouldn't be an issue for them."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You don't have to drop support for 2.4 in order to add support for 3.x, as I'm sure you know.", "I've made coverage.py run on 2.3 through 3.1 with the same code.", "It's not always pretty, but it's possible: Running the same code on Python 2.x and 3.x."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "have", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "Running the same code on Python 2.x and 3.x", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://nedbatchelder.com/blog/200910/running%5Fthe%5Fsame%5Fcode%5Fon%5Fpython%5F2x%5Fand%5F3x.html"}]}], [{"text": ["It's a matter of weighing pros and cons."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I suppose the real answer to this question is how many features there are in 2.5/2.6 that would really improve your library.", "It seems as though 2.4 becomes less and less worth supporting as time goes by.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["On the other hand, there are still some people on Python 2.4.", "You have to decide if it's worth it to drop support for them to take advantage of newer features of Python 2.5."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "are", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["You don't have to drop anything, what works on 2.4, works on 2.5 and 2.6.", "You can easily avoid incompatibilities skipping \"with\", the ternary operation, et \"import future\"."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "future", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["Now, once you have a very stable and full featured version of your code and need to make a big achitectural change, start writting for Python 3.0.", "No rush, it won't be massively used before one year or two."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["A good indicator is to focus on project that have the same audience as yours.", "When do they switch on the roadmap ? "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "GNOME ?", "tag": "none", "senID": 3}, {"text": "Django ?", "tag": "none", "senID": 4}, {"text": "Inkscape ?", "tag": "none", "senID": 5}]}], [{"text": ["Track downloads of each version of your project.", "Graph the daily traffic (or weekly if there is too much variation day to day) for each version separately.", "Keep an eye on the trends and at some point you will see a distinctly downward trend for 2.4 compared to the rest.", "When that downward trend is well established, discontinue upgrades to the 2.4 version, but keep it available for download.", "You should include some kind of note in the README for the last 2.4 version, and maybe display a message when it is installed."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["At this point, your work is done, unless you find some really glaring error that you want to fix.", "You don't ever have to actually discontinue the 2.4 version, just cease upgrading it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And the graphs that you now produce every week will tell you when it is time to do the same for 2.5, and eventually 2.6."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Any answer here is going to be subjective.", "I suggest you make a feature and user list.", "There are 2 things to consider here."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["1: How will your program benefit - what features are better nicer/faster/less buggy in newer versions of Python ?", "What extra dependent libraries can your program utilize by sticking to an older version ?", "Not everything is ported to 3.x or even 2.5 yet."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["2: How will your user benefit - What benefits do users gain from older versions.", "How much bigger / smaller does your user base get by dropping 2.4 and adding 3.x ?", "What does your user base look like currently."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The third is not really a point since direct benefit from Open Source to developers is kinda iffy - but what do you gain ?", "i.e.", "less time needed to maintain, faster development etc."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Hope making a summary will help you put things in perspective."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]