[[{"text": ["Using dynamic languages will teach you something about static languages: all the help you got from the static language that you now miss in the dynamic language, it wasn't all that helpful."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To use your example, in a static language, you'd know that the parameter was a string, and in Python you don't.", "So in Python you write a docstring.", "And while you're writing it, you realize you had more to say about it than, \"it's a string\".", "You need to say what data is in the string, and what format it should have, and what the default is, and something about error conditions.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And then you realize you should have written all that down for your static language as well.", "Sure, Java would force you know that it was a string, but there's all these other details that need to be specified, and you have to manually do that work in any language."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The docstring conventions are at PEP 257. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PEP 257", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://ftp.python.org/dev/peps/pep-0257/"}]}, {"text": ["The example there follows this format for specifying arguments, you can add the types if they matter:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n def complex(real=0.0, imag=0.0):\n    \"\"\"Form a complex number.\n\n    Keyword arguments:\n    real -- the real part (default 0.0)\n    imag -- the imaginary part (default 0.0)\n\n    \"\"\"\n    if imag == 0.0 and real == 0.0: return complex_zero\n    ...\n</code>\n</pre>\n", "senID": 2}, {"text": ["There was also a rejected PEP for docstrings for attributes ( rather than constructor arguments ). "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The most pythonic solution is to document with examples.", "If possible, state what operations an object must support to be acceptable, rather than a specific type."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class Host(object):\n  def __init__(self, name, network_interface)\n    \"\"\"Initialise host with given name and network_interface.\n\n    network_interface -- must support the same operations as NetworkInterface\n\n    &gt;&gt;&gt; network_interface = NetworkInterface()\n    &gt;&gt;&gt; host = Host(\"my_host\", network_interface)\n\n    \"\"\"\n    ...\n</code>\n</pre>\n", "senID": 1}, {"text": ["At this point, hook your source up to doctest to make sure your doc examples continue to work in future."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "doctest", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/doctest.html"}]}], [{"text": ["Personally I found very usefull to use pylint to validate my code."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pylint", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.logilab.org/857"}]}, {"text": ["If you follow pylint suggestion almost automatically your code become more readable,\nyou will improve your python writing skills, respect naming conventions.", "You can also define your own naming conventions and so on.", "It's very useful specially for a python beginner."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I suggest you to use."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Python, though not as overtly typed as C or Java, is still typed and will throw exceptions if you're doing things with types that simply do not play nice together."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To that end, if you're concerned about your code being used correctly, maintained correctly, etc.", "simply use docstrings, comments, or even more explicit variable names to indicate what the type should be."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Even better yet, include code that will allow it to handle whichever type it may be passed as long as it yields a usable result."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["One benefit of static typing is that types are a form of documentation.", "When programming in Python, you can document more flexibly and fluently.", "Of course in your example you want to say that network_interface should implement NetworkInterface, but in many cases the type is obvious from the context, variable name, or by convention, and in these cases by omitting the obvious you can produce more readable code.", "Common is to describe the meaning of a parameter and implicitly giving the type."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For example:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n def Bar(foo, count):\n    \"\"\"Bar the foo the given number of times.\"\"\"\n    ...\n</code>\n</pre>\n", "senID": 2}, {"text": ["This describes the function tersely and precisely.", "What foo and bar mean will be obvious from context, and that count is a (positive) integer is implicit."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["For your example, I'd just mention the type in the document string:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n \"\"\"Create a named host on the given NetworkInterface.\"\"\"\n</code>\n</pre>\n", "senID": 5}, {"text": ["This is shorter, more readable, and contains more information than a listing of the types."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "more", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}]]