[[{"text": ["I started web programming 6-7 years ago in Perl, moved on to PHP about 5 years ago, and started using Python/Django within the last year.", "So, quite obviously, I am a LAMP guy through and through, and I avoid Microsoft technologies at all costs (which I'm trying to stop doing, but hell may freeze first)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["One of the biggest pluses of PHP is the lighting fast turn-around time on simple projects.", "The bad rep PHP gets is mostly due to the masses of inexperienced programmers that pick up the language and throw around poor excuse for code into the web.", "That being said, it is entirely possible to be disciplined and write excellent PHP code.", "There are also many frameworks out there to help you achieve this goal, such as CodeIgniter and CakePHP. "], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "CodeIgniter", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://codeigniter.com/"}, {"href": "http://cakephp.org/", "text": "CakePHP", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["As far as Python/Django, I am currently drinking the kool-aid as I started using it just recently.", "Personally it is not quite as easy to get started as PHP, but things like the generated Admin and the model API are pretty neat.", "Although I have a background in C-style languages, I also find the indentation to be pretty refreshing and it is not nearly as bad as some people make it out to be."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["All this being said, there really is no wrong choice.", "They are all just tools to achieve the same end result, and you can churn out quality web applications in all of them.", "I would personally recommend Python/Django, but this is all very subjective."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The first thing you should consider is whether you're more comfortable using Windows or Linux (or some derivative thereof, including MacOS X).", "That will certainly limit your options."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Though most Web technologies crossover to both platforms, there is more support on their native platform.", "An exception to this would perhaps be Java."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you're looking to get into .NET, then you should be comfortable with Windows."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you're looking to get into Python or Perl, then you should be comfortable with Linux (or Unix or a derivative)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["PHP could go both ways, but I see at as more of a *nix native."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The same consideration would apply to database systems.", "MSSQL is well-proven and has a lot of support, but is more expensive in terms of licensing (and hosting) than say MySQL (*nix native), although SQLExpress (MSSQL derivative) is free and works well for non-enterprise applications.", "However, MSSQL will not cross-over to *nix platforms, while MySQL enjoys cross relatively good cross-platform support."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["You can make a go of ANY of those technologies.", "You can write GREAT code in any of them and you can write CRAP code in any of them."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The difference will be how much time and effort you put into really learning them and studying not just the language, but best practices."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As for me, I have worked with Java, Perl, PHP, and .Net.", "My personal preference is for .Net because of the breadth of areas I can use it.", "I can use one language (C#) and hit everything from web to mobile devices.", "My current areas of interest/study are MVC and Silverlight.", "As a USER I've never been fond of AJAX.", "For most sites that offer an opt out, I switch to old-fashioned HTML.", "I'm interested in Silverlight 3 and its support for deep linking for RIAs.", "Way back in '98-2000 I worked with RIAs using Java applets on the client talking to a custom multi-threaded appserver I wrote.", "Silverlight and Adobe Flex are becoming what applets should have been."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The value I see on the Microsoft side is that Silverlight, MVC, asp.net, etc.", "all share common languages and APIs.", "If I were to go another route I'd have to work with a bunch of different languages."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["As I said, I have worked with a bunch of technologies over the years and am not religious about my choices.", "They can ALL get the job done.", "Some people like Coke some people like Pepsi.", "Find which stack you like and study the crap out of it.", "Take time occasionally to study some stuff outside your chosen stack to keep your mind open."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I use Microsoft technologies in my job, and I like it, and it's the only thing I could consider myself an expert in (compared to Python and PHP), so I suggest Visual Studio Express, C#, SQL Server Express, and making MSDN your homepage."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "expert", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["You can opt for Web Forms or ASP.NET MVC, plus Silverlight for your RIAs.", ".NET is a great platform for web application development.", "And there's plenty of room for your personal growth (SharePoint, workflows, etc)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Is it the best?", "I don't know.", "But you didn't ask for the best: you asked for expert opinions.", "So there you go."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Personally I like Python/Django.", "C# and ASP.NET &mdash; never really considered it, UNIX and Linux rule the servers. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}, {"text": ["Actually that's not true.", "In this case PHP is victim of it's own popularity.", "Being so popular having pretty low learning curve, you have a lot of amateurs using it.", "Amateurs are prone to poor practice.", "On the other hand you do have professionals working on projects such as for example Facebook.com which is PHP. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I've gone down the GWT, Java and Hibernate route.", "They are difficult technologies, but they certainly aren't tied to any specific OS or database."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If I had to choose again, I'd take a very careful at the market expectations, and the availability of getting experienced programmers.", "If the guys buying it don't like the technologies, or it's hard to find people to continue in the development, those are show-stoppers."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I once had huge trouble trying to sell a big Perl system to enterprise clients that only wanted Java (it didn't help that the database wasn't an RDBMS).", "Great code, and a very sophisticated product, but if people aren't buying it ..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]