[[{"text": ["This is a difficult problem because you either have to reverse engineer the javascript on a per-site basis, or implement a javascript engine and run the scripts (which has its own difficulties and pitfalls)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It's a heavy weight solution, but I've seen people doing this with greasemonkey scripts - allow Firefox to render everything and run the javascript, and then scrape the elements.", "You can even initiate user actions on the page if needed."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["The best solution that I found was to use Firebug to monitor XmlHttpRequests, and then to use a script to resend them."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Adam Davis's advice is solid."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I would additionally suggest that you try to \"reverse-engineer\" what the JavaScript is doing, and instead of trying to scrape the page, you issue the HTTP requests that the JavaScript is issuing and interpret the results yourself (most likely in JSON format, nice and easy to parse).", "This strategy could be anything from trivial to a total nightmare, depending on the complexity of the JavaScript."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The best possibility, of course, would be to convince the website's maintainers to implement a developer-friendly API.", "All the cool kids are doing it these days 8-)  Of course, they might not  want their data scraped in an automated fashion... in which case you can expect a cat-and-mouse game of making their page increasingly difficult to scrape :-("], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Selenium IDE, a tool for testing, is something I've used for a lot of screen-scraping.", "There are a few things it doesn't handle well (Javascript window.alert() and popup windows in general), but it does its work on a page by actually triggering the click events and typing into the text boxes.", "Because the IDE portion runs in Firefox, you don't have to do all of the management of sessions, etc.", "as Firefox takes care of it.", "The IDE records and plays tests back."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It also exports C#, PHP, Java, etc.", "code to build compiled tests/scrapers that are executed on the Selenium server.", "I've done that for more than a few of my Selenium scripts, which makes things like storing the scraped data in a database much easier."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Scripts are fairly simple to write and alter, being made up of things like (\"clickAndWait\",\"submitButton\").", "Worth a look given what you're describing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["There is a bit of a learning curve, but tools like Pamie (Python) or Watir (Ruby) will let you latch into the IE web browser and get at the elements.", "This turns out to be easier than Mechanize and other HTTP level tools since you don't have to emulate the browser, you just ask the browser for the html elements.", "And it's going to be way easier than reverse engineering the Javascript/Ajax calls.", "If needed you can also use tools like beatiful soup in conjunction with Pamie."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["i found the IE Webbrowser control have all kinds of quirks and workarounds that would justify some high quality software to take care of all those inconsistencies, layered around the shvwdoc.dll api and mshtml and provide a framework. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["This seems like it's a pretty common problem.", "I wonder why someone hasn't anyone developed a programmatic browser?", "I'm envisioning a Firefox you can call from the command line with a URL as an argument and it will load the page, run all of the initial page load JS events and save the resulting file."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I mean Firefox, and other browsers already do this, why can't we simply strip off the UI stuff?  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Probably the easiest way is to use IE webbrowser control in C# (or any other language).", "You have access to all the stuff inside browser out of the box + you dont need to care about cookies, SSL and so on."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The first question I have: can you confirm that the site absolutely doesn't work without Javascript?", "You'd be surprised how many sites are still usable if you turn javascript off.", "You'll probably be directed to a slightly different set of urls. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]