[[{"text": ["I favor bundling dependencies, if it's not feasible to use a system for automatic dependency resolution (i.e.", "setuptools), and if you can do it without introducing version conflicts.", "You still have to consider your application and your audience; serious developers or enthusiasts are more likely to want to work with a specific (latest) version of the dependency.", "Bundling stuff in may be annoying for them, since it's not what they expect."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "if", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "if", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["But, especially for end-users of an application, I seriously doubt most people enjoy having to search for dependencies.", "As far as having duplicate copies goes, I would much rather spend an extra 10 milliseconds downloading some additional kilobytes, or spend whatever fraction of a cent on the extra meg of disk space, than spend 10+ minutes searching through websites (which may be down), downloading, installing (which may fail if versions are incompatible), etc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I don't care how many copies of a library I have on my disk, as long as they don't get in each others' way.", "Disk space is really, really cheap."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Can't you just rely on a certain version of those dependencies?", "E.g.", "in Python with setuptools you can specify which exact version it needs or even give some conditions like &lt;= > etc.", "This of course only applies to Python and on the specifc package manager but I would personally always first try not to bundle everything.", "With shipping it as a Python egg you will also have all the dependencies installed automatically. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "setuptools", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://peak.telecommunity.com/DevCenter/setuptools"}]}, {"text": ["You might of course also use a two-way strategy in providing your own package with just links to the dependencies and nevertheless provide a complete setup in some installer like fashion.", "But even then (in the python case) I would suggest to simply bundle the eggs with it. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For some introduction into eggs see this post of mine."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "this post of mine", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mrtopf.de/blog/python%5Fzope/a-small-introduction-to-python-eggs/"}]}, {"text": ["Of course this is very Python specific but I assume that other language might have similar packaging tools."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["For Linux, don't even think about bundling.", "You aren't smarter than the package manager or the packagers, and each distribution takes approach their own way - they won't be happy if you attempt to go your way.", "At best, they won't bother with packaging your app, which isn't great."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Keep in mind that in Linux, dependencies are automatically pulled in for you.", "It's not a matter of making the user get them.", "It's already done for you."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For windows, feel free to bundle, you're on your own there."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you're producing software for an end-user, the goal is to let the customer use your software.", "Anything that stands in the way is counter-productive.", "If they have to download dependencies themselves, there's a possibility that they'll decide to avoid your software instead.", "You can't control whether libraries will be backwards compatible, and you don't want your software to stop working because the user updated their system.", "Similarly, you don't want a customer to install an old version of your software with old libraries and have the rest of the system break. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This means bundling is generally the way to go.", "If you can ensure that your software will install smoothly without bundling dependencies, and that's less work, then that may be a better option.", "It's about what satisfies your customers."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Just my experience, take it with a grain of salt."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My preference for a couple of open-source libraries that I author is for independence from additional libs as much as possible.", "Reason being, not only am I on the hook for distribution of additional libraries along with mine, I'm also obliged to update my application for compatibility as those other libraries are updated as well."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["From the libraries I've used from others that carry dependencies of \"common\" libraries, invariably I end up with requiring multiple versions of the common library on my system.", "The relative update speed of the niche libraries I'm using just isn't that fast, while the common libraries are updated much more often.", "Versioning hell."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["But that's speaking generically.", "If I can aid my project and users NOW by incorporating a dependency, I'm always looking at the downstream and later-date effects of that decision.", "If I can manage it, I can confidently include the dependency."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["As always, your mileage may vary."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I always include all dependancies for my web applications.", "Not only does this make installation simpler, the application remains stable and working the way you expect it to even when other components on the system are upgraded."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Beware reproducing the classic Windows DLL hell.", "By all means minimize the number of dependencies: ideally, just depend on your language and its framework, nothing else, if you can."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["After all, preserving hard disk space is hardly the objective any more, so users need not care about having multiple copies.", "Also, unless you have a minuscule number of users, be sure to take the onus of packaging on yourself rather than requiring them to obtain all dependencies!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["An important point seems to have been forgotten in the Cons of bundling libraries/frameworks/etc with the application: security updates."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Most Web frameworks are full of security holes and require frequent patching.", "Any library, anyway, may have to be upgraded one day or the other for a security bug."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you do not bundle, sysadmins will just upgrade one copy of the library and restart depending applications. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you bundle, sysadmins will probably not even know they have to upgrade something."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "know", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["So, the issue with bundling is not the disk space, it's the risk of letting old and dangerous copies around."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]