[[{"text": ["Python+PyGame is a really great idea for learning SDL."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I wrote a somewhat popular game that way.", "Python/PyGame seems much more advanced than SDL bindings to any other language, and one huge advantage compared to C++ is that don't have to compile code, and with some simple hacking can even modify a running program, and see the feedback live.", "It makes a huge huge difference - like using a GUI vector graphics program vs writing SVG in a text editor.", "Unfortunately you don't get this out of the box, because you need to adapt your program a bit to see it."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "somewhat popular game that way", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://taw.chaosforge.org/jrpg/"}]}, {"text": ["As for other advantages of PyGame, jrpg ran with very small changes on Linux, Windows, and OSX.", "I had to do some tweaks to fullscreen mode switching, and double buffering as there were some differences between OSes, but no recompilation was ever necessary.", "If you have any problems you can get good stack trace and debug your problems live, that's not really possible with C++ once you get a memory corruption or a segfault."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I don't really know how easy or how hard would it be to mix C++ and Python for your SDL games.", "I think it cannot be too hard, as PyGame is a pretty straightforward but very nicely made wrapper for SDL, and Python/C++ mixing is supposed to be easy enough."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["pygame abstracts the SDL interface quite a lot, therefore I don't think there's much of an advantage carried over."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You can learn some techniques, ways to implement game logic etc.", "in SDL-based enviroment but after moving to C++/SDL you will have to use SDL functions directly, helper functions/objects from pyGame will be completely useles."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Yes.", "If python is much more natural to you than C++, it might be a good idea to learn pygame first.", "You'll have to go through a translation process when migrating to using SDL and C, but it should be a more-or-less one-to-one mapping."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Yes", "childNum": 0, "tag": "b", "pos": 0, "childList": []}]}], [{"text": ["Of course.", "You can write a sdl game or tools in really less time."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You can start with this code that display the data/chimp.bmp into a 468x60 screen :"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n import pygame, sys,os\nfrom pygame.locals import * \n\npygame.init() \n\nwindow = pygame.display.set_mode((468, 60)) \npygame.display.set_caption('Monkey Fever') \nscreen = pygame.display.get_surface() \n\nmonkey_head_file_name = os.path.join(\"data\",\"chimp.bmp\")\n\nmonkey_surface = pygame.image.load(monkey_head_file_name)\n\nscreen.blit(monkey_surface, (0,0)) \npygame.display.flip() \n\ndef input(events): \n   for event in events: \n      if event.type == QUIT: \n         sys.exit(0) \n      else: \n         print event \n\nwhile True: \n   input(pygame.event.get())\n</code>\n</pre>\n", "senID": 2}, {"text": ["When you are familiar with SDL objects you can easily move to C++ (if you want again :p Pygame is fast and you can make a complexe game with it)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You could try pyglet If you are targetting at OpenGL.", "It's much better thought out library than what pygame is."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pyglet", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pyglet.org/"}]}, {"text": ["But then, if you want to move to C++ and SDL in future, do it now.", "That way you actually learn SDL.", "But before doing such an irresponsible thing, it'd be perhaps a good idea to check into pyglet first.", "Just because for designing your apps properly in C++ as well no matter how bad your libraries are."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "pyglet", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.pyglet.org/"}]}], [{"text": ["I wouldn't consider Python (or any managed or interpreted language, for that matter) a good way to learn any complex task, because it insulates the programmer from the workings of the system too much.", "As a friend of mine put it, \"Python loves you and wants you to be happy.", "\" And that's all well and good if you already know the fundamentals, but if you want to learn, the last thing you want is a language that does all the work for you."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "learn", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["You'll learn the what very quickly, but not the why, and then when something goes badly wrong, (and it will eventually, in any non-trivial project,) you'll be left with no idea what's happening or why."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["python won't prevent you off learning design and that's pretty much the more important thing to learn IMO, I'm doing a smash bros clone with pygame and I learnt a lot in design.", "And yet you will learn not to write too much suboptimal code too, python have clever and beautiful hacks too."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "design", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}]]