[[{"text": ["I have high hopes for it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["They seem to have their shit together.", "They have a relatively detailed plan for a project at this stage, and they have a list of tests they use to gauge performance improvements and regressions."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'm not holding my breath on GIL removal, but even if they never get around to that, the speed increases alone make it awesome."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'm sorry to disappoint you, but when you read PEP 3146 things look bad."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PEP 3146", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/dev/peps/pep-3146/"}]}, {"text": ["The improvement is by now minimal and therfore the compiler-code gets more complicated.", "Also removing the GIL has many downsides."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Btw.", "PyPy seems to be faster then Unladen Swallow in some tests."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "some tests", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://morepypy.blogspot.com/2010/03/hello.html"}]}], [{"text": ["I think the project has noble goals and with enough time (2-3 years), they will probably reach most of them."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["They may not be able to merge their branch back into the trunk because Guido's current view is that cpython should be a reference implementation (ie.", "it shouldn't do things that are impossible for IronPython and jython to copy.", ")  I've seen reports that this is what kept the cool parts of stackless from being merged into cpython."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["This question discussed many of the same things.", "My opinion is that it sounds great, but I'm waiting to see what it looks like, and how long it takes to become stable."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "This question", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/695370/what-is-llvm-and-how-is-replacing-python-vm-with-llvm-increasing-speeds-5x"}]}, {"text": ["I'm particularly concerned with compatibility with existing code and libraries, and how the library-writing community responds to it.", "Ultimately, aside from personal hobby projects, it's of zero value to me until it can run all my third-party libraries."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Guido just posted an article to his twitter account that is an update to the Jesse Noller article posted earlier.", "http://jessenoller.com/2010/01/06/unladen-swallow-python-3s-best-feature/.", "Sounds like they are moving ahead as previously mentioned with python 3."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://jessenoller.com/2010/01/06/unladen-swallow-python-3s-best-feature/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://jessenoller.com/2010/01/06/unladen-swallow-python-3s-best-feature/"}]}], [{"text": ["They have a quarterly release.", "So not far away, wait and watch, let them come up with some thing more than just a plan."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If it indeed comes to be true, easy to do away with C and C++ even for performance intensive operations."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Even tho' it is a Google sponsored Open Source project, surprisingly doesn't involve Guido anywhere."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I think that a 5 times speed improvement is not all that important for me personally."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It is not an order of magnitude change.", "Although if you consume CPU power at the scale of Google it can be a worth while investment to have some of your staff work on it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Many of the speed improvements will likely make it into cpython eventually."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Getting rid of the GIL is interesting in principle but will likely reveal lots of problems with modules that are not thread safe once the GIL is removed."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I do not think I will use Unladen Swallow any time soon but like how giving attention to performance may improve the regular Python versions."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]