[[{"text": ["At my previous employer I had wanted to spend some time playing with building embedded systems in tinypy, which is a \"minimalist implementation of Python in 64k of code\".", "(But I never got to it and I no longer have time."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "tinypy", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.tinypy.org/"}]}], [{"text": ["BTW, see this blog post: \"Type inference for Python\" for an interesting discussion of type inference and static typing, including links to some Guido van Rossum blog posts describing adding optional static typing to Python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Type inference for Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://lambda-the-ultimate.org/node/1519"}]}, {"text": ["I agree with Bruce Eckel that one is better off practicing \"strong testing\" than relying on strong typing.", "I think that applies equally well to embedded development."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Bruce Eckel", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.mindview.net/WebLog/log-0025"}]}], [{"text": ["Personally, I've worked on some of the software that runs in the device used by BusRadio.", "It's an example of an embedded project built on Twisted and Python.", "The device is an embedded XScale processor running a debian-derived distribution, so it might not meet certain definitions of \"embedded\", but it is pretty dang small: it fits into the dashboard of a school bus."], "childNum": 4, "tag": "p", "senID": 0, "childList": [{"text": "BusRadio", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.busradio.com/"}, {"text": "Twisted", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/"}, {"text": "XScale", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/XScale"}, {"href": "http://www.debian.org/", "text": "debian-derived", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["There were some interesting issues with using Python with large libraries - the interpreter can take quite a while to start up and load all the code for Twisted on a really slow chip, and some things needed special-case optimizations.", "However, at no point was the dynamic nature of Python a problem.", "The software in question certainly wasn't perfect, but at least when using Twisted, a simple programming error will not \"bring the whole application down\".", "A traceback will get logged, and processing continues."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So, if you're in an embedded environment sufficiently unconstrained that you can use Python in the first place, it's no different than developing \"regular\" programs (games, desktop applications, web apps).", "You don't need static typing there, and you don't need it here either."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["We use python in quite a lot of embedded boards with ARM processors and 16 MB of RAM (running linux)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "embedded boards with ARM processors", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.embeddedarm.com/products/arm-sbc.php"}]}, {"text": ["It works really well and is really easy to make custom code quickly - one of the strong points of python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As for reliability of the code - we try to have 100% test coverage.", "Writing tests with python is very quick and it gives you a wonderful feeling of confidence.", "We use twisted trial to run the tests and report on coverage, but there are many other tools available."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "twisted trial", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/trac/wiki/TwistedTrial"}]}, {"text": ["In my experience python + tests is more reliable and much quicker to write than any other alternatives."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The only downsides for embedded work is that sometimes python can be slow and sometimes it uses a lot of memory (relatively speaking).", "This hasn't causes us a show stopping problem yet, and python is quite easy to profile for both speed and memory if it becomes a problem."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["pychecker is a very useful too also which will catch quite a lot of common errors."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "pychecker", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pychecker.sourceforge.net/"}]}], [{"text": ["We use Python here at the university for embedded applications based on the Gumstix hardware platform.", "Although more capable than traditional embedded systems, we find the mix of small formfactor, low (ish) power consumption and the ease in transferring code between development on desktop machines and the target hardware invaluable."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python is also a great language to teach the students, and with the Gumstix its great they can get code working on a low power system, rather than the headache and heartbreak that comes with using dedicated languages such as NesC."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Unit tests are your only safety against these things."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I worked for a company which used Python on an embedded product based around an Atmel AVR32 and running embedded Linux.", "The firmware was initially developed on a PC (due to lack of a working hardware prototype), then later moved to the embedded hardware running on the cross-compiled Python interpreter."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The ability to debug and modify source code \"live\" on the device was a big plus during development, and saved a lot of time.", "The big disadvantages were speed and memory usage of the Python interpreter."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Following the first release of production firmware we ported critical sections of code over to C/C++.", "The porting effort was quite straightforward and resulted in an improvement of several orders of magnitude on speed-critical code (as you would expect)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Incidently most of the design and production testing code was written in Python, mainly running inside a test harness on a PC."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Telit makes GSM/GPRS modem modules that include an embedded Python interpreter."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Telit", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.telit.com/"}, {"href": "http://www.telit.com/en/products/gsm-gprs.php?p_id=12&p_ac=show&p=45", "text": "GSM/GPRS modem modules", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://www.telit.com/en/products/programming/python/why-python.php", "text": "embedded Python interpreter", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["I haven't tried them myself, so I don't know how the Python interpreter compares or differs from a PC implementation, such as which included modules, RAM and ROM memory limits, execution speed, etc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I have a Python server (using Twisted) and some helper scripts running under XP Embedded, and it's been working great."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Twisted", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/trac/"}]}], [{"text": ["Indeed, Python is often used as a 'support language' while you need to write some kind of tests - i.e.", "I was involved in a project, which (Python based) test framework code base was (is?", ") almost as big as that of the main product.", "Python 'agents' works on QNX, VxWorks - and most problems we have, was to port properly threading and network related parts of our code."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It might be worth to take a look OpenMoko project a lot of embedded development in Python is done there."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "OpenMoko project", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.openmoko.org/"}]}, {"text": ["Things to watch-out:\n- support for Python/C extension module might behave quite strangely depending on platform/OS\n- most of embedded platforms offers quite out-dated versions of Python\n- finally you will find out that there is a difference between 'proper' embedded software in which every bit counts, and 'modern' embedded software that is performed on >412Mhz XScale CPUs with more thatn 128MB, and then Python just don't match the hardware that you would like to target :("], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["My team wrote an embedded software made out of C++ and Python.", "We decided to write basic classes and heavy computational routines in C++.", "We wrote logic in Python.", "Boost libraries as glue.", "Using boost is never easy, but the results is excellent.", "Fast and easy to modify.", "Using python to represent the custom needings,  we are able to satisfy customers' needings realtime, changing the code using injection technics.", "Something really exciting!", "(ok, I'm a geek ;)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["We started prototyping in python but we suddenly realized that it was clearly too slow.", "So we decided to structure the program in different computational layers, in order to reach the speed requirements.", "C++ was the best solution."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In order to use python and c++ together we had to keep a strict control on typing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I've been working on microwave telecommunication equipments based on old and slow powerpc and 16Mb of RAM."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I've been able to port the Python 2.6.1 interpreter on VxWorks, in order to have the command line interpreter available directly from the target shell, or to execute python scripts uploaded to the target flash."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["We used those scripts to perform autotest on the target or execute diagnostic procedures.", "Here some details on the whole procedure: HOW TO: Port Python to VxWorks"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "HOW TO: Port Python to VxWorks", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.gsalcazar.altervista.org/tools/how-to-port-python-to-vxworks/"}]}], [{"text": ["Isn't the EVE Online client a showpiece of real-time, high-performance Python?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "EVE Online", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.eve-online.com/"}]}]]