[[{"text": ["Django!"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Django!", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Look up the DjangoCon talks on Google/Youtube - Especially \"Reusable Apps\" (www.youtube.com/watch?v=A-S0tqpPga4)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I've been using Django for some time, after starting with Ruby/Rails.", "I found the Django Community easier to get into (nicer), the language documented with excellent examples, and it's modularity is awesome, especially if you're wanting to throw custom components into the mix, and not be forced to use certain things here and there."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "excellent", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["I'm sure there are probably ways to be just as flexible with Rails or some such, but I highly encourage you to take a long look at the Django introductions, etc, at http://www.djangoproject.com/"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://www.djangoproject.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}]}, {"text": ["Eugene mentioned it's now at 1.0 - and therefore will remain a stable and backward-compatible codebase well through January 2009. "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Also, the automatic admin interfaces it builds are production ready, and extremely flexible.  "], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "production ready", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Sorry, but your question is wrong.", "People are probably going to vote me down for this one but I want to say it anyway:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I wouldn't expect to get an objective answer!", "Why?", "That's simple:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "All Ruby advocates will tell to use Ruby.", "tag": "none", "senID": 2}, {"text": "All Python advocates will tell to use Python.", "tag": "none", "senID": 3}, {"text": "All PHP advocates will tell to use PHP.", "tag": "none", "senID": 4}, {"text": "Insert additional languages here.", "tag": "none", "senID": 5}]}, {"text": ["Got the idea?"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["I recommend you to try each of the languages you mentioned for yourself.", "At least a few days each.", "Afterwards you should have a much better foundation to make your final decision."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["That said, I would choose Ruby (because I am a Ruby advocate)."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["All of them will get the job done."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Use the one that you and your team are most familiar with"], "childNum": 0, "tag": "h2", "senID": 1, "childList": []}, {"text": ["This will have a far greater impact on the delivery times and stability of your app than any of the other variables."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["it depends."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["php - symfony is a great framework.", "downsides: php, wordy and directory heavy.", "propel gets annoying to use.", "upsides: php is everywhere and labor is cheap.", "well done framework, and good support.", "lots of plugins to make your life easier"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["python - django is also a great framework.", "downsides: python programmers can be harder to find, django even harder.", "changing your db schema can be somewhat difficult since there are no official migrations.", "doesn't quite do mvc like you'd expect.", "upsides: does everything you need and has the great python std library and community behind it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["ruby - i've never used merb, so I'll address rails.", "upsides: there is a plugin, gem, or recipe for almost anything you could want to do.", "easy to use.", "downsides: those plugins, gems, and recipes sometimes fail to work in mysterious ways.", "monkey patching is often evil.", "the community is.. vocal.", "opinionated software, and sometimes those opinions are wrong (lack of foreign keys).", "rails itself seems like a tower of cards waiting to explode and take hours of your life away."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "lack of foreign keys", "childNum": 0, "tag": "em", "pos": 6, "childList": []}]}, {"text": ["with all of that said, I'm a freelance php/symfony and ruby/rails developer.", "I've worked on several projects in both languages and frameworks.", "My latest project is in Rails solely because of ActiveMerchant.", "I've been looking for a reason to develop a django app for a while.", "If there were an ActiveMerchant like library for django, I probably would have used it."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I would go with Django, if you are comfortable with a Python solution.", "It's at version 1.0 now, and is maturing nicely, with a large user base and many contributors.", "Integrating jQuery is no problem, and I've done it without any issues."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The only thing is, as far as I can tell, Ruby is much more popular for web development nowadays, so it's easier to find Ruby developers.", "I get this impression from browsing recent job advertisements - there aren't that many for Python or Django.", "I don't know much about Merb, so I can't give a fair comparison."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I've done enough PHP to not recommend starting a new project with it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Based in your reasons, I would go with Ruby.", "I see that you want some administration tools (scp, ftp client) and Ruby has it (net/sftp and net/ftp libraries)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also, there are great gems like God for monitoring your system, Vlad the Deployer for deploying, etc.", "And a lot of alternatives in Merb's field, just use whatever you find it's better for your needs (Thin, Mongrel, ebb, etc)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["To get a feeling of where the Django ecosystem is at currently, you might want to check out"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["djangopeople.net"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": ["djangogigs.com"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}]}], [{"text": ["I have to preface this with my agreeing with Orion Edwards, choose the one your team is most familiar with."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, I also have to note the curious lack of ASP.NET languages in your list.", "Not to provoke the great zealot army, but where's the beef?", ".NET is a stable, rapid development platform and the labor pool is growing daily.", "VB.NET and C# are transportable skill sets, and that can mean a lot when you're building a team of developers to work on a diverse set of tasks.", ".NET also allows you to separate your presentation layer from your backend code, like other languages, but also allows you to expose that backend code as web service for things like your iPhone and Facebook applications."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Take every suggestion with a grain of salt, and pick what suits the application best.", "Do your research, and design for function and not the zealots."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Disclaimer: Once a PHP, ColdFusion and Perl developer.", "Flex zealot, and Adobe lover.", "Now writing enterprise .NET applications.", ";)"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Disclaimer: Once a PHP, ColdFusion and Perl developer. Flex zealot, and Adobe lover. Now writing enterprise .NET applications. ;)", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["Don't forget Mono, which will let you run .NET under *nix.", "Not that I'm saying it will be perfect, just playing devil's advocate."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Don't get stuck in the mindset of server-side page layout.", "Consider technologies like SproutCore, GWT or ExtJS which put the layouting code fully on the client, making the server responsible only for data marshalling and processing (and easily replaced)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And you really, really need to know which server platform you want.", "Don't pick one because it's the flavor of the month, pick one because you're comfortable with it.", "Flavors don't last, a solidly built codebase will."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Having built apps in Django, I can attest to its utility.", "If only all frameworks were as elegant (yes Spring, I'm looking at you)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However in terms of betting the farm on Django, one thing you need to factor in is that Python 3 will be released shortly.", "Python 3 is not backwards compatible and there's a risk that it will fork the language and end up slowing momentum for all Python projects while they deal with the fallout.", "To be fair, Ruby 2.0 is due soon too, but I don't think it will be as disruptive. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["My experience with various new technologies over the last ten years leads me to recommend that you make stability of the platform a serious criterion.", "It's all well and good developing with the latest and greatest framework, but when you find it's moved forward a point version and suddenly the way you have done everything is deprecated, that can turn out to result in extra unnecessary work.", "This was particularly my experience working with rails a little ahead of version 1.", "For that reason alone I would avoid any platform that wasn't at least at 1.0 when you start work on it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Ruby is great to work with and will keep your developer productivity high, but if Django is the more stable platform I would favour that for sure."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It pays not to be biased about your server setup.", "Any modern web framework worth it's weight in source code has a SQL abstraction layer of some sort.", "PostgreSQL gets much better performance, and this is coming from a former MySQL partisan."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Apache is a beast, both to configure and on your server's resources.", "Why not go with something light-weight, like nginx or lighttpd?"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "nginx", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://nginx.net"}, {"href": "http://www.lighttpd.net/", "text": "lighttpd", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["(For the record, I'm a big Django user, but as the accepted answer said, go with whatever your team knows.", "Quick turn-arounds are not the time to be learning new frameworks.", "If you're hiring a team from scratch, go with Django."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Update: I ended up using, and loving, Django.", "I'm totally done with PHP - sorry about that.", "Future readers trying to create a new web 2.0 site (assuming they have a programming background), should greatly consider this setup:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Amazon ec2 for hosting ($80/month - not cheap but worth it if you can afford it)\nDjango/Python (Python is the most powerful scripting language on the planet - and Django just makes it work on the web)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Development should be done with SQLlite and the development server that comes with Django.", "Don't waste time with Nginx, Apache, MySQL until you're withing a few weeks of a beta."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Oh, and I now develop on a Mac, which works great for local Django development."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Finally, Pinax is a great start for Django development."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "Pinax", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pinaxproject.com"}, {"href": "http://djangoproject.com", "text": "Django", "childNum": 0, "tag": "a", "childList": []}]}]]