[[{"text": ["Mmh, I don't know how to say this.", "Some people might bash me over this. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Language (Groovy and Ruby)"], "childNum": 0, "tag": "h2", "senID": 1, "childList": []}, {"text": ["As a language I reckon Ruby is more funky compared to Groovy.", "Groovy only exists to ease Java programmer as you don't need to learn too much new syntax.", "But overall I reckon is not as funky as Ruby.", "Groovy wouldn't be the JVM language that is worth to learn based on attender's vote in this year's JavaOne but instead Scala is the one to go.", "Besides that, the original creator of Groovy himself does not have faith in the language he created himself in the first place. "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "the original creator of Groovy himself does not have faith in the language he created himself", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://macstrac.blogspot.com/2009/04/scala-as-long-term-replacement-for.html"}]}, {"text": ["Community and Job openings"], "childNum": 0, "tag": "h2", "senID": 3, "childList": []}, {"text": ["As for the community, Grails community is not as big as Rails, though since the acquirement by Spring more and more people are using it in serious application.", "Rails has more job openings in the market compared to Grails (that is if you want to invest in looking a new job). "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The framework (Grails and Rails)"], "childNum": 0, "tag": "h2", "senID": 5, "childList": []}, {"text": ["But, as a framework, if you really care about maintainability and need access to Java framework and legacy Java system, Grails is the way to go as it provides cleaner access to Java.", "Grails itself is built upon several popular Java framework (Spring &amp; Hibernate).", "Rails itself IMHO is funky like Ruby itself, but it's funkyness costs you maintainability.", "Matz himself prefers Merb over Rails 2 because Rails create a DSL on top of Ruby which is really against the Ruby philosophy.", "And I reckon because Rails itself is opiniated, which in turn if you don't have the same opinion as the creator, it might not fit your needs."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "Matz himself prefers Merb over Rails 2", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://merbist.com/2008/11/09/merb-1-0-released/"}]}, {"text": ["Conclusion"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "Conclusion", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["So in your case, learn Grails as that is the company's consensus (you need to respect the consensus) and if you still want to secure your job.", "But, invest some time learning Rails and Ruby too if you want to open a chance getting a new job in the future."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["Just a bit of a question, is the reason they are choosing Grails because Groovy is closer in syntax to Java than Ruby, or because they want access to Java?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If it is the former, then I would say try to focus on Grails since that is what you will be using.", "If it is the latter, you might want to see if the development team is open to using JRuby."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I have never used Grails or Rails before, but I have used Groovy and Ruby before, and as a language I think Ruby is much cleaner and more consistent, and the team might enjoy production more.", "As a platform, Rails has been out longer and has a lot of attention, so I would imagine it is a more stable platform to use with more fleshed out features."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["JRuby has full access to classes written in Java, so this is why I would say consider trying Rails.", "If it is too late in the decision time to consider it then I guess you can just ignore this post."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Basically, if you just want to hook in with Java, then JRuby is an option you should consider, but if the team is afraid of non-Java like syntax, maybe continue as is."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I would learn both.", "They are both up and coming technologies.", "Learning RESTful coding is a real benefit in any language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I use GRAILS at work and RoR for side projects.", "I can say that the RoR community is much larger (I'm talking about RoR vs Grails not RoR vs Java) and very helpful."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Short Answer: They are similar.... what could it hurt?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I've been learning RoR and Grails and the latter is far easier to learn."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Both frameworks share the same principles (agile, kiss, dry, duck typing and so..) but Groovy syntax is...well is simply great, something  you can learn and use in a blink of an eye."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I truly feel that Grails has brighter future than RoR."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["PD: Just in case you find it useful, a college of mine it's working full time with Grails and has a blog with some tips:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["http://dahernan.net/search/label/grails"], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://dahernan.net/search/label/grails"}, {"href": "http://dahernan.net/search/label/grails", "text": "http://dahernan.net/search/label/grails", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["You should just skip RoR and focus on learning Grails that you'll be needing for work."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Just skip RoR.", "There are really not a lot of similar things(besides the name)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I certainly believe that being enough familiar with Java, plus some experience programming with a dynamic language is more than enough if you plan to do serious development with Grails."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Comparing just only views(taglibs in Grails, RHTML in RoR) and the persistence stuff(GORM vs ActiveRecord) is just too different in the core, to invest time learning the nitty gritty details of RoR.", "Just dive into Grails, you won't regret."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Edit: corrected typo."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["@Levi Figueira"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For one thing, Grails is far more flexible than Rails.", "Rails is difficult to use with a legacy DB because ActiveRecord has too many design constraints that many legacy DBs didn't follow.", "Grails, oth, can use standard Hibernate mappings, which can accommodate a much broader range of DB designs."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["The Rails community has been very vocal in evangelising RoR, with the result that high expectations have been set and not always met (programmer productivity is good, but ensuring good performance once deployed isn't so easy)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Grails has been designed as the scripted successor to Java, whereas the Ruby-Java integration used in JRuby on Rails, for example, has had to be retrofitted."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I would suggest that you stick with Grails; it may not have the same glitz as RoR, but it's a pragmatic choice; you get improved productivity and the re-use of existing Java libraries."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Jump straight into Grails.", "I'm sure Ruby/Rails is good but so in Groovy/Grails.", "I recommend this book."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://beginninggroovyandgrails.com"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://beginninggroovyandgrails.com", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://beginninggroovyandgrails.com"}]}, {"text": ["Remember the errata is online.", "There are a couple of mistakes in the book."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["http://beginninggroovyandgrails.com/site/content/errata"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://beginninggroovyandgrails.com/site/content/errata", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://beginninggroovyandgrails.com/site/content/errata"}]}, {"text": ["Also, check out the 3 minute and 30 second demo of creating your first Grails app."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["http://grails.org/Grails+Screencasts"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "http://grails.org/Grails+Screencasts", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://grails.org/Grails+Screencasts"}]}, {"text": ["This tutorial will show you the basics."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["http://grails.org/Quick+Start"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "http://grails.org/Quick+Start", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://grails.org/Quick+Start"}]}], [{"text": ["Yes Grails is the way to go.", "RoR is good but it ties you in to the Ruby ecosystem.", "Part of the effort of learning a new framework or language is learning the class libraries as well as the language syntax.", "If your co-workers are all Java types you will be much better placed to receive help and support as they will all be speaking the same language as you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The other advantage to learning a bit of Groovy and Java is that web frameworks like GWT will open up to you.", "Grails has a GWT plugin and as a front end developer you will appreciate the ease of use and cross browser compatibility. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Also there is at least one hosting company offering free Grails application hosting (http://www.mor.ph/) which means that you can prototype sites at small data volumes before having to pay."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://www.mor.ph/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.mor.ph/"}]}], [{"text": ["I favor Grails over Rails, but learning Rails will give you a more balanced perspective and actually open your eyes to overlooked things that are possible in Grails."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["At a first glance you would think they are completely differente stories, since they are based on extremely different languages (Ruby and Groovy)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Then, after reading a couple of tutorials, you'll realize they share the same principles, scaffolding, duck typing, .. and finally the same goal: \n   making agile programming feasible."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "making agile programming feasible", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["If you already feel comfortable with terms like IoC and MVC, you'll find any of these options easy and exciting to learn."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I would say no, I'm learning Grails as well, and I've considered this as well, but just learning Grails is pretty big, plus learning Groovy (which granted is easy, but still gotta learn it right?", ") and all that... so learning Rails would have been just too much."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Yes if we compare grails and rails I would choose grails (I developed some intranet applications in grails)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But Django is superior to both - as python is well hmm a perfect choice."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You might also want to take a look at Clojure, a JVM language that's just starting to get popular.", "It may be a good choice for a Java-based company since it's compatible with your old codebase, and has a lot of modern innovations going for it.", "There are some good web frameworks emerging, including Compojure."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Clojure", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://clojure.org/"}, {"text": "Compojure", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://github.com/weavejester/compojure/wiki"}]}]]