[[{"text": ["There are two common metrics that can be used to find similarities between users:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Just to clarify, you use linear regression to find two coefficients A and B, that describe the line that minimizes the distance from all the points of the graph.", "This line has this formula:y = Ax + B.", "If two sets are similar points should be near to the main diagonal so A should tend to 1 while B to 0.", "Don't assume this explaination as complete or as a reference because it lacks soundness and typical math formalism, it just to give you an idea."], "childNum": 6, "tag": "p", "senID": 1, "childList": [{"text": "linear regression", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "A", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "B", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "y = Ax + B", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "A", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "B", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["EDIT:\nlike written by others, more complex algorithms to cluster data exist, like k-means but I suggest you to start from easy ones (actually you should need something more difficult just when you realize that results are not enough)."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "EDIT:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["I recommend the book Programming Collective Intelligence from Toby Segaran.", "Chapter 3 describes different clustering methods like Hierarchical Clustering and K-means Clustering. "], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Programming Collective Intelligence", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9780596529321"}, {"text": "Hierarchical Clustering", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Hierarchical%5Fclustering"}, {"href": "http://en.wikipedia.org/wiki/K-means%5Fclustering", "text": "K-means Clustering", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["The source code for the examples is available here"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://kiwitobes.com/PCI%5FCode.zip"}]}], [{"text": ["If you want the most accurate results, then no, you'd have to iterate over everything."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If your database is large enough, you could just take a statistical sampling, say taking between 1,000 -10,000 users and matching against that."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You would also be better off to add some more tables to the database, store the results, and only update it every so often, instead of calculating this on the fly."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Ilya Grigorik did a series on recommendation algorithms, though he was focusing on Ruby.", "It appears to be under the machine learning section in his archives, but there isn't a direct section link."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "machine learning", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}, {"href": "http://www.igvita.com/archives/", "text": "archives", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["I think a lot of people on here are missing the simplicity of the question.", "He didn't say anything about creating a rating prediction system.", "He just wants to compute the similarity between each user's song rating behavior and each other user's song rating behavior.", "The Pearson correlation coefficient gives exactly that.", "Yes, you must iterate over every user/user pair."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["EDIT:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["After thinking about this a little more:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Pearson is great if you want the similarity between two users' tastes, but not their level of \"opinionatedness\"... one user who rates a series of songs 4, 5, and 6 will correlate perfectly with another user who rates the same songs 3, 6, and 9.", "In other words, they have the same \"taste\" (they would rank the songs in the same order), but the second user is much more opinionated.", "In other other words, the correlation coefficient treats any two rating vectors with a linear relationship as equal."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["However, if you want the similarity between the actual ratings the users gave each song, you should use the root mean squared error between the two rating vectors.", "This is a purely distance based metric (linear relationships do not play into the similarity score), so the 4,5,6 and 3,6,9 users would not have a perfect similarity score."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The decision comes down to what you mean by \"similar\"..."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["That is all."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["If you want to do it in a approximate way without visiting all the records, you can use the Jaccard Coefficient.", "Probably needs some adaptation if you want to consider the scores.", "But I guess that's the best solutions if your system is too big and you don't have the time to check all the records. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You should be able to find a good algorithm in this book: The Algorithm Design Manual by Steven Skiena."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "The Algorithm Design Manual", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.algorist.com/"}]}, {"text": ["The book has a whole bunch of algorithms for various purposes.", "You want a graph clustering algorithm, I think.", "I don't have my copy of the book handy, so I can't look it up for you."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["A quick Google search found a Wikipedia page: http://en.wikipedia.org/wiki/Cluster_analysis  Perhaps that will help, but I think the book explains algorithms more clearly."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://en.wikipedia.org/wiki/Cluster_analysis", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Cluster%5Fanalysis"}]}]]