[[{"text": ["The path of least effort and best results would be to learn what it takes to deploy an app using those existing GUI libraries."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Tkinter is part of the python standard distribution and is installed by default.", "Expect to find this on all python installs where there is a graphical display in the first place.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["starting in Python 2.7 and 3.1, Tk will look a lot better."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://docs.python.org/dev/whatsnew/2.7.html#ttk-themed-widgets-for-tk"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://docs.python.org/dev/whatsnew/2.7.html#ttk-themed-widgets-for-tk", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/dev/whatsnew/2.7.html#ttk-themed-widgets-for-tk"}]}, {"text": ["\"Tcl/Tk 8.5 includes a set of themed widgets that re-implement basic Tk widgets but have a more customizable appearance and can therefore more closely resemble the native platform’s widgets.", "This widget set was originally called Tile, but was renamed to Ttk (for “themed Tk”) on being added to Tcl/Tck release 8.5."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Not really sure what you mean by \"heavyweight."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["wx uses native controls on each platform, and is about as easy to use in Python as I can imagine; after all, GUI APIs are complex because GUIs can get complex."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think wx, for the effort required to build a window and the quality of what shows up on screen, is great.", "I don't think you're likely to roll something better on your own."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Principally what's wrong is that it's reinventing wheels that have already been done by the makers of GTK, Tk, Wx, QT and their ilk.", "While a pure python GUI is technically feasible, and projects such as anygui did attempt something similar, there is relatively little to gain by doing this.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "anygui", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://anygui.sourceforge.net/"}]}, {"text": ["The native toolkits will also do a better job of covering the differences between the underlying platforms (native dialogs etc.).", "This means that the toolkits allow you to write a portable application that needs little if any platform specific code - most of this is abstracted by the underlying toolkit."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Distribution mechanisms such as py2exe on windows and any of the linux methods allow you to bundle DLLs with the application, so you can make an installer that drops any native components it needs into place.", "However, there isn't really a generic cross-platform way to do this so you will need to maintain separate installers for each platform."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["For one thing, all those libraries use different abstractions, so anything that worked with all of them is likely to wind up supporting a least-common-denominator set of functionality, or doing a LOT of work to use each to its fullest."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "or", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["you notion of \"pure python gui library\" is wrong because ultimately you will be using system level calls and widget, may be thru ctypes but that doesn't change the fact that if you start implementing your idea you will eventually become wxPython"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think it's about not inventig the wheel.", "It would work, but why should you do that?", "All the GUI libraries you mentioned are stable and more or less bullet proofen."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I could imagine that there are some experiments implementing a pure python library.", "But I never saw one.", "Everything about GUIs is hard work and a pure python library wouldn't have such a big audience."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]