[[{"text": ["The command-line Python, IMO, definitely comes first.", "Get that to work, since that's the core of what you're doing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The issue is that using a web framework's ORM from a command line application isn't obvious.", "Django provides specific instructions for using their ORM from a command-line app.", "Those are annoying at first, but I think they're a life-saver in the long run.", "I use it heavily for giant uploads of customer-supplied files."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Don't use bare CGI.", "It's not impossible, but too many things can go wrong, and they've all been solved by the frameworks.", "Why reinvent something?", "Just use someone else's code."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Frameworks involve learning, but no real \"overhead\".", "They're not slow.", "They're code you don't have to write or debug."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Here's the golden rule of frameworks:  It's code you don't have to write, debug or maintain.", "Use them."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "It's code you don't have to write, debug or maintain.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["You might consider using something like web.py which would be easy to distribute (since it's small) and it would also be easy to adapt your other tools to it since it doesn't require you to submit to the framework so much like Django does. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "web.py", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://webpy.org/"}]}, {"text": ["Be forewarned, however, it's not the most loved framework in the Python community, but it might be just the thing for you.", "You might also check out web2py, but I know less about that."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "web2py", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://mdp.cti.depaul.edu/"}]}], [{"text": ["Depends on the size of the project.", "If you had only a few previous php-scripts which called your stand alone application then I'd probably go for a cgi-app."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you have use for databases, url rewriting, templating, user management and such, then using a framework is a good idea."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And of course, before you port it, consider if it's worth it just to switch the language or if there are specific Python features you need."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Good luck!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I recently ported a PHP app to Python using web.py.", "As frameworks go it is extremely lightweight with minimal dependencies, and it tends to stay out of your way, so it might be the compromise you're looking for. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "web.py", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://webpy.org/"}]}, {"text": ["It all depends on your initial application though, because with a large application the advantages of having a full-featured framework handling the plumbing tend to outweigh the disadvantages involved in having to drag around all the framework code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Django makes it possible to whip out a website rapidly, that's for sure.", "You don't need to be a Python master to use it, and since it's very pythonic in it's design, and there is not really any \"magic\" going on, it will help you learn Python along the way."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Start with the examples, check out some django screencasts from TwiD and you'll be on your way."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Start slow, tweaking the admin, and playing with it via shell is the way to start.", "Once you have a handle on the ORM and get how things work, start building the real stuff!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The framework isn't going to cause any performance problems, like S. Lott said, it's code you don't have to maintain, and that's the best kind."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Go for a framework.", "Basic stuffs like session handling are a nightmare if you don't use a one because Python is not web specialized like PHP."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you think django is too much, you can try a lighter one like the very small but still handy web.py."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It depends on the way you are going to distribute your application.", "If it will only be used internally, go for django.", "It's a joy to work with it.", "However, django really falls short at the distribution-task; django-applications are a pain to set up."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}], [{"text": ["For the love of pete, use a framework!", "There are literally dozens of frameworks out there, from cherrypy to django to albatross to ... well.. you name it.", "In fact, the huge number of web frameworks are what people point to when they whine about the popularity of Rails. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The Python web development community is divided up with no single voice.", "But that's another topic alltogether!", "The point is, there are \"web toolkits\" (e.g.", "albatross) that are fairly lightweight but powerful enough to get you through the day (e.g.", "auto-verifying a bot didn't do a simple form submission fake, or helping with keeping MVC clean)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you want something that's not \"too much framework\" look here:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["http://wiki.python.org/moin/WebFrameworks"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://wiki.python.org/moin/WebFrameworks", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/WebFrameworks"}]}, {"text": ["Look under \"Basic Frameworks Providing Templating\".", "They're all lightweight and do all the \"don't reinvent the wheel\" stuff without forcing a Mac truck on you."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]