[[{"text": ["Maybe try Aptana (http://www.aptana.com/) - you can then plug in as many extra modules as you require."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.aptana.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.aptana.com/"}]}], [{"text": ["PDT 2.0 is vey good Eclipse PHP Ide .", "It is created with cooperation with Zend, so there a lot of featuers from Zend Studio.", "I also use it with Subeclipse(for SVN) and Target Management (for work on FTP remotely).", "I will also advice to use Aptana plugins fot HTML and Js - they are much better than standard Web Tools from Eclipse."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PHP Ide", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.eclipse.org/pdt/"}]}], [{"text": ["I develop Python applications at work and find Eclipse Classic and Eclipse for Java Devs a good fit because I don't do any plugin or Java EE Stuff.", "We use Eclipse for Java, Python, and NSIS (nullsoft installer) scripting. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The Python development I do requires the pydev plugin (see: http://pydev.sourceforge.net/) which so far has been fantastic on a Windows machine.", "I found some instability on a Fedora 9 machine, but that is not the general consensus among my linuxier colleagues :) "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://pydev.sourceforge.net/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pydev.sourceforge.net/"}]}, {"text": ["The pydev plugin comes with a very minimal set of customizable features including a short list of syntax for colouring, and it's very easy to create a dark colour scheme (black bg, bright text) for python development (if that matters to you).", "The debugger has been pretty good so far, but I have problems when my applications hit threading in PyQt.", "I don't know if that is a problem with QThread (a Qt Thread) or python threads in general."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I can't offer any advice regarding PERL or PHP but basically like you said, download an Eclipse version and find some good plugins for your development environment."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["PyDev is pretty decent as I'm sure you know.", "It can fit on top of all the Eclipse distributions (provided they meet the minimum version requirements).", "If you're doing webdev stuff, you'll probably find the closest fit with Aptana. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["That said, I find Aptana hideously clunky when compared to a decent text editor.", "I build sites using django and for that I use Eclipse (pure) and PyDev to do the python and gedit (gnome's souped up notepad) for writing the HTML for templates/CSS/JS/etc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["At the end of the day, whatever suits you best is what you'll go with."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "you", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["EPIC is the only Eclipse Perl plugin I know for Perl. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "EPIC", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.epic-ide.org/"}]}, {"text": ["The integration is okay.", "Offers a graphical debugger, but watch out for inspecting data that contains cycles, as the perl exec could just go into an infinite loop"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I develop in PHP, python, C(python modules), SQL and JS/HTML/CSS all on eclipse.", "I do this\nby installing PDT, CDT, pydev and SQL tools onto the eclipse-platform, and then using different workspaces for mixed projects. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Two workspaces to be specific, one for PHP web development and another for Python/C.", "I do run it on a rather powerful machine so I allow eclipse the luxury of added memory (2G)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Works like a charm and it is very nice to be able to use the same IDE for everything :)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]