[[{"text": ["I would recommend looking into Twisted, their twisted.web server, and the comet work done on top of it at Divmod.", "They can handle far more concurrent connections than traditional thread or process based servers, which is exactly what you need for something like this.", "And, yes, I've architected systems using Twisted for COMET stuff, while using other things for the more front-facing web applications beside it.", "It works out well with each part doing what it does best."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I need to do something very similar.", "I found this, but haven't had the time to look at it properly yet:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://code.google.com/p/django-evserver/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://code.google.com/p/django-evserver/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/django-evserver/"}]}], [{"text": ["If you can run Java I would recommend StreamHub Comet Server. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "StreamHub Comet Server", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.stream-hub.com/"}]}, {"text": ["Firstly, regarding your need not to 'kill' your existing application, the JavaScript include has a really low footprint at less than 10K.", "I use it for pushing user updates and chat on the social networking site I'm building.", "I tested with a 1000+ hits a day and there was no noticeable effect on the CPU."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Secondly, on deploying, I followed some of the examples and was up and running really quickly compared to banging my head against a wall with CometD.", "There is a good Comet Hello World getting started guide and a Google Group if you get stuck on anything."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "Comet Hello World", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://streamhub.blogspot.com/2009/07/getting-started-with-streamhub-and.html"}, {"href": "http://groups.google.co.uk/group/streamhub-comet-server-community", "text": "Google Group", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["One option is Netty, client-server socket framework based on Java NIO from JBoss.", "For a comparison and discussion see here.", "It reportedly handles 100000 simultaneous open connections on a quad-core server. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "see here", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://amix.dk/blog/viewEntry/19456"}]}], [{"text": ["If you're running IIS, you can check out WebSync (http://www.frozenmountain.com/websync), a standards-compliant (bayeux) comet server and client for .NET/IIS.", "If you don't want the additional load, the On-Demand version is a SaaS option that offloads the heavy lifting."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you're looking to combine Django with a Comet server (Orbited), check this project I have going to integrate Django and Orbited in as \"clean\" and \"real-world\" as possible here: http://github.com/clemesha/hotdot"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://github.com/clemesha/hotdot", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://github.com/clemesha/hotdot"}]}, {"text": ["The project addresses \"real-world\" problems like security and logging/filtering/modifying the in-transit Comet messages, etc - but is still a work in progress. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]