[[{"text": ["Django is just fine on shared hosting.", "I'm using a couple of home-cooked web apps based on Django, running on my BlueHost account without trouble."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Django", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["What you need, basically, is to install your own version of Python (here's my guide for 2.5 which should work similarly for newer versions), whichever you want, then install Django on top of it.", "Next, with tools like fcgi you can easily redirect any URL that points to your hosting to your Django app.", "Google for details."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "here's my guide", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://eli.thegreenplace.net/2008/10/20/installing-python-25-on-bluehost/"}, {"text": "fcgi", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["P.S.", "if you're interested in this approach, ask me specific questions in the comments and I'll try to provide more information."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Your reason for rejecting Ruby on Rails is spurious.", "Django, like other frameworks based on real languages like Python and Ruby, isn't a lot different from Rails in that regard.", "Unless you have a lot of visitors, the performance will be fine, and in that case you're better off distributing the work to several servers.", "If all you care about is usability in the widest variety of shared web hosts, stay with PHP.", "If you're also trying to keep your sanity or are hoping to learn something new and elegant, picking a different language is preferable."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "lot", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["I'm afraid to say that most of hosting services only provides PHP, unfortunately."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Anyway, CakePHP is a very good frameworks, which speeds up in an amazing way.", "The community is active, it's easy and you can do anything really really fast."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "CakePHP", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://cakephp.org/"}]}, {"text": ["I've used for years, and you continue to learn new things, and go deep in knowledge."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Imho is the best php framework."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If not php, django is a definitely good choice, I'm using it in the last 4 months and it's awesome, fast, easy testable/debuggable!"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I've got a couple low volume Rails applications that have been running for a year on Heroku at almost no cost to me.", "S3 is cheap.", "Heroku has built a great stack and is active in the Rails community supporting events.", "With Varnish caching set up for you by default page load times are really fast.", "If you want more control, and still on a shared host budget (10 dollars/month), WebbyNode http://webbynode.com has a 256MB VPS for that price.", "I also have no complaints with Slicehost, priced at $20/month.", "Both of these are bare Linux distros, Ubuntu is probably most user friendly.", "Cannot speak for Django, but really choosing between Django and Rails should not be about the host if you ask me.", "Do you like Ruby or Python better?", "Do you like Django or Rails better?", "Do you have a community of help available for one or the other?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://webbynode.com", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://webbynode.com"}]}], [{"text": ["I haven't tried it yet, but maybe http://hosting.djangofoo.com/ is an option if you're interested in using django."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://hosting.djangofoo.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://hosting.djangofoo.com/"}]}], [{"text": ["You can try to use Ruby On Rails on http://heroku.com hosting.", "I belive it will be much faster than common shared hosting."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://heroku.com", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://heroku.com"}]}]]