[[{"text": ["I am not sure that I understood you question, but if you look for an IDE for Python I would strongly recommand you have a look at PyDev"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PyDev", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pydev.org/"}]}, {"text": ["It's by far the most feature-rich IDE for Python and it has a really active development team.", "And did I mention it's free and open source? "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Wing IDE is an excellent IDE for python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Wing IDE", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.wingide.com/"}]}], [{"text": ["I too have been looking for an IDE that makes this sort of thing easy."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "easy", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["About two hours ago I downloaded Pycharm and it has blown me away.", "This may be the coolest IDE I have ever used, for any language.", "So far it seems to do everything that big IDEs like VisualStudio or Eclipse do (for many languages), only without the learning curve or resource consumption of those monsters."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Pycharm", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.jetbrains.com/pycharm/"}]}, {"text": ["It does exactly what you are asking... just right-click on any class, or a method, or pretty much anything else, Select \"Go to Implementation\" (or Declaration), and up it pops in a new tab."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So many other amazing slick features too... just try it!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["There's a 30 day trial and after that it's pretty reasonable (like $29 for academic, $100 for individual, and $200 for a commercial team.", "Oh and FREE if you have a bona fide OpenSource project that's been actively worked on for at least 3 months."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["(I apologize if this sounds like an advertisement.", "I can assure you that it's not.", "I'm just kind of... obsessive... about IDEs, and very frustrated that so few of them meet my standards.", "I will revise this if I find any \"caveats\" but so far, so good."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["If you're asking about IntelliJ IDEA, Python is only available for the commercial version."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "IntelliJ IDEA", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.jetbrains.com/idea/"}]}, {"text": ["If you're asking about a Python IDE, IDLE comes with Python already.", "I can also recommend Boa Constructor."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Boa Constructor", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://boa-constructor.sourceforge.net/"}]}], [{"text": ["WingIDE if you can fork out some cash will do what you want all bundled up and with little to no configuration effort.", "Otherwise Eclipse with Aptana's pydev is free, and does exactly that, plus a lot more (ctrl+click pretty much anything for redirection and a lot of other useful things like pyc removal etc.", ")."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Navigation problems though are usually symptomatic of more than just lack of tools.", "A decent structure to your projects and a version control system (even if you work locally and solo) would go a long way helping to address that."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I'm not sure about what functionality is available in textmate but would a simple search work?", "i.e.", "Ctrl+F with the query \"def function\" including the def part so you find the definition instead of a call?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'm a fan of pyscripter http://code.google.com/p/pyscripter/.", "Has those features and more (and a regex checker!"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://code.google.com/p/pyscripter/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/pyscripter/"}]}, {"text": ["Open source of course."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]