[[{"text": ["If the method is relevant to the Path - no matter how obscure - I think it should reside within the class itself."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you have multiple places where you have path-related functionality, it leads to problems.", "For example, if you want to check if some functionality already exists, how will a new programmer know to check the other, less obvious places?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think a good practice might be to order functions by importance.", "As you may have heard, some suggest putting public members of classes first, and private/protected ones after.", "You could consider putting the common methods in your class higher than the obscure ones."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you're keen to put those methods in a different source file at any cost, AND keen to have them at methods at any cost, you can achieve both goals by using the different source file to define a mixin class and having your Path class import that method and multiply-inherit from that mixin.", "So, technically, it's quite feasible."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, I would not recommend this course of action: it's worth using \"the big guns\" (such as multiple inheritance) only to serve important goals (such as reuse and removing repetition), and separating methods out in this way is not really a particularly crucial goal."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If those \"obscure methods\" played no role you would not be implementing them, so they must have SOME importance, after all; so I'd just clarify in docstrings and comments what they're for, maybe explicitly mention that they're rarely needed, and leave it at that."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I would just prepend the names with an underscore _, to show that the reader shouldn't bother about them.", "It's conventionally the same thing as private members in other languages."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "_", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}], [{"text": ["Put them in the Path class, and document that they are \"obscure\" either with comments or docstrings.", "Separate them at the end if you like."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Oh wait, I thought of something -- I can just define them in the Path.py module, where every obscure method will be a one-liner that will call the function from the separate module that currently exists.", "With this compromise, the obscure methods will comprise of maybe 10 lines in the end of the file instead of 50% of its bulk."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Path.py", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}], [{"text": ["I suggest making them accessible from a property of the Path class called something like \"Utilties\".", "For example: Path.Utilities.RazzleDazzle.", "This will help with auto-completion tools and general maintenance."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Path.Utilities.RazzleDazzle", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}]]