[[{"text": ["At any lexical level, from amodule import * is a \"seemed a good idea at the time\" design decision that has proven a real disaster in real life, with the possible exception of handy exploration at the interactive interpreter prompt (even then, I'm not too hot on it -- import module as m forces only two extra characters to use qualified names instead [[just an m. prefix]], and qualified names are always sharper and more flexible than barenames, not to mention the great usefulness in exploratory interactive situations of having m available for help(m), reload(m), and the like!", ")."], "childNum": 8, "tag": "p", "senID": 0, "childList": [{"text": "from amodule import *", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "possible", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "import module as m", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "m.", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "and", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "m", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "help(m)", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "reload(m)", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["This bedraggled construct makes it very hard, for the poor person reading the code (often in a doomed attempt to help debug it) to understand where mysteriously-appearing names are coming from -- impossible, if the construct is used more than once on a lexical level; but even when used just once, it forces laborious re-reading of the whole module every time before one can convince oneself that, yep, that bedraggled barename must come from the module."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Plus, module authors usually don't go to the extreme trouble needed to \"support\" the horrid construct in question.", "If somewhere in your code you have, say, a use of sys.argv (and an import sys at the very top of your module, of course), how do you know that sys is the module it should be... or some completely different one (or a non-module) coming from the ... import *?!", "Multiply that by all the qualified names you're using, and misery is the only end result -- that, and mysterious bugs requiring long, laborious debugging (usually with the reluctant help of somebody who does \"get\" Python...!-)."], "childNum": 6, "tag": "p", "senID": 2, "childList": [{"text": "sys.argv", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "import sys", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "know", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "sys", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "... import *", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "does", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["Within a function, a way to add and override arbitrary local names would be even worse.", "As an elementary but crucial optimization, the Python compiler looks around the function's body for any assignment or other binding statements on each barename, and deems \"local\" those names it sees thus assigned (the others must be globals or built-ins).", "With an import * (just like with an exec somestring without explicit dicts to use as namespaces), suddenly it becomes a total mystery which names are local, which names are global -- so the poor compiler would have to resort to the slowest possible strategy for each name lookup, using a dict for local variables (instead of the compact \"vector\" it normally uses) and performing up to three dict look-ups for each barename referenced, over and over."], "childNum": 3, "tag": "p", "senID": 3, "childList": [{"text": "Within a function", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "import *", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "exec somestring", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Go to any Python interactive prompt.", "Type import this.", "What do you see?", "The Zen of Python.", "What's the last and probably greatest bit of wisdom in that text...?"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "import this", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["By forcing the use of barenames where qualified names are so vastly preferable, you're essentially doing the very opposite of this wise recommendation: instead of admiring the greatness and honkingtude of namespaces, and doing more of those, you're breaking down two perfectly good and ready-to-use namespaces (that of the module you're importing, and that of the lexical scope you're importing it in) to make a single, unholy, buggy, slow, rigid, unusable mess."], "childNum": 3, "tag": "p", "senID": 5, "childList": [{"text": "so", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "opposite", "childNum": 0, "tag": "strong", "childList": []}, {"text": "breaking down", "childNum": 0, "tag": "em", "childList": []}]}, {"text": ["If I could go back and change one early design decision in Python (it's a hard choice, because the use of def and especially lambda for what Javascript so much more readably calls function is a close second;-), I would retroactively wipe out the import * idea from Guido's mind.", "No amount of alleged convenience for exploration at the interactive prompt can balance the amount of evil it's wrought...!-)"], "childNum": 6, "tag": "p", "senID": 6, "childList": [{"text": "one", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "def", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "lambda", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "function", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "import *", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "alleged", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["The release notes for Python 2.1 seem to explain why this limitation exists:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "release notes for Python 2.1", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/dev/whatsnew/2.1.html"}]}], [{"text": ["I believe by \"in the middle of your program\" you are talking about this kind of thing:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n def f():\n    from module import *    # not allowed\n</code>\n</pre>\n", "senID": 1}, {"text": ["This is because it would make optimizing the body of the function much too hard.", "The Python implementation wants to know all of the names of function-local variables when it byte-compiles a function, so that it can optimize variable references into operations on the (CPython) virtual machine's operand stack, or at least to local variable-slot operations rather than lookups in outer namespaces.", "If you could dump the entire contents of a module into a function's local namespace, then the compiler would have to assume that any name in the function might possibly refer to a module global, because the list of names brought in by from module import * is only known at runtime."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "any", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "from module import *", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["I don't have a Python interpreter on this computer so I can't check, but if I remember correctly, this is valid, albeit poor style:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n def f():\n    ...\n\nfrom module import *\n\ndef g():\n    ...\n</code>\n</pre>\n", "senID": 4}, {"text": ["Also note that there are some weasel words in http://docs.python.org/reference/simple_stmts.html#the-import-statement :"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "http://docs.python.org/reference/simple_stmts.html#the-import-statement", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/reference/simple_stmts.html#the-import-statement"}]}, {"text": ["Emphasis mine.", "I don't know exactly what that means, but it sounds like you may be able to get away with function-scope from module import * in some circumstances (but note further that those weasel words are gone in the v3.2 edition of that document)."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "from module import *", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["It's not prohibited, because..."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "It's not prohibited, because...", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["... it's handy for quick scripts and shell exploring. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["...but you should not keep it in any serious code"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "...but you should not keep it in any serious code", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["It's not prohibited at all.", "It works fine, but you get a warning because it's generally a bad idea (for reasons others have gone into).", "You can, if you like, suppress the warning; the warnings module is what you want for that."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["others have given in-depth answers, I'll give a short overview answer of my understanding.. when using from you are making it so you can directly call any function in that module you imported without doing modulename.functioname (you can just call \"functionname\") this creates problems if you have 2 functions of the same name in different modules and also can create confusion when dealing with a lot of functions as you don't know what object/module it belongs to (from point of view of someone looking over already written code that isn't familiar with it)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]