[[{"text": ["I think the best way is to encode your data in an appropriate transfer format (you should not use pickle, as it's not save, but it can be binary) and transfer it as a multipart post request"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "multipart post request", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.activestate.com/recipes/146306/"}]}, {"text": ["What I do not know if you can make it work with repoze.who.", "If it does not support sign in and function call in one step, you'll perhaps have to verify the credentials yourself."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you can wrap your data in xml you could also use XML-RPC."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "XML-RPC", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://turbogears.org/2.0/docs/modules/pylons/controllers%5Fxmlrpc.html"}]}], [{"text": ["I agree with all the answers about avoiding pickle, if safety is a concern (it might not be if the sender gets authenticated before the data's unpickled -- but, when security's at issue, two levels of defense may be better than one); JSON is often of help in such cases (or, XML, if nothing else will do...!-)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Authentication should ideally be left to the webserver, as SpliFF recommends, and SSL (i.e.", "HTTPS) is generally good for that.", "If that's unfeasible, but it's feasible to let client and server share a \"secret\", then sending the serialized string in encrypted form may be best."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Why don't you serialize the dictionary to a file, and upload the file?", "This way, the server can read the object back into a dictionary ."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Do a POST of your python data (use binary as suggested in other answers) and handle security using your webserver.", "Apache and Microsoft servers can both do authentication using a wide variety of methods (SSL client certs, Password, System accounts, etc...)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Serialising/Deserialising to text or XML is probably overkill if you're just going to turn it back to dictionary again)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I'd personally use SimpleJSON at both ends and just post the \"file\" (it would really just be a stream) over as multipart data."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But that's me.", "There are other options."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Have you tried using pickle on the data ?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]