[[{"text": ["I'm a Haskell programmer for more than 7 years and I haven't used any other language for serious work since.", "My recommendation is, of course, Haskell.", ":-)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In my experience, here is what you can expect of Haskell:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "Learning Haskell takes time. Mathematically inclined people tend to pick it up very quickly, but most programmers take a while to unlearn their previous experience and get familiar with purely functional programming. If your project should have been finished yesterday, then you are better off with a language you already know.", "tag": "none", "senID": 2}, {"text": "About 4x-10x less code than C. For example, here a prototype implementation of quick sort", "tag": "none", "senID": 3}]}, {"text": [], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n qsort :: Ord a =&gt; [a] -&gt; [a]\n qsort []     = []\n qsort (x:xs) = qsort (filter (&lt;x) xs) ++ [x] ++ qsort (filter (&gt;=x) xs)\n</code>\n</pre>\n", "senID": 5}, {"tag": "ul", "num": 4, "lis": [{"text": "Once your source code compiles, it is usually correct on the first try. The type system and purity, i.e. the lack of mutable data structures, are largely responsible for this.", "tag": "none", "senID": 6}, {"text": "Haskell forces you to think about the problem. If the compiler throws a fit, that's usually a sign that you don't have a clear understanding of your problem domain yet.", "tag": "none", "senID": 7}, {"text": "Space leaks and stack overflows. They happen, but they are usually not difficult to fix once they appear. However, that requires a good understanding of the execution model, i.e. lazy evaluation. Here a ", "tag": "none", "senID": 8}, {"text": "The Haskell community is a great resource. If you've met a stumbling block, visiting the #haskell IRC channel or asking on the haskell-cafe@haskell.org or beginners@haskell.org mailing lists is likely to solve your problem.", "tag": "none", "senID": 9}]}, {"text": ["I don't think it's possible to back up these experiences with anything other than experience; so, you have to take my word for it."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["Several experience reports have been published formally, see also the Haskell in Industry page.", "I found Haskell vs. Ada vs. C++ vs. Awk vs. ... An Experiment in Software Prototyping Productivity [ps] to be particularly enlightening."], "childNum": 2, "tag": "p", "senID": 11, "childList": [{"text": "Haskell in Industry", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://haskell.org/haskellwiki/Haskell_in_industry"}, {"text": "Haskell vs. Ada vs. C++ vs. Awk vs. ... An Experiment in Software Prototyping Productivity [ps]", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://haskell.org/papers/NSWC/jfp.ps"}]}], [{"text": ["I think that you are going to find that most of the popular very high level languages that are ideal for prototyping are 'weakly typed'. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also, when I unit test, it's almost never to make sure that things are of the right type.", "This is very seldom as big a problem as it's made out to be.", "You should unit test to ensure freedom of the algorithm from bugs of any cause."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "never", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "any", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["You mentioned python, so I will recommend that, not being familiar with haskell myself.", "Python has Numpy and integrates very well with C. It also has the itertools module in stdlib which is very nice for combinatorial work (judiciously applied, It can outperform slightly better than mediocre C).", "I'm currently working on a similar project and I prototyped it out with python.", "I'm currently in the process of translating most of it to C. This is a nice process because I already have a python implementation of every algorithm so once I get my C wrapped for python, I can test the two off against each other to make sure that they give identical output on identical input.", "So because I built a prototype in python, I get both a very cheap testing framework for my application and a python module written in C. "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "and", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["Plus I've already found optimal (or at least sufficient) algorithms and if a new one occurs to me, I can quickly modify the python in a different branch to test it for efficiency."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Whatever language you choose, consider making sure that it integrates well with your ultimate target language to take advantage of similar perks.  "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I haven't used Python, and I've only used Haskell a little, for exactly the purpose you describe -- prototyping things.", "The thing to watch out for there is not the slowdown that laziness gives you, but rather the fact that seemingly constant-space algorithms can havespace leaks that consume all available memory with thunks representing unevaluated chunks of code.", "Space leaks are hard to see."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "seemingly constant-space algorithms can havespace leaks", "childNum": 1, "tag": "strong", "pos": 1, "childList": [{"text": "space leaks", "tag": "a"}]}, {"text": "space leaks", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://algorithm.com.au/blog/files/36ca9a664954e680edb64d260d763252-350.php"}]}, {"text": ["Of course, you can worry about them and scour your program looking for them, exterminating them with seq and other forms of ugliness...", "But the point of using a prototyping language is to avoid all those headaches."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "seq", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["If you're playing with problem sizes so small that it doesn't matter if a thunk is created in memory for every evaluation step in your program from beginning to end, then I could recommend Haskell."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["While i'd encourage you to learn more languages, if your goal is to prototype this problem as quickly as possible i'd stick with C++ (as you seem to be proficient in it already). "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["while other languages are probably better for prototyping in general if you only know C++ now, you will probably have a resonably large learning curve which will slow you down enough that you lose its advantage for this project at least (especially if you are looking at major paradigm change as well)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["on the other hand if this is actually more about broadening your knowledge for the future then pretty much any of the scripting languages will do."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Haskell can really shine if you can express the problem domain as an \"embedded domain specific language\" (eDSL).", "This is actually just a function library with pretensions, but the trick is to define an underlying abstraction and functions to manipulate it.", "Its difficult to explain in more concrete terms without understanding your domain better, but I expect you want to give an underlying combinatorial algorithm some hints about which parts of the problem to tackle first, and how to identify promising partial solutions."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Start by taking a look at the list monad.", "If your problem is not too complex then this might actually be all you need.", "For more, look at this page for ideas on how to add backtracking and pruning."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "this page", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://okmij.org/ftp/Computation/monads.html"}]}], [{"text": ["Depending on the problem, your combinatorial problem might be an interesting fit with Oz, in particular it's finite domain constraint programming.", "I'll admit it's a bit exotic, though."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Oz", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.mozart-oz.org/"}, {"text": "finite domain constraint programming", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.mozart-oz.org/documentation/fdt/index.html"}]}], [{"text": ["C# 4.0"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "C# 4.0", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["It has almost all the features you require."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Some ProjectEular Examples"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Some ProjectEular Examples", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.msdn.microsoft.com/projecteuler"}]}, {"text": ["NOTE: I myself would go with Python and write some modules in C++.", ";)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I wouldn't use C++, because it won't catch things lack indexing off the end of arrays, and because it won't provide you with a garbage collector.", "Personally, I'd use, Java, just because that's what I'm familiar with."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I would consider what you are familiar with, what people you want to work with or at least communicate with are familiar with, and what libraries are available that you might want to use.", "This might include things like I/O or graphics libraries for post-processing results, as well as specialiased combinatorial algorithms.", "You might also look for profiling tools, so you can see where your algorithm is spending all its time."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I would suggest to give D a shot.", "It is close to C++, but much easier to reason about and without all the ugly warts.", "If you're thinking about writing the final implementation in C++, it's much easier to translate D to C++ as Python, and additionally you have the option to stay with D, as the performance is on par with C++."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Maybe R is the answer which you are looking for ?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "R", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.r-project.org/"}]}], [{"text": ["I have to develop a fast heuristic-like algorithm for a hard combinatorial problem. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "I have to develop a fast heuristic-like algorithm for a hard combinatorial problem.", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["For problems such as these, do yourself a flavor and pick a functional language.", "They are much better for expressing mathematical properties and abstractions.", "A language which supports higher-order functions, lambdas, and closures should be de rigeur for your type of work."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Note: Smalltalk and Ruby can also go very far along this path, because they are semi-functional (they have outstanding support for closures, in particular, because the syntax for block closures is so lightweight and readable), but I think you would find a language such as Haskell or Lisp a better match for the type of algorithms you are developing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]