[[{"text": ["Have you tried Qt?", "It is a cross platform C++ GUI toolkit for higher level language (PyQt).", "And it seemed very simple to me."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Qt", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "C++", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "PyQt", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}], [{"text": ["What you ask is a simple lib with enormous flexibility.", "Be able to build 3 * 3 executables, having good documentation and using other libraries all with a different background.", "And all of that on different OS platforms.", "It is quite a challenge it think QT would com the closest but it does not meet all your criteria."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["SWT?", "You can use it from Java, Python (well, Jython), Ruby (well, JRuby), Groovy, LISP (well, Clojure), and anything else that runs on the JVM."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "SWT", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.eclipse.org/swt/"}]}, {"text": ["It's simple-ish, it uses native widgets under the hood, it's actively maintained, and because you're distributing either a JAR or a JAR and some interpretable code, there's a unified build process.", "I can comment on its documentation, nor its proximity to any sort of metal."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I recognize that this is probably not the answer you were looking for."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["My guess is that windows developers couldn't be bothered as they have wpf etc and linux developers couldn't be bothered as they are used to it.", "So only people who are sick of win developement and moving to linux would embrace it.", "Maybe its time for you to start an open source project :) I was thinking something like wpf but based on opengl would be a good start."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The Tk toolkit meets most of your requirements, except maybe for number four.", "It's very cross-platform, uses native widgets when possible, is easy to use, etc.", "The requirement for distribution is hard to meet because that depends on the language, but when used with tcl, you can use tclkits and starkits which are an absolutely fantastic way to distribute code (essentially, your single-file executable has an embedded virtual file system that can contain all your assets -- code, images, etc). "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For more on the cross language, cross-platform features of tk see http://www.tkdocs.com"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.tkdocs.com", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.tkdocs.com"}]}], [{"text": ["WXWidgets seems a good fit as well."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "WXWidgets", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.wxwidgets.org/"}]}]]