[[{"text": ["Basically, python code, for the moment, will be divided into python 2.X code and python 3 code.", "Python 3 breaks many changes in the interest of cleaning up the language.", "The majority of code and libraries are written for 2.X in mind.", "It is probably best to learn one, and know what is different with the other.", "On an ubuntu machine, the python3 package will install Python 3, which can be run with the command python3, at least on my 8.10 install."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "python3", "childNum": 0, "tag": "code", "pos": 4, "childList": []}, {"text": "python3", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["To answer your question, learning with 2.5 is fine, just keep in mind that 3 is a significant change, and learn the changes - ask yourself as you code, \"how would this be different in 3, if at all?", "\"."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["(As an aside, I do wish Ubuntu would upgrade to 2.6 though.", "It has a nice compatibility mode which tries and points out potential difficulties.", "But python is in such big use on a modern Linux distro, it can be a difficult change to make)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Here's an article describing 2.6 -> 3's changes"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Here's an article describing 2.6 -> 3's changes", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/3.0/whatsnew/3.0.html"}]}], [{"text": ["Python 2.5 will be fine for learning purposes.", "In the interest of learning you will probably want to look into the differences that python 3.0 has introduced, but I think most of the Python community is still using Python 2, as the majority of libraries haven't been ported over yet."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "differences", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/3.0/whatsnew/3.0.html"}]}, {"text": ["If your interested in 2.6 here is a blog post on compiling it on Hardy, there may even be a package for it somewhere out there on the internets."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.saltycrane.com/blog/2008/10/installing-python-26-source-ubuntu-hardy/"}]}, {"text": ["Follow up, if there is a package I'm not finding it.", "Self compiling is pretty simple for most things, though I've never tried to compile Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I don't think it is 'too dated' to use, but there are some really nice features in python 2.6 that make it worth the update.", "This article will give you the details.", "As long as you have control of the machine, it is worth it."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "This article", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/whatsnew/2.6.html"}]}], [{"text": ["I don't have any statistics but my impression is that Python 2.5 is the version most in use today.", "It is certainly not \"dated\" - I still use Python 2.5 and I expect that I will be using it for weeks or months yet to come."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you have Python 2.6 available, though, I would suggest upgrading, as it's still fairly similar to Python 2.5 but will put you in better position for using Python 3."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Also, right now the 2.x branch is the most supported one, so I would also say that it's a good reason to start with that version."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And when the moment comes, you can always switch to Python 3. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Python 2.5 is fine.", "There are still plenty of people on Python 2.4 and 2.3."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "fine.", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["One thing to keep in mind about python 2.6 is that some libraries may not work.", "Numpy comes to mind.."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Numpy", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://numpy.scipy.org/"}]}]]