[[{"text": ["IDEs arent very useful in Python; powerful editors such as Emacs and Vim seem very popular among Python programmers.", "This may confuse e.g.", "Java programmers, because in Java each file generally requires boilerplate code, such as a package statement, getters and setters.", "Python is much more lightweight in comparison."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "very", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "package", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["If you're looking for an equivalent to Visual Studio or Eclipse, there is... Eclipse, with Pydev."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Pydev", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pydev.sourceforge.net/"}]}, {"text": ["Emacs and Vim are very powerful and general, but have a steep learning curve.", "If you want to use Emacs, I highly recommend python mode; it's much better than the default Python mode."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "python mode", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://sourceforge.net/projects/python-mode/"}]}], [{"text": ["A matter of habit and personal preferences.", "Me, I use vim (I have to admit emacs is at least as powerful, but my fingers are deeply trained by over 30 years of vi, and any other editor gives me the jitters, especially when it tries to imitate vi and never really manages to get it 100% right;-), occasionally an interactive environment (python itself, sometimes ipython), and on even rarer occasions a debugger (pdb).", "A good editor gives me all I need in term of word completion, lookup, &amp;c."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "especially", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["I've tried Eclipse, its plugins, eric, and Kommodo, but I just don't like them -- Wing, I think I could get used to, and I have to admit its debugger is absolutely out of this world... but, I very rarely use (or need!", ") advanced debugging functionality, so after every rare occasion I'd forget, and have to learn it all over again a few months later when the need arose again... nah!-)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Not very, IMHO.", "It's a lightweight language with much less boilerplate and simpler idioms than in some other languages, so there's less need for an IDE for that part. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The standard interactive interpreter provides help and introspection functionality and a reasonable debugger (pdb).", "When I want a graphical look at my class hierarchies, I use epydoc to generate it. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The only IDE-like functionality I sometimes wish I had is something that would help automate refactoring. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So I hear.", "Some of my coworkers use Wing."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["N/A.", "I tried using Wing a few times but found that it interfered with my normal development process rather than supporting it."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["The IDE you use is a personal and subjective thing, but it definitely matters.", "Personally, for writing short scripts or working with python interactively, I use PyDee available at http://pydee.googlecode.com/ .", "It is well done, fairly lightweight, but with good introspection capabilities. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://pydee.googlecode.com/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://pydee.googlecode.com/"}]}, {"text": ["For larger projects involving multiple components, I prefer Eclipse with appropriate plugins.", "It has very sophisticated management and introspection capabilities.", "You can download it separately or get it as part of Python (X,Y) at http://www.pythonxy.com/ ."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.pythonxy.com/", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.pythonxy.com/"}]}], [{"text": ["In contrast to the other answers i think that IDE's are very important especially for script languages.", "Almost all code is bad documentated and an IDE with a good debugger gives you much insides about what is really going on what datatypes are assigned to this values.", "Is this a hash of lists of hashes or a list of hashs of hashs. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And the easy documentation lookup will save you time."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But this is only important for people who need to count there time, this normally excludes beginners or hobbyists."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["(1) IDEs are less important than for other languages, but if you find one that is useful, it still makes things easier.", "Without IDEs -- what are doing?", "Always running Python from command line?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["(2-3) On my Mac there's included IDLE which I keep always open for its Python shell (it's colored unlike the one in Terminal) and I use free Komodo Edit which I consider to be well-suited for Python as it doesn't go into the language deeply but rather focuses on coloring, tab management, parsing Python output, running frequent commands etc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]