[[{"text": ["[This may come off sounding more negative than it really is.", "I'm not saying Basic is the root of all evil, others have said that.", "I'm saying it's a legacy we can afford to leave behind."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "others have said that", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikiquote.org/wiki/Edsger_Dijkstra"}]}, {"text": ["\"because it was so easy to understand and so hard to make a mistake\" That's certainly debatable.", "I've had some bad experiences with utterly opaque basic.", "Professional stuff -- commercial products -- perfectly awful code.", "Had to give up and decline the work."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "\"because it was so easy to understand and so hard to make a mistake\"", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["\"What, if any, are the advantages Basic has over other languages?", "\"  None, really."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "\"What, if any, are the advantages Basic has over other languages?\"", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["\"Why is it still around?", "\"  Two reasons: (1) Microsoft, (2) all the IT departments that started doing VB and now have millions of lines of VB legacy code."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "\"Why is it still around?\"", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["\"Plenty of other languages are considered dead...\"  Yep.", "Basic is there along side COBOL, PL/I and RPG as legacies that sometimes have more cost than value.", "But because of the \"if it ain't broke don't fix it\" policy of big IT, there they sit, sucking up resources who could easily replace it with something smaller, simpler and cheaper to maintain.", "Except it hasn't \"failed\" -- it's just disproportionately expensive."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "\"Plenty of other languages are considered dead...\"", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["30-year old COBOL is a horrible situation to rework.", "Starting in 2016 we'll be looking at 30-year old MS Basic that we just can't figure out, don't want to live without, and can't decide how to replace."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["\"but basic just keeps hanging on\" It appears that some folks love Basic.", "Others see it as yet another poorly-designed language; it's advantages are being early to market and being backed by huge vendors (IBM, initially).", "Poorly-design, early-to-market only leaves us with a legacy that we'll be suffering with for decades."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "\"but basic just keeps hanging on\"", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["I still have my 1965-edition Dartmouth Basic manual.", "I don't long for the good old days."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["As an architecture, the main claim to fame of BASIC is that you could make BASIC interpreters very small - just a few KB.", "In the days of a DG Nova this was a win as you could use systems like Business BASIC to build a multiuser application on a machine with 64K of RAM (or even less)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["BASIC (VB in particular) is a legacy system and has a large existing code-base.", "Arguably VB is really a language (some would say a thin wrapper over COM) that has a BASIC-like syntax.", "These days, I see little reason to keep the language around apart from people's familiarity with it and to maintain the existing code base.", "I certainly would not advocate new development in it (note that VB.Net is not really BASIC but just has a VB-like syntax.", "The type system is not broken in the way that VB's was."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["What is missing from the computing world is a relevant language that is easy to learn and tinker with and has mind-share in mainstream application development.", "I grew up in the days of 8-bit machines, and the entry barrier to programming on those systems was very low.", "The architecture of the machines was very simple, and you could learn to program and write more-or-less relevant applications on these machines very easily."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "is", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "relevant", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["Modern architectures are much more complex and have a bigger hump to learn.", "You can see people pontificating on how kids can't learn to program as easily as they could back in the days of BASIC and 8-bit computers and I think that argument has some merit.", "There is something of a hole left that makes programming just that bit harder to get into.", "Toy languages are not much use here - for programming to be attractive it has to be possible to aspire to build something relevant with the language you are learning."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["This leads to the problem of a language that is easy for kids to learn but still allows them to write relevant programmes (or even games) that they might actually want.", "It also has to be widely perceived as relevant."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The closest thing I can think of to this is Python.", "It's not the only example of a language of that type, but it is the one with the most mind-share - and (IMO) a perception of relevance is necessary to play in this niche.", "It's also one of the easiest languages to learn that I've experienced (of the 30 or so that I've used over the years)."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Why not give Jumentum a try and see how it works for you?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://jumentum.sourceforge.net/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://jumentum.sourceforge.net/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://jumentum.sourceforge.net/"}]}, {"text": ["it's an open source BASIC for micrcontrollers"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The elua project is also lua for microcontrollers"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["http://elua.berlios.de/"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://elua.berlios.de/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://elua.berlios.de/"}]}], [{"text": ["Good question..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Basically (sic!", "), I have no answer.", "I would say just that Lua is very easy to learn, probably as easy as Basic (which was one of my first languages as well, I used dialects on lot of 8-bit computers...), but is more powerful (allowing OO or functional styles and even mixing them) and somehow stricter (no goto...)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I don't know well Python, but from what I have read, it is as easy, powerful and strict than Lua."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Beside, both are \"standardized\" de facto, ie.", "there are no dialects (beside the various versions), unlike Basic which has many variants."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Also both have carefully crafted VM, efficient, (mostly) bugless.", "Should you make your own interpretor, you should either take an existing VM and generate bytecode for it from Basic source, or make your own.", "Sure fun stuff, but time consuming and prone to bugs..."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["So, I would just let Basic have a nice retirement... :-P"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["PS.", ": Why it is hanging on?", "Perhaps Microsoft isn't foreign to that... (VB, VBA, VBScript...)\nThere are also lot of dialects around (RealBasic, DarkBasic, etc.", "), with some audience."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}], [{"text": ["At the risk of sounding like two old-timers on rocking chairs, let me grumpily say that \"Kids today don't appreciate BASIC\" and then paradoxically say \"They don't know how good they've got it.", "\" "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["BASICs greatest strength was always its comprehensibility.", "It was something that people could get.", "That was long ignored by academics and language developers. "], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "always", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "get", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["When you talk about wanting to implement BASIC, I assume you're not talking about line-numbered BASIC, but a structured form.", "The problem with that is that as soon as you start moving into structured programming -- functions, 'why can't I just GOTO that spot?", "', etc.", "-- it really becomes unclear what advantages, if any, BASIC would have over, say, Python."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "can't", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Additionally, one reason BASIC was \"so easy to get right\" was that in those days libraries weren't nearly as important as they are today.", "Libraries imply structured if not object-oriented programming, so again you're in a situation where a more modern dynamic scripting language \"fits\" the reality of what people do today better."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If the real question is \"well, I want to implement an interpreter and so it comes down to return on investment,\" then it becomes a problem of an grammar that's actually easy to implement.", "I'd suggest that BASIC doesn't really have that many advantages in that regard either (unless you really do return to line numbers and a very limited grammar).  "], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "do", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["In short, I don't think you should invest your effort in a BASIC interpreter. "], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "don't", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Well, these people seem to think that not only basic still has a place in the mobile space but also that they can make money off it:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.nsbasic.com/symbian/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.nsbasic.com/symbian/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.nsbasic.com/symbian/"}]}], [{"text": ["BASIC persists, particularly in the STAMP implementation, because it is lower level than most other very-easy-to-learn programming languages.", "For most embedded BASIC implementations the BASIC instructions map directly to single or groups of machine instructions, with very little overhead.", "The same programs written in \"higher level\" languages like Lua or Python would run far slower on those same microcontrollers."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PS: BASIC variants like PBASIC have very little in common with, say, Visual BASIC, despite the naming similarity.", "They have diverged in very different ways."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I started out on a ZX81 too.", "But as Tony Hoare said, programming in BASIC is like trying to do long division using roman numerals."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Tony Hoare", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/C._A._R._Hoare"}]}, {"text": ["Sadly yes.", "I blame Bill Gates for this...BASIC was on a stretcher with a priest saying the last rites for it, and then MS brought it back like Smallpox."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I used to program in BASIC in the QBasic days.", "QBASIC had subroutines, functions, structures (they used to be called types), and I guess that's it.", "Now, this seems limited compared to all the features that Python has - OO, lambdas, metaclasses, generators, list comprehensions, just to name a few off the top of my head.", "But that simplicity, I think, is a strength of BASIC.", "If you're looking at a simple embeddable language, I'd bet that QBasic will be faster and easier to understand.", "And a procedural langauge is probably more than sufficient for most embedding/scripting type of applications."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I'd say the most important reason BASIC is still around is Visual Basic.", "For a long time in the 90s, VB was the only way to write GUIs, COM and DB code for Windows without falling into one of the C++ Turing tarpits.", "[Maybe Delphi was a good option too, but unfortunately it never became as popular as VB].", "I do think it is because of all this VB and VBA code that is still being used and maintained that BASIC still isn't dead. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["That said, I'd say there's pretty a good rationale to write BASIC interpreter (maybe even compiler using LLVM or something similar) for BASIC today.", "You'll get a clean, simple easy to use and fast language if you implement something that resembles QBasic.", "You won't have to solve any language design issues and the best part is people will already know your language."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]