[[{"text": ["In brief:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["Lua gives you a smaller, simpler system that you can understand in its entirety, but it is in a much smaller ecosystem; Kepler is all you get, and you will probably have to build some of your own stuff.", "I find this easy and fun (I make heavy use of the Lua bindings to the Expat parser and the Lua Object Model, which are part of Kepler), but others may prefer to use what everyone else is using."], "childNum": 4, "tag": "p", "senID": 1, "childList": [{"text": "you can understand in its entirety", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "much smaller ecosystem", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "Lua bindings to the Expat parser", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.keplerproject.org/luaexpat/index.html"}, {"href": "http://www.keplerproject.org/luaexpat/lom.html", "text": "Lua Object Model", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["PHP started out as more of a macro processor than a language, and although it has improved over the years, when people say \"X has really gotten a lot better\", I tend to be wary of&nbsp;X.  I&nbsp;find PHP offputting, but there is a huge ecosystem for web development."], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "X", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "X", "childNum": 0, "tag": "em", "childList": []}, {"text": "huge ecosystem", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["Python is a nice language but much bigger than Lua, and in the throes of a major revision (transition from 2.5 to 3.x).", "Again you get a big ecosystem; the problem I have with Python is that the language and system are too big for any one person to understand all of.", "I&nbsp;don't like to be in this situation if I don't have to."], "childNum": 3, "tag": "p", "senID": 3, "childList": [{"text": "much", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "big ecosystem", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}, {"text": "the language and system are too big for any one person to understand all of", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Ruby is a bit of a cleaner language design, and the large Rails ecosystem is a winner.", "Ruby is less complex than Python but more complex than Lua.", "Rails is a bit of a beast."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Rails ecosystem is a winner", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}]}, {"text": ["It comes down to this question:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["Would you rather understand all the software in your system, even if you have to build a lot of things yourself?"], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "all", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Or would you rather have a lot of things already built for you, even if you wind up not understanding exactly how every piece works?"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]}, {"text": ["If you want to understand everything, Lua is your game.", "If you want a lot of stuff already built for you, I&nbsp;can't advise you how to pick among PHP/Python/JSP/Rails and so on."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["More on Lua and Python at Which language is better to use, Lua or Python?"], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "Which language is better to use, Lua or Python?", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/356160/which-game-scripting-language-is-better-to-use-lua-or-python"}]}], [{"text": ["Using Lua for web development is pretty rare...you could do it, but it will be a lot more time consuming than using a language that has matured as a web developing language (PHP) or has good web related libraries (python/ruby/etc.", ")  If you do go with Lua, this means you may end up \"recreating the wheel\" a lot for what may be easily available in mature web languages."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "could", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["The better question is, what does Lua offer that you need which is not offered in the other languages you listed?", "Or do you want to help Lua become a better web development platform by creating a Lua MVC framework like Rails did for Ruby?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Python and Lua are my two favorite languages."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Lua is nice, but can be more work as a language in my experience.", "There are many things you need to implement yourself in Lua, starting with inheritance.", "I find Python superior to Lua in most respects, but Lua is fast, small, and great for certain, usually embedded, solutions."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think Python's a good choice because it's a great language, but it has traditionally been more work than it should be to use for web development.", "Maybe things like Django change that, but I was fond of Pylons when I last looked into Python for web development.", "When I next do web development I will use Python.", "I've done it already, but always using a different platform/framework, so it hasn't been consistent."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["PHP is great for web development, but not a great language.", "It is heavily integrated and can create solid applications, with great support and cheap hosting.", "I used to do a lot of PHP web development, and have had PHP hosting with pair.com for many years.", "I like the overall simplicity of the whole system even if the language can be hard on my wrists."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["JSP is overkill."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["The Kepler project is probably the best known starting point for web application development in Lua.", "They have a mailing list whose archives will have a lot of discussion of the merits of various approaches."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Kepler project", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.keplerproject.org/"}, {"text": "mailing list", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.keplerproject.org/en/Mailing%5FList"}]}, {"text": ["The Kepler site is itself built in a CMS framework called Sputnik written almost entirely in Lua, and based on the Kepler project."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Sputnik", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://sputnik.freewisdom.org/"}]}, {"text": ["The typical approach with Lua is to use a language suited to interfacing to various system components to implement those interfaces, and to use Lua for business logic and glue.", "Kepler provides libraries written largely in C that provide access to file systems, databases, and the network to Lua code.", "It also provides a defined API layer to interface with the web server, with implementations for Apache, any CGI capable server, and Xavante which is a complete web server implemented mostly in Lua."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["i'm coming a little late ... but i wanted to throw in another language: haXe"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "haXe", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://haxe.org"}]}, {"text": ["why?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["the biggest flaw about haXe is, that it allows untyped coding, at the cost of platform specific execution of untyped code ... when well typed (which is not a lot of work with haXe in fact), code will be executed the same way on all platforms ... if not, result vary depending on runtime handling of the platform itself ..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["to put it in a few words: it's a great language, that allows you to target many platforms ... it's young, it's growing, and you can participate ..."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["If it's only the language, then I agree with Norman.", "If the web development framework is important to you, then you have to consider Ruby because RoR is a very mature framework.", "I love Python, but there seems to be quite a few frameworks to choose from, none of them is dominant.", "CherryPy, Django, Pylons, web2py, Zope 2, Zope 3, etc.", "One important indicator to me is that there are more RoR jobs on the market than any other (language, framework)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["As far as Lua web frameworks, there is also LuCI.", "It is mostly used for small embedded systems.", "We're just starting a project using it, so I can't comment on it too much right now.", "We're just doing some simple configuration screens similar to what is already provided as examples, so I'm sure it will be sufficient for our needs."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "LuCI", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://luci.freifunk-halle.net/"}]}], [{"text": ["Kepler is not the only option, give a try to http://gitorious.org/nutria, might help you to understand why PHP is widely used."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://gitorious.org/nutria", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://gitorious.org/nutria"}]}], [{"text": ["&lt;% ASP SUX %>\n"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["no real web designer has ever created a significant interactive website with Lua."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It is good for a few small projects, great for scripting in a program... horrible for web design."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Stick with the known open source stuff."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]