[[{"text": ["There are none.", "This is what modules are for: grouping related functions.", "Using a class full of static methods makes me cringe from Javaitis.", "The only time I would use a static function is if the function is an integral part of the class.", "(In fact, I'd probably want to use a class method anyway."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["No.", "It would be better to make them functions and if they are related, place them into their own module.", "For instance, if you have a class like this:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class Something(object):\n\n    @staticmethod\n    def foo(x):\n        return x + 5\n\n    @staticmethod\n    def bar(x, y):\n        return y + 5 * x\n</code>\n</pre>\n", "senID": 1}, {"text": ["Then it would be better to have a module like,"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n # something.py\n\ndef foo(x):\n    return x + 5\n\ndef bar(x, y):\n    return y + 5 * x\n</code>\n</pre>\n", "senID": 3}, {"text": ["That way, you use them in the following way:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n import something\nprint something.foo(10)\nprint something.bar(12, 14)\n</code>\n</pre>\n", "senID": 5}, {"text": ["Don't be afraid of namespaces.", ";-)"], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": ";-)", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["If your functions are dependent on each other or global state, consider also the third approach:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class Something(object):\n    def foo(self, x):\n        return x + 5\n\n    def bar(self, x, y):\n        return y + 5 * self.foo(x)\n\nsomething = Something()\n</code>\n</pre>\n", "senID": 1}, {"text": ["Using this solution you can test a function in isolation, because you can override behavior of another function or inject dependencies using constructor. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I agree with Benjamin.", "Rather than having a bunch of static methods, you should probably have a bunch of functions.", "And if you want to organize them, you should think about using modules rather than classes.", "However, if you want to refactor your code to be OO, that's another matter."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Not only are there no advantages, but it makes things slower than using a module full of methods.", "There's much less need for static methods in python than there is for them in java or c#, they are used in very special cases."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Classes are only useful when you have a set of functionality than interacts with a set of data (instance properties) that needs to be persisted between function calls and referenced in a discrete fashion."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If your class contains nothing other than static methods, then your class is just syntactic cruft, and straight functions - possibly with module globals, only if necessary - are clearer and all that you need."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Depends on the nature of the functions.", "If they're not strongly unrelated (minimal amount of calls between them) and they don't have any state then yes I'd say dump them into a module.", "However, you could be shooting yourself in the foot if you ever need to modify the behavior as you're throwing inheritance out the window.", "So my answer is maybe, and be sure you look at your particular scenario rather then always assuming a module is the best way to collect a set of methods."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "maybe", "childNum": 0, "tag": "strong", "pos": 3, "childList": []}]}]]