[[{"text": ["There is a framework that you may be interested in: Twisted"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Twisted", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com"}]}], [{"text": ["As previously mentioned, Twisted is the most popular (by far).", "However, there are a lot of other alternative worth exploring.", "Tornado and Diesel are probably the top two contenders.", "A more complete comparison is found here."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Tornado", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.tornadoweb.org/"}, {"text": "Diesel", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://dieselweb.org/"}, {"text": "is found here", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://nichol.as/asynchronous-servers-in-python"}]}], [{"text": ["the answer depends on what you are trying to do."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["\"What library should I use for network programming?", "\" is pretty vague."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["for example, if you want to do HTTP, you might look at such standard libraries as urllib, urllib2, httplib, sockets.", "It all depends on which protocol you are looking to use, and which network layer you want to work at."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["there are libraries in python for various network tasks... email, web, rpc, etc etc..."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["for starters, look over the standard library reference manual and see which tasks you want to do, then go from there: http://docs.python.org/library/index.html"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://docs.python.org/library/index.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/index.html"}]}], [{"text": ["Personally I just use asyncore from the standard library, which is a bit like a very cut-down version of Twisted, but this is because I prefer a simple and low level interface.", "If you want a higher level interface, especially just to communicate with another instance of your own program, you don't necessarily have to worry about the networking layer, and can consider something higher level like RPyC or pyro instead.", "The network then becomes an implementation detail and you can concentrate on just sending the information."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "RPyC", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://rpyc.wikidot.com/"}, {"text": "pyro", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://pyro.sourceforge.net/"}]}], [{"text": ["You just want to send python data between nodes (possibly on separate computers)?", "You might want to look at SimpleXMLRPCServer.", "It's based on the inbuilt HTTP server, which is based on the inbuilt Socket server, neither of which are the most industrial-strength servers around, but it's easy to set up in a hurry:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n from SimpleXMLRPCServer import SimpleXMLRPCServer\nserver = SimpleXMLRPCServer((\"localhost\", 9876))\n\ndef my_func(a,b):\n    return a + b\n\nserver.register_function(my_func)\nserver.serve_forever()\n</code>\n</pre>\n", "senID": 1}, {"text": ["And easy to connect to:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n import xmlrpclib\ns = xmlrpclib.ServerProxy('http://localhost:9876')\n\nprint s.my_func(2,3) \n&gt;&gt;&gt; 5\nprint type(s.my_func(2,3))\n&gt;&gt;&gt; &lt;type 'int'&gt;\nprint s.my_func(2,3.0):\n&gt;&gt;&gt; 7.0\n</code>\n</pre>\n", "senID": 3}, {"text": ["Twisted is popular for industrial applications, but it's got a brutal learning curve. "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["A lot of people like Twisted.", "I was a huge fan for awhile, but on working with it a bit and thinking about it more I've become disenchanted.", "It's complex, and last I looked, a lot of it had the assumption that your program would always be able to send data leading to possible situations in which your program grows memory usage endlessly buffering data to send that isn't being picked up by the remote side or isn't being picked up fast enough."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Twisted", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/"}, {"text": "always", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}, {"text": ["In my opinion, it depends a lot on what kind of network programming you want to do.", "A lot of times you don't really care about getting stuff done while you're waiting for IO.", "HTTP, for example, is very request-response oriented, and if you're only talking to a single server there is little reason to need something like Twisted and plain sockets or Python's built-in HTTP libraries will work fine."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you're writing a server of any kind, you almost certainly need to be event-driven.", "Twisted has a slight edge there, but it still seems overly complex to me.", "Bittorrent, for example, was written in Python and doesn't use Twisted at all."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Another factor favoring Twisted is that there is code for a lot of protocols already written for it.", "So if you want to speak an existing protocol a lot of hard work may already have been done for you."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The socket module in the standard lib is in my opinion a good choice if you don't need high performance."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "socket", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["It is a very famous API that is known by almost every developpers of almost every languages.", "It's quite sipmple and there is a lot of information available on the internet.", "Moreover, it will be easier for other people to understand your code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I guess that an event-driven framework like Twisted has better performance but in basic cases standard sockets are enough."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Of course, if you use a higher-level protocol (http, ftp...), you should use the corresponding implementation in the python standard library."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]