[[{"text": ["Use sqlalchemy.", "On any framework you choose.", "It can reflect your database as ORM."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "sqlalchemy", "tag": "a", "pos": 0, "childList": [{"text": "sqlalchemy", "tag": "code"}], "childNum": 1, "href": "http://www.sqlalchemy.org"}, {"text": "sqlalchemy", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}], [{"text": ["I’m currently rebuilding a legacy PHP web application with a MySQL database my self. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The PHP code was kind of spaghetti and is now rewritten in Java as it type safe, promotes well-structured code, has excellent tooling and has superior unit testing capabilities.", "For database to Java mapping I use Hibernate/JPA. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The web application is incrementally delivered to production.", "Meaning we run both Java and large parts of the old PHP code together until the application is fully converted."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["But in order to use hibernate effectively we needs the database to be logical correct (something MySQL MyIsam does not enforce).", "So with each production release I run an refactoring scripts for the database (also used to build the development environment and do unit testing) and update the PHP code with a new version that works with the schema changes. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["As a web framework I use Stripes as it’s simple, elegant and easy to learn."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Stripes", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.stripesframework.org/"}]}], [{"text": ["I suppose that any PHP Framework (I'm a PHP guy, so I will only talk about PHP) could be OK for you ; but you should use one that's well-supported, has a large community, ..."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "(I'm a PHP guy, so I will only talk about PHP)", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["To make things short, I'm thinking about one off this list :"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": ["Symfony"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}, {"text": ["Zend Framework"], "childNum": 0, "tag": "a", "senID": 3, "childList": []}, {"text": ["CakePHP"], "childNum": 0, "tag": "a", "senID": 4, "childList": []}, {"text": ["Kohana"], "childNum": 0, "tag": "a", "senID": 5, "childList": []}, {"text": ["Code Igniter"], "childNum": 0, "tag": "a", "senID": 6, "childList": []}]}, {"text": ["\nNow, if you're asking \"which framework is the best\", it's a question that doesn't really have an answer : it's mainly a matter of personnal preferences..."], "childNum": 2, "tag": "p", "senID": 7, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}, {"text": "which framework is the best", "childNum": 0, "tag": "em", "childList": []}]}, {"text": ["Still, here's a couple of questions+answers that could bring you some interesting informations :"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": ["Best PHP framework for an experienced PHP developer?"], "childNum": 0, "tag": "a", "senID": 9, "childList": []}, {"text": ["What PHP framework would you choose for a new application and why?"], "childNum": 0, "tag": "a", "senID": 10, "childList": []}, {"text": ["To use a PHP framework or not?"], "childNum": 0, "tag": "a", "senID": 11, "childList": []}, {"text": ["PHP Framework Decision - Analysis paralysis!"], "childNum": 0, "tag": "a", "senID": 12, "childList": []}, {"text": ["PHP - MVC framework?"], "childNum": 0, "tag": "a", "senID": 13, "childList": []}, {"text": ["Which PHP Framework is right for this project?"], "childNum": 0, "tag": "a", "senID": 14, "childList": []}]}, {"text": ["Also, note that choosing a Framework is an important decision -- which means you should take some time to evaluate each framework and how it'll answer your specific need."], "childNum": 0, "tag": "p", "senID": 15, "childList": []}, {"text": ["Really : you should definitely not rush that decision."], "childNum": 0, "tag": "p", "senID": 16, "childList": []}], [{"text": ["I have very good experience with Django.", "Every time I needed it was up to the task for interfacing with existing database. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Autogenerated models are the start, as MySQL is not the strictest with its schema.", "Not that it will not work only that usually some of the db restrictions are held in app itself."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["My first thought would be to use Hibernate and Java, but I may be biased because that is what my experience is in.", "You generally map your Model classes via Hibernate after you create the database anyway, so it might not be a bad choice."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I'll let it explain itself to you: Hibernate's website"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Hibernate's website", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.hibernate.org/"}]}], [{"text": ["You know, there's a whole Ruby web dev world away from Rails, e.g."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Sinatra"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": ["Ramaze"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}, {"text": ["Webby"], "childNum": 0, "tag": "a", "senID": 3, "childList": []}]}, {"text": ["With such a general question it's always a bit hard to help..."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Try web2py, extremely easy to prototype any webapp, and IMO a bit easier to grasp (overall) than other similar web frameworks, HTH"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "web2py", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.web2py.com/"}]}], [{"text": ["There are no clear cut winners when picking a web framework.", "Each platform you mentioned has its benefits and drawbacks (cost of hardware, professional support, community support, etc.).", "Depending on your time table, project requirements, and available hardware resources you are probably going to need some different answers.Personally, I would start your investigation with a platform where you and your team are most experienced. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Like many of the other posters I can only speak to what I'm actively using now, and in my case it is Java.", "If Java seems to match your projects requirements, you probably want to go with one of the newer frameworks with an active community.", "Currently Spring Web MVC, Struts2, and Stripes seem to be fairly popular.", "These frameworks are mostly, if not totally, independent of the persistence layer, but all integrate well with technologies like hibernate and jpa; although you have to do most, if not all, of the wiring yourself. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you want to take the Java road there are also pre-built application stacks that take care of most of wiring issues for you.", "For an example you might want to look at Matt Raible's AppFuse.", "He has built an extensible starter application with many permutations of popular java technologies."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you are interested in the JVM as a platform, you may also want to look at complete stack solutions like Grails, or tools that help you build your stack quickly like Spring Roo. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Almost all of the full stack solutions I've seen allow for integration with a legacy database schema.", "As long as your database is well designed, you should be able to map your tables.", "The mention of composite keys kind of scares me, but depending on your persistence technology this may or may not be an issue.", "Hibernate in Java/.NET supports mapping to composite keys, as does GORM in grails (built on hibernate).", "In almost all cases these mappings are discouraged, but people who build persistence frameworks know you can't always scorch earth and completely recreate your model. "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]