[[{"text": ["Pick up one of the many CMS projects in Django, like Mezzanine or Pinax, or Django cms or any of a number of others see http://oswco.com/2011/may/20/cms-frameworks-what-use-django-vs-drupal/ for a more complete set of references or discussions.", "You will be way happier and in something that can be more easily scaled and modified to be what you really want.", "There is even a Django based Stack-overflow clone that you can pick up and integrate if you need."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://oswco.com/2011/may/20/cms-frameworks-what-use-django-vs-drupal/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://oswco.com/2011/may/20/cms-frameworks-what-use-django-vs-drupal/"}]}], [{"text": ["Use a CMS, Drupal is very flexible and you can install another cms like vanilla for the forums  options with a plugin.", "It's al you need.", "But if you want a full control of your site, use a framwork like Django and you get all.", "Remenber, the CMS is the fastest way to build a site.", "Sorry for my english mistakes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["There are multiple forum and CMS projects built on Django.", "If you know Python already, give Django a shot, there is a wealth of tools and add-ons available for it.", "From my experience it doesn't have a very large learning curve at all, especially if you already know Python."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "forum", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://djangopackages.com/grids/g/forums/"}, {"text": "CMS", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.djangopackages.com/grids/g/cms/"}, {"text": "wealth of tools and add-ons", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://djangopackages.com"}]}], [{"text": ["Pinax http://pinaxproject.com/ is just an extension off django (not really a CMS, although you can get an extension called django-cms).", "Pinax is definitely the way to go.", "Use their social networking build (the standard option), and then just hack away any unnecessary features (map, etc.", ")  Very quick and easy.", "CMSes (you mean tools like Plone, right?", ") have wayyy too much overhead for what you are trying to do.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://pinaxproject.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pinaxproject.com/"}]}], [{"text": ["Personally, I always use Drupal (version 6 that is).", "It includes the required modules for forums and comments, and other ones you might want can be downloaded from Drupal.org."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Drupal.org", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://drupal.org"}]}], [{"text": ["Drupal or Joomla are your best bet.", "Firstly, Joomla allows you to basically drop in these features you're asking for in an install an go manner.", "This is the easiest way to go."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Now if you want a LOTS and LOTS customization and don't mind getting into a little code then drupal will be perfect.The great thing is that the customization possibilities are almost endless!", "The bad thing is that Drupal has a NOTORIOUSLY crazy templating system.", "It's not hard to understand but even simple things can become a real pain.", "But Like joomla you can avoid all this with install and go plugins.", "you'll have the choice."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I don't know too much about wordpress, but having looked at the developer API, it seems to assume volumes about what you intend to build on top of it.", "Which makes it a lot less flexible than drupal and django."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Django, well according to your question... it's everything you don't want.", "Also if you have gone to any of the Django CMS sites you'll see how painful it is to get them up and running.", "That said I'm personally a Django fanatic but I'd rather you dint run into a bad experience with it and have a horrible impression of it.", "so given your question i'd say Drupal!"], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "according to your question", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "given your question", "childNum": 0, "tag": "strong", "pos": 3, "childList": []}]}]]