[[{"text": ["Besides the ones already mentioned I can add:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["Kiwi"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": ["uxpython"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}, {"text": ["pygtk"], "childNum": 0, "tag": "a", "senID": 3, "childList": []}, {"text": ["treethon"], "childNum": 0, "tag": "a", "senID": 4, "childList": []}]}, {"text": ["I've never used any of them so have no recommendations but, for what it's worth, I have used at least 2 complex programs built directly on pygtk that worked in both Windows and Linux."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I think Kiwi is the only one of these with baked in support for db (through interface with SQLAlchemy, SQLObject, or Storm) but I would be surprised if you couldn't use one of those ORM's inside any of the other frameworks."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["PyQt and its models can automate some of these tasks for you (to some amount off course, e.g.", "filling widgets with data from a database and handling most of the widgets behaviour, buffering etc.", ")."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want a more object-oriented approach to handling SQL you could look into an ORM-oriented solution (for example SQLAlchemy)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Dabo is built on top of wxPython, so you may not prefer it, but it's designed to make it easy to tie a GUI to a database, so I'd recommend you check it out if you haven't already.", "In particular, it's got good facilities for tying widgets to data, and handling a lot of the common cases of GUI development."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Dabo", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://dabodev.com/"}]}], [{"text": ["wxGlade may help, although I haven't used it myself so I don't speak from experience."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "wxGlade", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/WxGlade"}]}, {"text": ["Boa Constructor apparently has a wxPython GUI builder in it, and there is also PythonCard, though development on these two projects seems to have stalled."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Boa Constructor", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Boa%5Fconstructor"}, {"href": "http://pythoncard.sourceforge.net/", "text": "PythonCard", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["Traits might be a good option for you.", "http://code.enthought.com/projects/traits/docs/html/TUIUG/index.html"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://code.enthought.com/projects/traits/docs/html/TUIUG/index.html", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://code.enthought.com/projects/traits/docs/html/TUIUG/index.html"}]}, {"text": ["AS simple as it is to map a UI to an object, it doesn't seem too far fetched to incorporate SQLAlchemy for persistence. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["There is a good book on wxPython, \"wxPython in Action\", which can't be said for some of the other solutions.", "No knock on the others.", "I've had success developing with wxPython in the past and it comes with a great set of demo applications with source code from which you can borrow liberally."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The best UI designer I found for wxPython applications is a commercial one, Anthemion DialogBlocks.", "It's by one of the wxPython programmers and is worth the money.", "Other solutions for UI design include wxGlade (I found it usable but not featureful) and Boa Constructor (haven't used it).", "Wing IDE might also have one.", "Stani's Python Editor bundles wxGlade, I believe.", "There are a lot of other projects that don't really work or are fairly old."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As far as SQL automation goes, as another answerer says, I'd look at SQL alchemy, but the learning curve for a small application might be too much and you'd be better off just going straight to odbc.", "The best odbc api is the one used by Django, pyodbc."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It's been a while since I developed with these tools, so there may be something newer for each, but at the time these were definitely the best of breed in my opinion."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I had lots of success with wxPython, but that was some years ago now and there may be better new solutions..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Ok this is an unconventional solution but write yourself a code generator.", "I have done this several times using Mako.", "So in my case I auto inspect a table which columns it contains and types and generate classes from that.", "It's more work upfront but does exactly what you want and is reusable in subsequent projects."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Mako", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.makotemplates.org/"}]}]]