[[{"text": ["Static methods were added to Python long after classes were (classes were added very early on, possibly even before 1.0; static methods didn't show up until sometime about 2.0).", "They were implemented as a modification of normal methods &mdash; you create a static method object from a function to get a static method, whereas the compiler generates instance methods by default."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As with many things in Python, static methods got introduced and then refined as people used them and wanted better syntax.", "The initial round was a way of introducing the semantics without adding new syntax to the language (and Python is quite resistant to syntax changes).", "I'm not Guido, so I'm not exactly sure what was going on in his head and this is somewhat speculative, but Python tends to move slowly, develop incrementally, and refine things as they gain more experience with them (in particular, they don't like adding something until they've figured out the right way to do it.", "This could have been why there wasn't special syntax for static methods from the beginning)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As mjv indicated, though, there is an easier way now, through some syntax sugar added in 2.2 or 2.3 called \"decorators\":"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n @staticmethod\ndef mystaticmethod(params)\n    ...\n    return\n</code>\n</pre>\n", "senID": 3}, {"text": ["The @staticmethod syntax is sugar for putting mystaticmethod = staticmethod(mystaticmethod) after the method definition."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "@staticmethod", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "mystaticmethod = staticmethod(mystaticmethod)", "childNum": 0, "tag": "code", "childList": []}]}], [{"text": ["voyager and adurdin do a good job, between them, of explaining what happened: with the introduction of new-style classes and descriptors in Python 2.2, new and deep semantic possibilities arose -- and the most obviously useful examples (static methods, class methods, properties) were supported by built-in descriptor types without any new syntax (the syntax @foo for decorators was added a couple releases later, once the new descriptors had amply proven their real-world usefulness).", "I'm not really qualified to channel Guido (where's Tim Peters when you need him!-), but I was already a Python committer at the time and participated in these developments, and I can confirm that's indeed what happened."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "without any new syntax", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "@foo", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["voyager's observation on this reminding him of C is right on-target: I've long claimed that Python captures more of the \"Spirit of C\" than any of the languages who have mimicked the syntax of C (braces, parentheses after if/while, etc).", "\"The spirit of C\" is actually described in the (non-normative) Rationale part of the ISO C Standard, and comprises five principles (none of which requires braces!-) of which I claim Python matches 4.5 (there are several videos on the web of presentations of mine on \"Python for Programmers\" where I cover this if you're curious)."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "syntax", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["In particular, the Spirit of C's \"provide only one way to do an operation\" matches the Zen of Python's \"There should be one-- and preferably only one --obvious way to do it\" -- and C and Python, I believe, are the only two widespread languages to explicitly adopt such a design ideal of uniformity and non-redundancy (it's an ideal, and can't be sensibly reached 100% -- e.g.", "if a and b are integers, a+b and b+a had BETTER be two identically-obvious ways to get their sum!-) -- but it's a goal to aim for!-)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Static methods in python date back to the introduction of the so-called “new-style classes” in Python 2.2.", "Previous to this, methods on classes were just ordinary functions, stored as attributes on the class:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class OldStyleClass:\n    def method(self):\n        print \"'self' is just the first argument of this function\"\n\ninstance = OldStyleClass()\nOldStyleClass.method(instance) # Just an ordinary function call\nprint repr(OldStyleClass.method) # \"unbound method...\"\n</code>\n</pre>\n", "senID": 1}, {"text": ["Method calls on instances were specially handled to automatically bind the instance to the first argument of the function:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n instance.method() # 'instance' is automatically passed in as the first parameter\nprint repr(instance.method) # \"bound method...\"\n</code>\n</pre>\n", "senID": 3}, {"text": ["In Python 2.2, much of the class system was rethought and reengineered as “new-style classes”—classes that inherit from object.", "One of the features of new-style classes was “descriptors”, essentially an object in a class that is responsible for describing, getting, and setting the class's attributes.", "A descriptor has a __get__ method, that gets passed the class and the instance, and should return the requested attribute of the class or instance."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "object", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "__get__", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["Descriptors made it possible to use a single API to implement complex behaviour for class attributes, like properties, class methods, and static methods.", "For example, the staticmethod descriptor could be implemented like this:"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "staticmethod", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"code": "<pre>\n<code>\n class staticmethod(object):\n    \"\"\"Create a static method from a function.\"\"\"\n\n    def __init__(self, func):\n        self.func = func\n\n    def __get__(self, instance, cls=None):\n        return self.func\n</code>\n</pre>\n", "senID": 6}, {"text": ["Compare this with a hypothetical pure-python descriptor for an ordinary method, which is used by default for all plain functions in the classes attributes (this is not exactly what happens with method lookup from an instance, but it does handle the automatic 'self' argument):"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"code": "<pre>\n<code>\n class method(object):\n    \"\"\"Create a method from a function--it will get the instance\n    passed in as its first argument.\"\"\"\n\n    def __init__(self, func):\n        self.func = func\n\n    def __get__(self, instance, cls=None):\n        # Create a wrapper function that passes the instance as first argument\n        # to the original function\n        def boundmethod(*args, **kwargs):\n            return self.func(self, *args, **kwargs)\n        return boundmethod\n</code>\n</pre>\n", "senID": 8}, {"text": ["So when you write method = staticmethod(method), you are actually creating a new descriptor whose job it is to return the original function unchanged, and storing this descriptor in the class's \"method\" attribute."], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "method = staticmethod(method)", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["If that seems like a lot of work to go to just to get the original function back—you’re right, it is.", "But since normal method calls are the default case, static methods and class methods need to be implemented separately, and descriptors give a way of enabling these and other complex behaviours with one simple API."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["As others have already pointed out, the decorator syntax introduced in Python 2.4 gives a more convenient way of declaring static methods, but it is just a syntactic convenience, and doesn't change anything of how static methods work."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["See http://www.python.org/doc/2.2.3/whatsnew/sect-rellinks.html and http://users.rcn.com/python/download/Descriptor.htm for more details on the new-style classes and descriptors."], "childNum": 2, "tag": "p", "senID": 12, "childList": [{"text": "http://www.python.org/doc/2.2.3/whatsnew/sect-rellinks.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/doc/2.2.3/whatsnew/sect-rellinks.html"}, {"href": "http://users.rcn.com/python/download/Descriptor.htm", "text": "http://users.rcn.com/python/download/Descriptor.htm", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["Guido has always been wary of adding new constructs to the language.", "When static methods were proposed, it was showed that you could already do it (there is a staticmethod()decorator since 2.2), you just didn't have the syntactic sugar for it."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "you could already do it", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://code.activestate.com/recipes/52304/"}, {"href": "http://www.python.org/dev/peps/pep-0318/#id67", "text": "staticmethod()decorator since 2.2", "childNum": 1, "tag": "a", "childList": [{"text": "staticmethod()", "tag": "code"}]}, {"text": "staticmethod()", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["If you read the PEP you can see all the discussion that goes into adding something.", "I, for one, like that approach.", "It reminds me of C in that there are no unnecessary keywords."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "C", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["When the new syntax for decorators where added to Python 2.4, you could use the existing decorators with a cleaner syntax."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Anyway, they aren't so different if you have to maintain an old system."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n #&gt;2.4\nclass MyClass(object):\n    @staticmethod\n    def mystaticmethod(params)\n        pass\n        return\n\n#&lt;2.4\nclass MyClass(object):\n\n    def mystaticmethod(params)\n        '''Static Method'''\n        pass\n        return\n    staticmethod(mystaticmethod)\n</code>\n</pre>\n", "senID": 4}, {"text": ["I'd recommend you add a comment or docstring to the static method screaming that is a static method."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "screaming", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["Starting in Python 2.4, one can also use a decorator as in:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "decorator", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/dev/peps/pep-0318/"}]}, {"code": "<pre>\n<code>\n @staticmethod\n   def mystaticethod(params)\n      ...\n      return\n</code>\n</pre>\n", "senID": 1}, {"text": ["But I do not have any insight as to the genesis of this feature, as implemented orginially, in the language.", "But then again, I'm not Dutch :-)   Do see Michael E's response in this post, regarding the late arrival of static methods in the evolution of Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["BTW, for all their simplicity, as "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n@MyDeco\n someObject\n\n   is merely \"syntactic sugar\" for\n\n  MyDeco(someObject)\n</pre>\n", "senID": 4}, {"text": ["decorators can be used for many other cool things!"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["The static method situation in Python is a rather direct consequence of the design decisions of first-class everything and everything is an executable statement.", "As others have stated, staticmethod only became available with new semantics allowed by the Python 2.2 descriptor protocol and made syntactically sweeter by function decorators in Python 2.4.", "There's a simple reason why static methods have gotten so little attention - they don't extend the power of the language in any way and make syntax only slightly better.", "Semantically they are the equivalent of plain old functions.", "That's why they were only implemented when the power of the language grew enough to make them implementable in terms of other language features."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "first-class everything", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://python-history.blogspot.com/2009/02/first-class-everything.html"}, {"text": "everything is an executable statement", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://python-history.blogspot.com/2009/03/how-everything-became-executable.html"}]}], [{"text": ["Guido writes the blog The History of Python.", "I think there is a way to contact him with request to expand on this particular topic."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "The History of Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python-history.blogspot.com/"}]}], [{"text": ["Perhaps, the design did not initially think static method is needed when function can be used.", "Since python didn't have data hiding so there is really no need static methods rather than using classes as name spaces."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]