[[{"text": ["If you want to use Python together with the .NET Common Language Runtime, then you want one of:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Python.NET"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": ["IronPython"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}, {"text": ["Boo"], "childNum": 0, "tag": "a", "senID": 3, "childList": []}]}, {"text": ["Using Python in Visual Studio without using the CLR seems like a bit of a waste to me.", "Eclipse with PyDev would be a much better choice."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I find it odd that your friend is against C# but is ok with Visual Studio.", "There is, after all, an open source development environment for .NET called SharpDevelop.", "The C# language is a standard.", ".NET is free (as in beer) and there is an open source implementation of that platform called Mono.", "The only \"un-free\" thing is Visual Studio (though there are \"Express\" versions which are free as in beer)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I don't know why you would want to - perhaps something like IronPython Studio would be a happy medium.", "But as I said I don't know why you would want to use Visual Studio for Python development when there are much better options available."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "IronPython Studio", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.codeplex.com/IronPythonStudio"}, {"text": "much better options available.", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/IntegratedDevelopmentEnvironments"}]}, {"text": ["Always choose the right tool for the right job - just because you can drive a nail with the butt-end of your cordless drill doesn't mean that you should.", "Visual Studio was not designed for Python development and as such will not be a perfect environment for developing in it.", "Please use the list I have linked to choose a more appropriate editor from that list."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As a side note, I am wondering why your PHP friend refuses to use C# (a free, industry standardized language) but is okay using Visual Studio (an expensive, closed-source integrated development environment)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["This has been discussed before in this thread.", "I personally prefer eclipse and pyDev."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "in this thread.", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/537689/python-ide-built-into-visual-studio-2008"}]}], [{"text": ["Firstly, there seems to be a question as to whether python (or various implementations) are as 'powerful' as C#.", "I'm not quite sure what to take powerful to mean, but in my experience of both languages it will be somewhat easier and faster to write a given piece of code in python than in C#.", "C# is faster than cpython (although if speed is desired, the psyco python module is well worth a look)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also I would object to your dismissal of Mono.", "Mono is great on Linux if you write an application for it from scratch.", "It is not really meant to be a compatibility layer between Windows and Linux (see Wine!", "), and if you treat it as such you will only be disappointed."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "if you write an application for it from scratch.", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["It just seems to me that you are taking the wrong approach.", "If you want to convince him that not everything Microsoft is evil, and he is adamant about not learning C#, get him to learn Python (or Ruby, or LUA or whatever) until he is competent, and then introduce him to C# and get him to make his own judgement - I'm fairly in favour of open source, and am far from a rabid Microsoft supporter, but I tried C#, and found I quite liked it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I think that getting him to use python and visual studio in a suboptimal way will turn him against both of them - far from your desired goal!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Go here for a discussion on the Visual Studio IronPython IDEs."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://knowbody.livejournal.com/15675.html"}]}]]