[[{"text": ["You seem to be saying that choosing Django would prevent you from using a more heterogenous solution later.", "This isn't the case.", "Django provides a number of interesting connections between the layers, and using Django for all the layers lets you take advantage of those connections.", "For example, using the Django ORM means that you get the great Django admin app almost for free."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You can choose to use a different ORM within Django, you just won't get the admin app (or generic views, for example) along with it.", "So a different ORM takes you a step backward from full Django top-to-bottom, but it isn't a step backward from other heterogenous solutions, because those solutions didn't give you intra-layer goodness the admin app in the first place."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Django shouldn't be criticized for not providing a flexible architecture: it's as flexible as any other solution, you just forgo some of the Django benefits if you choose to swap out a layer."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you choose to start with Django, you can use the Django ORM now, and then later, if you need to switch, you can change over to SQLalchemy.", "That will be no more difficult than starting with SQLalchemy now and later moving to some other ORM solution."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["You haven't said why you anticipate needing to swap out layers.", "It will be a painful process no matter what, because there is necessarily much code that relies on the behavior of whichever toolset and library you're currently using."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Django will happily let you use whatever libraries you want for whatever you want to use them for -- you want a different ORM, use it, you want a different template engine, use it, and so on -- but is designed to provide a common default stack used by many interoperable applications.", "In other words, if you swap out an ORM or a template system, you'll lose compatibility with a lot of applications, but the ability to take advantage of a large base of applications typically outweighs this."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In broader terms, however, I'd advise you to spend a bit more time reading up on architectural patterns for web applications, since you seem to have some major conceptual confusion going on.", "One might just as easily say that, for example, Rails doesn't have a \"view\" layer since you could use different file systems as the storage location for the view code (in other words: being able to change where and how the data is stored by your model layer doesn't mean you don't have a model layer)."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "have", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["(and it goes without saying that it's also important to know why \"strict\" or \"pure\" MVC is an absolutely horrid fit for web applications; MVC in its pure form is useful for applications with many independent ways to initiate interaction, like a word processor with lots of toolbars and input panes, but its benefits quickly start to disappear when you move to the web and have only one way -- an HTTP request -- to interact with the application.", "This is why there are no \"true\" MVC web frameworks; they all borrow certain ideas about separation of concerns, but none of them implement the pattern strictly)"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "horrid", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["You've effectively got a 3 layer architecture whether you use Django's ORM or SQLAlchemy, though your forgo some of the Django's benefits if you choose the latter."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Not really, Django has its own ORM, so it does separate data from view/controller."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["here's an entry from the official FAQ about MVC:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "entry from the official FAQ", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.djangoproject.com/en/dev/faq/general/#django-appears-to-be-a-mvc-framework-but-you-call-the-controller-the-view-and-the-view-the-template-how-come-you-don-t-use-the-standard-names"}]}], [{"text": ["You seem to be confusing \"separate layers\" with \"separate languages/technologies.", "\"  There is no reason you can't separate your concerns appropriately within a single programming language, or within an appropriately modular framework (such as Django).", "Needlessly multiplying programming languages / frameworks is just needlessly multiplying complexity, which is likely to slow down your initial efforts so much that your project will never reach the point where it needs a technology switch."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["There's change and there's change.", "Django utterly seperates domain model, business rules and presentation.", "You can change (almost) anything with near zero breakage.", "And by change I am talking about meaningful end-user focused business change."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The technology mix-n-match in this (and the previous) question isn't really very helpful. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Who -- specifically -- benefits from replacing Django templates with PHP.", "It's not more productive.", "It's more complex for no benefit.", "Who benefits from changing ORM's.", "The users won't and can't tell. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]