[[{"text": ["You asked for someone who used both Grails and Django.", "I've done work on both for big projects.", "Here's my Thoughts:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["IDE's:\nDjango works really well in Eclipse, Grails works really well in IntelliJ Idea."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "IDE's:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Debugging:\nPractically the same (assuming you use IntelliJ for Grails, and Eclipse for Python).", "Step debugging, inspecting variables, etc... never need a print statement for either.", "Sometimes django error messages can be useless but Grails error messages are usually pretty lengthy and hard to parse through."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Debugging:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Time to run a unit test:\ndjango: 2 seconds.", "Grails: 20 seconds (the tests themselves both run in a fraction of a second, it's the part about loading the framework to run them that takes the rest... as you can see, Grails is frustratingly slow to load)."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Time to run a unit test:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Deployment:\nDjango: copy &amp; paste one file into an apache config, and to redeploy, just change the code and reload apache.", "Grails: create a .war file, deploy it on tomcat, rinse and repeat to redeploy."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Deployment:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Programming languages:\nGroovy is TOTALLY awesome.", "I love it, more so than Python.", "But I certainly have no complaints. "], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Programming languages:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Plugins:\nGrails: lots of broken plugins (and can use every java lib ever).", "Django: a few stable plugins, but enough to do most of what you need."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "Plugins:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Database:\nDjango: schema migrations using South, and generally intuitive relations.", "Grails: no schema migrations, and by default it deletes the database on startup... WTF"], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "Database:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Usage:\nDjango: startups (especially in the Gov 2.0 space), independent web dev shops.", "Grails: enterprise"], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "Usage:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Hope that helps!"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}], [{"text": ["Python has:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So IMHO you shouldn't worry about this things, use Python and Django and live happily :-)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Lucky for you, newest version of Django runs on Jython, so you don't need to leave your whole Java ecosystem behind."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Django runs on Jython", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://blog.leosoto.com/2008/08/django-on-jython-its-here.html"}]}, {"text": ["Speaking of frameworks, I evaluated this year:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["None of this frameworks comes close to the power of Django or Ruby on Rails.", "Based on my collegue opinion I could recommend you kohana framework.", "The downside is, it's written in PHP and, as far as I know, PHP doesn't have superb tools for debugging, profiling and packaging of apps."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "kohana", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.kohanaphp.com/home"}]}, {"text": ["Edit: Here is a very good article about packaging and deployment of Python apps (specifically Django apps).", "It's a hot topic in Django community now."], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "article about packaging and deployment of Python apps", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://bud.ca/blog/pony"}]}], [{"text": ["Grails."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Grails is just looks like Rails (Ruby) but it using groovy which is simple than java.", "It use java technology and you can use any java lib without any trouble."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I also choose grails over simplicity and there are lots of java lib (such as jasper report, jawr etc) and I am glad that now they join with SpringSource which make their base solid."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The \"good deployment\" issue -- for Python -- doesn't have the Deep Significance that it has for Java."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python deployment for Django is basically \"move the files\".", "You can run straight out of the subversion trunk directory if you want to."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You can, without breaking much of a sweat, using the Python distutils and build yourself a distribution kit that puts your Django apps into Python's site-packages.", "I'm not a big fan of it, but it's really easy to do.  "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "distutils", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/dist/dist.html"}]}, {"text": ["Since my stuff runs in Linux, I have simple \"install.py\" scripts that move stuff out of the Subversion directories into /opt/this and /opt/that directories.", "I use an explicit path settings in my Apache configuration to name those directories where the applications live."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "/opt/this", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "/opt/that", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["Patching can be done by editing the files in place.", "(A bad policy.", ")  I prefer to edit in the SVN location and rerun my little install to be sure I actually have all the files under control."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["The statement that grails deletes the database on startup is completely wrong.", "It's behavior on startup is completely configurable and easy to configure.", "I generally use create-drop when running an app in dev mode.", "I use update when I run in test and production."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I also love the bootstrap processing that lets me pre-configure test users, data, etc by environment in Grails.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'd love to see someone who has really built and deployed some commercial projects comment on the pros / cons.", "Be a really interesting read."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["cakephp.org"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Cakephp is really good, really close to ruby on rails (1.2).", "It is in php, works very well on shared hosts and is easy to implement. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The only downside is that the documentation is somewhat lacking, but you quickly get it and quickly start doing cool stuff."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I totally recommend cakephp."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I have two friends who originally started writing an application using Ruby on Rails, but ran into a number of issues and limitations.", "After about 8 weeks of working on it, they decided to investigate other alternatives."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["They settled on the Catalyst Framework, and Perl.", "That was about 4 months ago now, and they've repeatedly talked about how much better the application is going, and how much more flexibility they have."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Catalyst Framework", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.catalystframework.org"}]}, {"text": ["With Perl, you have all of CPAN available to you, along with the large quantity of tools included.", "I'd suggest taking a look at it, at least."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Personally I made some rather big projects with Django, but I can compare only with said \"montrosities\" (Spring, EJB) and really low-level stuff like Twisted."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Web frameworks using interpreted languages are mostly in its infancy and all of them (actively maintained, that is) are getting better with every day."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["By \"good deployment\" are you comparing it with Java's EAR files, which allow you to deploy web applications by uploading a single file to a J2EE server?", "(And, to a lesser extent, WAR files; EAR files can have WAR files for dependent projects)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I don't think Django or Rails have gotten quite to that point yet, but I could be wrong...  zuber pointed out an article with more details on the Python side."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Capistrano may help out on the Ruby side."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Capistrano", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.capify.org/"}]}, {"text": ["Unfortunately, I haven't really worked with either Python or Ruby that much, so I can't help out on profilers or debuggers."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]