[[{"text": ["The easiest solution (in my opinion), is to buy a decent programming book."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Speaking from my own experience,"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Most of the books for Object Oriented languages have step by step examples of building fully functional applications, and will quickly help you turn that blank document into a program."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["After you've read one or more of those books programming will get a lot easier and you will even pick up new languages more easily.", "It's not about the examples in the book being  'pointless' it's about how a problem is approached and solved, if you understand those principles building applications gets a lot easier.", "good luck."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "It's not about the examples in the book being  'pointless' it's about how a problem is approached and solved, if you understand those principles building applications gets a lot easier.", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}], [{"text": ["My recommendation is to come up with a significant program you want to make, something a bit more in-depth than solving Project Euler problems.", "Once you have a goal in mind, then you can start learning how to apply the specific language knowledge you have into building software, which is a skill unto itself.", "Keep it fun and interesting to you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Start simple project which will be very interesting and passionating for you.", "It might be your website, simple online game, some simple application like another twitter clone or something you think is interesting.", "This is the best way to get motivation for learning programming! "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I not advice books if you are not self motivated enough.", "Putting your hands into practice it is the most natural way to learn something new and it gives a lot of satisfaction!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Another thing is to find some programming 'guru'.", "It doesn't have to be real guru but at least someone better than you so you can ask him and get some useful advices."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["EDIT:\nI recommend Django tutorial, it takes about hour (don't remember exactly) and it gives you a lot of knowledge that is enough to start your won web project.", "(Django is a web framework based on Python language)."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Django tutorial", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.djangoproject.com/en/dev/intro/tutorial01/"}]}], [{"text": ["Great question.", "The best place to start is to buy a couple of really good books that do not make programming look like rocket science.", "I would strongly recommend The Algorithm Design Manual by Skiena as the book of choice for learning data structures and algorithms. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "The Algorithm Design Manual by Skiena", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}, {"text": ["Once you have your basics in sight, you may want to look into one of the several available open source projects.", "You are familiar with ANT, Maven etc and I am guessing you would know SVN or Git too.", "Why not begin by signing up for small bug fixes and developments of these software that you already understand a fair bit?", "You could even suggest enhancements since over time you perhaps know of what these pieces can do better. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Good luck."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["In my experience, the only way to learn to program is to do it.", "Find small things you want to do and figure out how to write programs to do them.", "Find people who can critique those programs.", "Rinse, wash, repeat."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["People can tell you good books to learn things, and they will definitely be useful.", "But they are no substitute for actually writing programs.", "In fact, the best books will encourage you to write your own programs and experiment with what they're teaching you."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In my opinion, most universities completely fall down in teaching people to program.", "They almost all treat programming as a science/engineering discipline.", "And it is, in a way.", "But it's also an art.", "Things that are both an art and engineering tend to get called a craft.", "And that's what I think programming is.", "Good programming is good craftsmanship."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It sounds like you're aware of this already though.", ":-)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I remember SourceForge having an area where projects could advertise for the kind of help they needed.", "You might look there.", "Also, if you're a student, you might qualify to be a Google Summer of Code intern.", "They insist on having a project mentor for their interns, and so that might also get you what you need."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["In general, picking an Open Source project with a good community and making significant contributions (i.e.", "not little bugfixes, but serious new features) is a really great way to get the kind of feedback that will improve your programming."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I would thoroughly recommend reading Code Complete.", "It teaches you all the ins and outs of how to actually write good code, confidently.", "Once you've read it you won't look at a blank text file in the same way, I promise!"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Code Complete", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://cc2e.com/"}]}], [{"text": ["Try Dive Into Python.", "You can get it for free.", "It is not for beginners but for \"experienced programmers\".", "It seems you fit the bill.", "I think the examples are very nice.", "For instance, this example parse a directory with MP3 files, and output the metadata of each file."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Dive Into Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://diveintopython.org/"}, {"text": "this example", "tag": "a", "pos": 5, "childList": [], "childNum": 0, "href": "http://diveintopython.org/object_oriented_framework/index.html#fileinfo.divein"}]}], [{"text": ["We do free Ruby beginner courses (8 weeks) at RubyLearning.org, where you learn together with other students and us mentors:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://rubylearning.org"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://rubylearning.org", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rubylearning.org"}]}, {"text": ["The next course starts this weekend, but you also can join at a later stage, the forums stay open for 30 days after the course finishes :-)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["By starting on very simple problems.", "Write a program that asks the user for his name and then reverses that name.", "Calculate fibonacci numbers.", "Write simple sorting algorithms.", "Then write tic tac toe or something.", "You must program \"in the small\" before diving into programming \"in the large\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Your virtual mentor will probably be a beginner's book.", "They are normally quite good at asking questions ;-) Have you settled on a particular language to learn programming in?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Just get you a well defined (small) problem what you want to solve.", "If you want to do web dev, it could be interesting to get started with GWT.", "They have some nice \"how tos\".", "Its not the language you told, but I think it will help."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Let's write a very simple CM system.", "The specification goes here.", "I prefer PHP, because it's accessible near everywhere, and it has C-like syntax, like other pouplar languages, as C/C++, JAVA, or JavaScript.", "Also, it has good documentation on-line available (you'll find it)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So, this \"project\" is a usual 5-page corporate static site.", "The content is stored in text files, the HTML code (template) is separated from the code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["1.", "The design file contains the HTML code:"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "1.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n &gt; &lt;HTML&gt;\n&gt;   &lt;BODY&gt;\n&gt;     some design...\n&gt;     #kontent\n&gt;     ...some design...\n&gt;     &lt;hr&gt; Link section: &lt;br&gt;\n&gt;     #links\n&gt;     ...some design\n&gt;   &lt;/BODY&gt;\n&gt; &lt;/HTML&gt;\n</code>\n</pre>\n", "senID": 3}, {"text": ["2.", "There are a folder, with content files.", "They are simple text files, e.g."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "2.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 3, "lis": [{"text": "welcome.txt", "tag": "none", "senID": 5}, {"text": "about.txt", "tag": "none", "senID": 6}, {"text": ["jokes.txt"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}]}, {"text": ["3.", "The \"CM sytem\" is the index.php, which performs the following tasks:"], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "3.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 8, "lis": [{"text": "loads the design.html template from a file,", "tag": "none", "senID": 9}, {"text": "checks URL paramter \"page\" and determines, which page to \"show\", if the URL parameter is empty, or the file does not exist, the default page is \"welcome.txt\"", "tag": "none", "senID": 10}, {"text": "replace the \"#kontent\" in the template with the text file read,", "tag": "none", "senID": 11}, {"text": "scan the folder, where txt files are,", "tag": "none", "senID": 12}, {"text": ["make a link with each of them, where \"jokes.txt\" is the name of the file:"], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": "join them,", "tag": "none", "senID": 14}, {"text": "then replace the \"#links\" in the template with joined links made,", "tag": "none", "senID": 15}, {"text": "display the result.", "tag": "none", "senID": 16}]}, {"text": ["I recommend it, because:"], "childNum": 0, "tag": "p", "senID": 17, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "It requires no special things, like SQL server. Even a free hosting with PHP support will be enough.", "tag": "none", "senID": 18}, {"text": "You'll have to look after: how to read a directory, how to read a parameter, how to run a PHP program. Later, if you became a real programmer, this will be an everyday routine.", "tag": "none", "senID": 19}, {"text": "If you pick up a free template somewhere, your \"site\" will be professional looking.", "tag": "none", "senID": 20}, {"text": "Later you can enhance your system: e.g. you should change two line feeds int the txt files to &lt;br&gt; and \"--\" to &lt;hr&gt; or you can use more sophisticated HTML snipplets, so you can format the content without using HTML tags in the txt (this is about how WIKI-like systems work).", "tag": "none", "senID": 21}, {"text": "You should implement template change function.", "tag": "none", "senID": 22}, {"text": "It's a real-life problem. This small site runs on a very same \"engine\" I've described above ", "tag": "none", "senID": 23}]}]]