[[{"text": ["In general, you shouldn't obsess over performance until you've actually seen it become a problem.", "Since we don't know the details of your app, we can't say how it'd perform if implemented in Python.", "And since you haven't implemented it yet, neither can you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Implement the version you're most comfortable with, and can implement fastest, first.", "Then benchmark it.", "And if it is too slow, you have three options which should be done in order:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "if", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"tag": "ul", "num": 3, "lis": [{"text": "First, optimize your Python code", "tag": "none", "senID": 2}, {"text": "If that's not enough, write the most performance-critical functions in C/C++, and call that from your Python code", "tag": "none", "senID": 3}, {"text": "And finally, if you ", "tag": "none", "senID": 4}]}], [{"text": ["Python is very slow at handling large amounts of non-string data.", "For some operations, you may see that it is 1000 times slower than C/C++, so yes, you should investigate into this and do necessary benchmarks before you make time-critical algorithms in Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, you can extend python with modules in C/C++ code, so that time-critical things are fast, while still being able to use python for the main code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Make it work, then make it work fast."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If most of your runtime is spent in C libraries, the language you use to call these libraries isn't important.", "What language are your time-eating libraries written in ?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["From your description, speed should not be much of a concern (and you can use C, cython, whatever you want to make it faster), but memory would be.", "For environments with 64 Mb max (where the  OS and all should fit as well, right ?", "), I think there is a good chance that python may not be the right tool for target deployment."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you have non trivial logic to handle, I would still prototype in python, though."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I never really measured the performance of pyfuzzy's examples, but as the new version 0.1.0 can read FCL files as FFLL does.", "Just describe your fuzzy system in this format, write some wrappers, and check the performance of both variants."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For reading FCL with pyfuzzy you need the antlr python runtime, but after reading you should be able to pickle the read object, so you don't need the antlr overhead on the target."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]