[[{"text": ["Perl 6?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Seriously, though, I read your question as saying that your main reason for wanting to switch is because you believe that other languages \"address scripting etc.", "in a better way than Perl apparently did.", "\"  This suggests to me that you don't really know what problems \"apparently\" exist in Perl and you're just trying to follow the current fashion in programming languages."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If my impressions are correct, then I'd say you should just look at the trends and use that to decide which one you want to follow.", "They're all very capable and why choose a new language for technical reasons if your reason for distancing yourself from the old one is non-technical?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If I'm wrong, then you may want to ask a new question which specifies the areas that you see as deficient in Perl, because that's what will determine what will be your best option.", "And it may simply be to get to know Perl better - if you've just been using it for \"file parsing and system scripting\", then there are likely vast areas of the language that you're not familiar with."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Before I started learning Ruby, here's how I split up my usage for the languages I know:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["PHP: Web applications, and only web applications.", "The good thing about PHP is that it has tons of built-in functionality, which makes it suitable for tiny to small applications.", "Also, most web applications are essentially data formatters, they read/write to/from a database, and that's about it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python: GUI applications, which tend to be more complicated.", "Python forces you to write clean code, which is annoying for quick hacks, but great if you're writing GUI code.", "Available libraries and toolkit integration are great (e.g.", "wxPython)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Perl: Everything that I would otherwise do in C, except for very low-level stuff, and even then, I can use Inline::C. Perl is great for quick text processing, which is a much broader application than it sounds.", "Everything from network daemons to mail filters can be written in Perl.", "And with CPAN, you'll barely have to write anything new."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]}, {"text": ["I'd suggest learning Ruby over Python (or Ruby before Python) because it has concepts that can be useful for you as a programmer regardless of the language, and it's not whitespace-sensitive, so you won't feel weird coming from Perl."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["At the end of the day, I believe there's no such thing as a better or worse scripting language.", "The best scripting language is the one you know well and gets the job done."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Why do you want to learn another language? "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you're looking for a different job, find out what sorts of jobs are in the geographical area you want to work, if there's a cool local user group, and so on.", "Find out what sort of lifestyle you want and if you can have that with language you choose (i.e.", "do you want to telecommute, live in a certain area, work 9-to-5, work on big iron, and so on)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["What sort of programming do you want to do?", "Web apps?", "Command-line tools?", "Slick GUIs that run on the local machine?", "Different languages will be better-suited to different tasks.", "That's mostly not related to the language itself but the cool tools other people have built around the language."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you just want to learn another language, consider branching out to something completely foreign, such as Smalltalk or Erlang.", "Instead of learning Python or Ruby, try something in a different part of the programming language evolutionary tree.", "Also, try a language that's not in your current field of work just to sample what life is like elsewhere.", "You might not always have the sort of job that you do, so a little breadth in the CV isn't so bad."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Play with the new language for a week.", "See how hard it is to find help online (and not just here :) and to use the documentation.", "Find out what sort of libraries and tools it has already, and find out what the community is like and if you like those sorts of people.", ":)"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["And, if you choose something you end up not liking, just choose something else.", "It was a learning experience and now you know something about that new language even if you don't use it.", "If you keep going in your programming career, you're going to do this over and over again, so you're not making a life commitment to anything."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Good luck,"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["I'd suggest, and you can have a go at me for sounding glib here, Perl."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Obviously I don't know exactly how far your knowledge of Perl runs, but if you (or anyone else) are still writing 'Perl 4' in Perl 5.8, or even 'traditional' Perl 5 OO, I would suggest that you owe it to yourself to acquaint yourself with, at the very least, Moose for OO, some of the recent changes in Perl 5.10, a bunch of the more recent 'new wave' of Perl CPAN modules, and the like."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Moose", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://search.cpan.org/dist/Moose"}]}], [{"text": ["When I gave up on Perl, I switched to Python because of an article by Eric S. Raymond, and since Ruby wasn't nearly so mainstream as it is today.", "I think either are good choices, with Python having a greater array of libraries and Ruby being fully classful."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Eric S. Raymond", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/about/success/esr/"}]}, {"text": ["I should also add that Python has a RAD environment for web development that's similar to Ruby on Rails.", "It's called TurboGears and has a similar plugin architectue, so you can choose your ORM engine and templating format."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "TurboGears", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://turbogears.org/"}]}, {"text": ["In other words, don't make your choice because of RoR ... make your choice based on the language, your compatibility with its syntax/structure and its suitability to the work you're doing.", "Also note that I'm trying to avoid sounding like a \"Pythonista\" (a Python language zealot), but may sound like one only because of my limited exposure to Ruby and if you look at my profile, you'll see I make my living with Java.", "If I were choosing a fourth-generation language now, would I choose Ruby ...", "I might.", "Please let us know what you decide."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I think it depends on whether Perl drives you crazy."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you love all the nutty rules and weird special cases and implicit variables, then Ruby will probably make you happy.", "It's not as insane as Perl, but it generally follows the same \"more than one way to do it\" philosophy."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you think Perl is insane and Larry Wall is the Jackson Pollack of software, then Python will probably suit you nicely."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["One suggestion would be to re-learn Perl!   "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Have a try at new programming techniques rather than just new programming language (eg.", "OOP &amp; Functional programming)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'd recommend the following Perl books / sites...."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Perl Best Practices by Damian Conway", "tag": "none", "senID": 3}, {"text": "Higher Order Perl by Mark Jason Dominus", "tag": "none", "senID": 4}, {"text": "Object Oriented Perl by Damian Conway", "tag": "none", "senID": 5}, {"text": ["Moose"], "childNum": 0, "tag": "a", "senID": 6, "childList": []}]}, {"text": ["/I3az/"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["I'd suggest lua."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It has a clear stack-based C interface and some simple, yet interesting threading concepts. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Unlike in python, you can embed multiple instances of the interpreter within a single C program.", "Also, you don't have to explicitly count references all along the way.", "Good fun, easy to learn and use."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Python and Ruby aren't exactly new.", "Python was created in 1991 and Ruby in 1993.", "And just to round things out, the first paper on Tcl was given in 1990."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I think the choice of which language doesn't really matter.", "They are all fine languages and you'll take away something unique from each.", "Personally I recommend Tcl even though it wasn't on your short list, in part because it comes with fabulous bindings for Tk.", "Tk  is the most common GUI toolkit in use among all scripting languages, and you can be up and writing GUI programs in a remarkably short amount of time.", "Learn Tk with Tcl and you can later transfer what you've learned to Python or Ruby or Perl."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python is also a fine choice for its greater reliance on OO (though you can certainly do OO in Tcl, too).", "One definitely advantage Python has over Tcl is that it comes with a huge amount of built-in functionality.", "The standard library makes it easy to do a lot of stuff right out of the box.", "You can get a batteries-included version of Tcl from ActiveState, though I think Python still wins in that regard."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Roby, particularly if you're interested in jumping on the rails bandwagon, is also a good choice.", "I'm not as well versed in it so I'll just say it's not a bad choice to learn."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["There are plenty of other dynamic languages to choose from but those are the big three outside of Perl, IMO.", "They all are interesting, unusual, and equally powerful in their own ways.", "You can't go wrong no matter which one you choose.", "Choosing any of them will definitely help you to become a better programmer."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I found an article comparing python and ruby."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "article", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://blog.ianbicking.org/ruby-python-power.html"}]}], [{"text": ["I'd $n++ the recommendation to re-learn perl.", "Perl 5.10 is a solid language backed up by a large collection of libraries in CPAN.", "You can create UIs in Tk, wxWidgets, Qt, Curses and Gtk, amongst others, do event-driven programming, manipulate all sorts of databases, and much, much more.", "If you're used to the C-ish (and Perl, Java, JavaScript, amongst others) way of doing things (blocks  between braces, semicolons at the end of statements) then Python's syntax will be jarring and unintuitive.", "Ruby reads like Perl, if Perl were designed for buzzword compliance and is really only popular because of the bags of undeserved hype surrounding RoR."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["What are your goals?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Are you looking for mind-expansion, employability or utility?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For simple utility, sharpen your Perl skills.", "You've got a solid base with Perl, build on it.", "Why start over, you'll get more done in less time if you expand your Perl skills."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For mind expansion learn Haskel, LISP, Lua, or anything else that is very different than what you are used to."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["For employability, you'll have to look at various job boards and see who's hiring and for what languages.", "That will change with time.  "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Python, Perl and Ruby have all had their 5 minutes of fame.", "Jobs can be had hacking any of them.", "What's available in your area may vary."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["If you really want to hit it big, figure out what fad language will be used for Web 3.0 in a few years time.", "Learn it now, so you will be one of the few with 3 years experience in HOTLANGUAGEOFTHEDAY.", "You'll be able to demand a huge salary while you go chop those venture capital dollars."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "go chop those venture capital dollars", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.youtube.com/watch?v=D%5FYjvC4ndzM"}]}], [{"text": ["I'd second the suggestion of Lua.", "but mostly because that's what I'm currently learning.", "I used to think I was using Perl less, but thinking back on it, I'm learning less in Perl.", "My most interesting development in the last 5+ years has been in Perl (with a little C, ksh and PL/SQL thrown in), so it has become second nature at this point.", "I've dabbled in Haskell, Common Lisp, Python, and PostScript, each of which is different than my core languages.", "But they have been hard to get stuff done in for various reasons."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "I'm", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["I was attracted to Lua because it's faster and cleaner than Perl, is designed to be embedded in C, and has some interesting meta-features that I'd like more exposure to.", "I've found it relatively easy to get things done in Lua so far."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Reading the other suggestions here, it's time I spent more time with some of the newer Perl modules on CPAN.", "And I hope to be pleasantly surprised by Perl 6 one of these days."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If it's for writing applications, I think Python or Ruby are a good choice.", "I still like the good old Tcl/tk even if I see it cited less and less nowadays."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Tcl/tk", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.tcl.tk"}]}, {"text": ["If it's for embedding into a bigger application, I think nothing beats Lua.", "It's small, fast and very well supported."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Lua", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.lua.org"}]}], [{"text": ["Learning any scripting language is useful.", "But if you have a Java background, I'd suggest Groovy.", "Groovy runs on the JVM, being basically a layer on top of Java, so if you know Java you already know 90% of Groovy so there's almost no learning curve.", "And you'll have the entire Java library API, and all of your already-existing Java classes at your disposal to use.", "Plus the benefits of a dynamically-typed, powerful, modern programming language."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Groovy", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://groovy.codehaus.org"}]}, {"text": ["That said, if you do not have a Java background, then Groovy probably doesn't particularly stand out over any other scripting language."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "not", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["Python, I have found it useful for working with XML and it is the scripting language for Paint Shop Pro."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you are a windows environment you should also learn PowerShell, because it is Microsoft's future direction for the command line.", "It's very powerful and it will only be getting better.", "It's pipeline contains objects and not plain text."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I'd suggest you take on a small project and implement it in both languages.", "Something practical: hit an API, grab the data in XML, do something with it, store it in a DB etc..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["some sort of project that will hit a few points you're likely to encounter but nothing that's huge and takes weeks."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It's like test driving a car.", "Give 'em both a whirl on a \"road\" you know (something you already use Perl for) and see which suits you better."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Also - I'm a fan of getting my feet wet with new-to-me languages.", "It can't hurt.", "Lots of problems out there are easier or harder to solve depending on the language."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I did much the same thing.", "I grew annoyed at Perl's oddities with data handling, and \"more than one way\" concept.. though perl was certainly useful.", "I started looking into Ruby and Python, reading a lot of articles and finally started with Python.", "I eventually started playing with Ruby as well, out of curiosity.", "My impression is that perl was good at the time, but has long since been needing a replacement.", "Python and Ruby both feel like much more complete and professional tools.", "They both seem very well laid out, and capable of the most demanding tasks.", "I find that I would rather write in them than anything else (C, C++, Perl, sh scripts, matlab scripts, etc.).", "The only downside is that as interpreted languages they do take a penalty in performance compared to a compiled sort, but honestly.. in most cases that is not a problem. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Between the two, I'd say its not really cut and dry.", "Python seems more conservative in some ways, with a larger library selection, and close attention to the one best way to do things.", "Ruby seems trendy, but has some very good concepts behind it, and the idea that everything is an object is great.", "It is annoying that Ruby does have several methods to accomplish the same thing, which Perl has taught me to fear, but it doesn't seem quite so infected with it.", "Performance-wise.. Python still does win, at least in all the cases I've put it to the test.. how much depends on the type of operation.", "But again, if performance is a concern, you should be looking at C/C++ or something."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I know there are some slightly more obscure things I've thought of looking at (Lua, Ocaml, haskell), but Python/Ruby is becoming popular enough that corporations will coax IT into supporting.", "Python and Ruby are both available at my work.", "I would pick Ruby or Python first, and perhaps after you're comfortable with that move to something less mainstream."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["In either case  highly recommend a book.. \"Programming Python\" or \"The Ruby Programming Language\"."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I'm sort of amazed nobody has suggest you learn Javascript!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["C++, along with STL and boost."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I've twice won bet, and writing a program in C++ faster than perl."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["There is a need of a killer C++sh ( there have been a few attempts )."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["re-learn Perl man and you'll hack like a pro!!", "!Like people said here it's no longer complex, it's as simple as you wanna it to be...\nall we gotta do is to make Perl more powerful(which it is thanks to CPAN) and not to reinvent the wheel by going to different languages"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would recommend learning Javascript.", "It opens up a new area to program -- inside the browser.", "That's a space that is getting hotter and hotter."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I say this more because it's something that I have been meaning to get to.", "Google's Go is a compiled language with garbage collection and fast compiler that are supposed to make it feel like a scripting language.", "I can't say that I have used it much (nothing more than a few simple test cases) however it seems powerful and the thought of a \"new\" language appeals to me."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Go", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://golang.org"}]}, {"text": ["In the meantime I am using Perl, but now with Moose and more especially MooseX::Declare, this it Perl OO on steriods!", "(Sadly that means power but not speed."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Moose", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://p3rl.org/Moose"}, {"text": "MooseX::Declare", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://p3rl.org/MooseX%3a%3aDeclare"}]}], [{"text": ["Python becomes more and more popular.", "Just look at Google Application Engine."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]