[[{"text": ["http://wiki.python.org/moin/SchoolsUsingPython"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://wiki.python.org/moin/SchoolsUsingPython", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/SchoolsUsingPython"}]}], [{"text": ["MIT has an online version of its January term course 6.189 A gentle introduction to programming using python with some excellent introductory material.", "And for completeness, at least several of the full-semester courses, 6.00 Intro to Computer Science and Programming included, use python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "6.189 A gentle introduction to programming using python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://ocw.mit.edu/OcwWeb/Electrical-Engineering-and-Computer-Science/6-189January--IAP--2008/CourseHome/"}]}], [{"text": ["Going for a university to learn a specific programming language is a waste.", "You can get much more from a degree than learning C/Java/whatever, and learning a specific language shouldn't take a lot of time, given enough motivation.", "Also, after learning a reasonable set of languages, picking up another one is relatively easy and fast.", "Don't pick an university or a degree based on which programming languages it'll \"teach\" you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["At my Alma mater UC Davis, the Computer Science department has offered ECS 145: Scripting Languages and Their Applications. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Excerpt:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["We will focus on the following languages:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Python: We will spend most of our time on this language, for its clarity and elegance, and due to its popularity. (E.g. Python is big at Google.)", "tag": "none", "senID": 3}, {"text": "Perl: I don’t like Perl, but it is quite widely used, so we have to spend some time on it. It’s very easy to learn after you know Python.", "tag": "none", "senID": 4}, {"text": "Ruby: This actually is very similar to Python. It’s become famous because of the Ruby on Rails Web development system.", "tag": "none", "senID": 5}, {"text": "R: Some of you may know this as a statistical language, but it is more general than that, as a data manipulation and graphical analysis tool. (We will not do much with its statistical side.) It is definitely a scripting language, and includes some Python-like features (in some cases out-Pythoning Python).", "tag": "none", "senID": 6}]}], [{"text": ["Lappeenranta university of technology.", "Lappeenranta is in Finland, near the Russian border."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Lappeenranta university of technology", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.it.lut.fi/kurssit/08-09/CT20A0200/"}]}], [{"text": ["My alma mater switched from teaching Java (C++ in my day) to Python because they found the overhead of learning OOP and Java to be too much.", "When you're really trying to teach OOP, you don't want to have too much of the language getting in the way."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The best way to learn a language is to try writing something (vaguely) useful in it.", "Be prepared to perhaps throw away your first attempts.", "But then again maybe not if you follow Markus Frind's example."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Markus Frind's", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.nytimes.com/2008/01/13/business/13digi.html?_r=1&ex=1357966800&en=bfde0f1a6ec77632&ei=5090&partner=rssuserland&emc=rss&pagewanted=all"}]}, {"text": ["I've been reading though the Natural Language Processing book at nltk.org, the early chapters cover a surprising amount of basic Python.", "I've kinda been skipping most it, but much is quite useful in showing practical use of Python (covers list comprehensions, etc."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Natural Language Processing", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.nltk.org/book"}]}], [{"text": ["They do at my alma mater.", "However, I don't think the online materials would be of much use to you, since you probably don't speak or read Croatian.", "(if you do, I'll send you a link)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Define \"teach Python\".", "Most universities teach a spread of languages - for example, having just finished two years of a Computing degree here at the University of Edinburgh, and heading for my third year, I have so far touched on C, C++, Java, Haskell, Assembly, Prolog... and, yes, Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Don't go to University to learn a specific language.", "University is usually about learning the theory behind programming.", "If you want to learn a language, then think of something to do with it and go do that.", "But, if you are about to enter University level education, then don't skip out on a degree.", "Theory is important. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]