[[{"text": ["I know Ruby, don't know python... you can see which way I'm leaning toward, right?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Choose the one you're most familiar with and most likely to get things done with the fastest."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Yeah, flip a coin.", "The truth is that you're going to find minimalist frameworks in either language.", "Heroku is a pretty strong reason to say Ruby but there may be other similar hosts for Python.", "But Heroku makes it stupid easy to deploy your api into the cloud whether it's Rails or some other Ruby project that uses Rack.", "WSGI doesn't give you this option. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Heroku", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://heroku.com"}]}, {"text": ["As for as the actually implementation though, I'm guessing that you'll find that they're both completely competent languages and both a joy to program in. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I would say the important thing is that regardless of which you choose, make sure that your choice does not leak through your REST API.", "It should not matter to the client of your API which you chose."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think they are fairly evenly matched in features.", "I prefer Python, but I have been using it for over a decade so I freely admit that what follows is totally biased."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["IMHO Python is more mature - there are more libraries for it (although Ruby may be catching up), and the included libraries I think are better designed.", "The language evolution process is more mature too, with each proposed feature discussed in public via the PEPs before the decision is made to include them in a release.", "I get the impression that development of the Ruby language is much more ad-hoc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python is widely used in a lot of areas apart from web development - scientific computing, CGI rendering pipelines, distributed computing, Linux GUI tools etc.", "Ruby got very little attention before Rails came along, so I get the impression that most Ruby work is focused on web development.", "That may not be a problem if that is all you want to do with the language, but it does mean that Python has a more diverse user base and a more diverse set of libraries."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Python is faster too."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Ruby + Sinatra"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Sinatra", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.sinatrarb.com"}]}, {"text": ["Very easy to use with/as rack middleware - someone's already mentioned heroku"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Either will do a great job and you'll gain in other ways from learning something new.", "Why not spend as couple of days with each?", "See how far you can get with a simple subset of the problem, then see how you feel.", "For bonus points report back here and answer your own question! "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]