[[{"text": ["/dev/cu.xxxxx is the \"callout\" device, it's what you use when you establish a connection to the serial device and start talking to it.", "/dev/tty.xxxxx is the \"dialin\" device, used for monitoring a port for incoming calls for e.g.", "a fax listener."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "/dev/cu.xxxxx", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "/dev/tty.xxxxx", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["You don't happen to see any serial numbers after them do you?", "Such as:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n /dev/cu.usbserial-xxxxxxxxA\n <br />\n /dev/tty.usbserial-xxxxxxxxA\n <br />\n /dev/cu.usbserial-xxxxxxxxB\n <br />\n /dev/tty.usbserial-xxxxxxxxB\n <br />\n</code>\n</pre>\n", "senID": 1}, {"text": ["My other through was maybe there is a permissions issue of python talking to the serial port.", "Do you know what user your python instance is running under?", "And maybe what roles it has?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I suppose in a C program you could just open the serial device with an open syscall and read() / write() to that.", "My Python-fu however is weak, and I don't know if this would transfer."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Nope, no serial numbers.", "The thing is, the problem persists even with sudo-running the python script, and the only thing that makes it go through if I open the connection in the gui tool that I mentioned."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["have you tried watching the traffic between the GUI and the serial port to see if there is some kind of special command being sent across?", "Also just curious, Phython is sending ASCII and not UTF-8 or something else right?", "The reason I ask is because I noticed you quote changes for the strings and in some languages that actually is the difference between ASCII and UTF-8."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Just last week I wrote a small Python utility to help me debug an embedded C app by reading debug information off a USB-Serial dongle, so I'd like to think that I understand PySerial pretty well.", "Some additional information might help diagnose the problem:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "What USB-Serial driver are you using?", "tag": "none", "senID": 1}, {"text": "Are you certain that you've configured all of the serial options (baud rate, flow control, parity, stop bits, etc.) correctly before attemtping to open the serial connection from Python?", "tag": "none", "senID": 2}, {"text": "What version of PySerial are you using?", "tag": "none", "senID": 3}]}]]