[[{"text": ["You might try suspending your computer or running in a virtual machine which you can subsequently suspend.", "But as your script is working with network connections chances are your script won't work from the point you left once you bring up the system.", "Suspending a computer and restoring it or saving a Virtual M/C and restoring it would mean you need to restablish the network connection.", "This is true for any elements which are external to your system and network is one of them.", "And there are high chances that if you are using a dynamic network, the next time you boot chances are you would get a new IP and the network state that you were working previously would be void."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you are planning to modify the script, few things you need to keep it mind."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This would not be an easy task so consider investing a considrable amount of time :-)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Note***"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["On a second thought.", "There is one alternative from changing your script.", "You can try using cloud Virtualization Solutions like Amazon EC2."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["As others have commented, unless you are running your script in a virtual machine that can be suspended, you would need to modify your script to track its state."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Since you're populating a database with your data, I suggest to use it as a way to track the progress of the script (get the latest URL parsed, have a list of pending URLs, etc.", ")."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If the script is terminated abruptly, you don't have to worry about saving its state because the database transactions will come to the rescue and only the data that you've committed will be saved."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["When the script is retarted, only the data for the URLs that you completely processed will be stored and you it can resume just picking up the next URL according to the database."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I ported my script to VM and launched it from there.", "However there were network connection glitches after resuming from hibernation.", "Here's how I solved it by tweaking python script:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n import logging\nimport socket\nimport time\nsocket.setdefaulttimeout(30) #set timeout in secs\nmaxretry = 10  #set max retries\nsleeptime_between_retry = 1 #waiting time between retries\n\nerroroccured = 0\nwhile True:\n    try:\n        domroot = parse(urllib2.urlopen(myurl)).getroot()\n    except Exception as e:\n        erroroccured += 1\n        if erroroccured&gt;maxretry:\n            logger.info(\"Maximum retries reached. Quitting this leg.\")\n            break\n        time.sleep(sleeptime_between_retry)\n        logging.info(\"Network error occurred. Retrying %d time...\"%(erroroccured))\n        continue\n    finally:\n        #common code to execute after try or except block, if any\n        pass\n    break\n</code>\n</pre>\n", "senID": 1}, {"text": ["This modification made my script temper proof to network failures."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If this problem is important enough to warrant this kind of financial investment, you could run the script on a virtual machine.", "When you need to shut down, suspend the virtual machine, and then shut down the computer.", "When you want to start again, start the computer, and then wake up your virtual machine."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["WinPDB is a python debugger that supports remote debugging.", "I never used it, and don't know if remote debugging a running process requires a modification to the script (which is very likely, otherwise it'd be a security issue); but if remote debugging without modifying the script is possible then you may be able to dump the current state of the script to a file and figure out later how to load it.", "I don't think it would work though."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "WinPDB", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://winpdb.org/"}]}]]