[[{"text": ["I would say that Python's OOP support is much better given the fact that it was introduced into the language in its infancy as opposed to PHP which bolted OOP onto an existing procedural model."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Python's OOP support is very strong; it does allow multiple inheritance, and everything is manipulable as a first-class object (including classes, methods, etc). "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Polymorphism is expressed through duck typing.", "For example, you can iterate over a list, a tuple, a dictionary, a file, a web resource, and more all in the same way."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["There are a lot of little pedantic things that are debatably not OO, like getting the length of a sequence with len(list) rather than list.len(), but it's best not to worry about them."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["One aspect of Python's OOP model that is unusual is its encapsulation mechanism.", "Basically, Python assumes that programmers don't do bad things, and so it doesn't go out of its way to any extent to protect private member variables or methods.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It works by mangling names of members that begin with a two underscores and ending with fewer than two.", "Such identifiers are everywhere changed so that they have the class name prepended, with an additional underscore before that.", "thus: "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n class foo:\n    def public(self):\n        return self.__private()\n    def __private(self):\n        return 5\n\nprint foo().public()\nprint foo()._foo__private()\n</code>\n</pre>\n", "senID": 2}, {"text": ["names beginning and ending with two (or more) underscores are not mangled, so __init__ the method python uses for constructing new instances, is left alone.  "], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "__init__", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Here's a link explaining it in more detail."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "link", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/tutorial/classes.html#private-variables"}]}], [{"text": ["Also: Python has native operator overloading, unlike PHP (although it does exist an extension).", "Love it or hate it, it's there."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think they're comparable at this point.", "As a simple test, I doubt there's any pattern in Design Patterns or Patterns of Enterprise Application Architecture, arguably the two most influential books in OOP, that is impossible to implement in either language. "], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Design Patterns", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0201633612"}, {"href": "http://rads.stackoverflow.com/amzn/click/0321127420", "text": "Patterns of Enterprise Application Architecture", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Both languages have come along by leaps and bounds since their infancies."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As far as multiple inheritance, it often creates more problems than it solves, and is, these days, commonly left out of languages as an intentional design decision."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "creates more problems than it solves", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Diamond%5Fproblem"}]}], [{"text": ["If you are looking for \"more pure\" OOP, you should be looking at SmallTalk and/or Ruby."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PHP has grown considerably with it's support for OOP, but because of the way it works (reloads everything every time), things can get really slow if OOP best practices are followed.", "Which is one of the reasons you don't hear about PHP on Rails much."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]