[[{"text": ["The advantage of Python is that - should he be bitten by the bug - there's massive a community and lots of resources to drawn on and explore."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If he's not bitten by Python, then programming might be a hard sell anyway, so I don't see the advantage of starting on logo-likes, even 3D ones like Alice.", "Alice can of course be fun, as can writing Lua scripts to extend a mainstream game title.", "But all the hardcore programmers in their thirties now seem to have started on Turbo Pascal or even assembler when they were around 16, and Python offers an approachable modern-day equiv."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Use Python.", "It's very simple.", "It will let you make \"Hello World\" in one line, and also let you do any range of powerful things down the road."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It's great for beginners because of the minimalist syntax, and it also forces you to indent your code properly."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Even a non-programmer can understand Python:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n print \"hello world\"\n\nyou = True\nif you:\n  print \"I bet you think this program is about you, don't you, don't you?\"\n\na = 1\nb = 1\nc = a + b\n</code>\n</pre>\n", "senID": 3}, {"text": ["Another nice thing about Python is it is interpreted, so you can open up a terminal and just play around."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I've never used (or even heard of) Alice, but I second your thought that it's better spending the time learning a real language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Rather than going through a whole book, he may prefer to do something practical.", "One great possibility is PyGame, a whole framework for producing games in Python - that might appeal to him and get him interested."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "PyGame", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.pygame.org"}]}], [{"text": ["My wife Anna, who's very skilful and experienced in training people (especially newbies and kids) as well as a Python semi-guru (I'm the other half, but not a training expert), hotly recommends the book \"Hello World\" -- I haven't read that book myself (nor do I know much about training newbies or kids, I've only taught professionals, engineering students in college, etc) -- but I've seen her going through it with a highlighter (using it heavily while nodding her head vigorously and making approbatory remarks) and many enthusiastic comments have emerged from her about it."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "\"Hello World\"", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/1933988495"}]}], [{"text": ["Alice seems a bit young for a 16 year old guy...", "I (being a 16 year old guy) would not want to learn in a way that seems patronizing... lol."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A lot of people start with Python, and its a great way to get into programming.", "When I was 14, I started with web development, which lead to PHP, which lead to javascript.", "Then I branched off and learned C for memory management in a lower level language, and then Ruby + Python to learn another interpreted language then Scheme to learn the functional paradigm, then Objective-C and then Java, C++ and C#.", "So it depends what he wants to focus on.", "If he wants to do web work, I suggest he learn HTML (it is a great way to get into computers without being a real \"language\"), then PHP (even though a lot of people here don't like it, its a good first language) and then javascript and possibly Ruby.", "If he wants to get into Windows programming, I suggest he learn C, C++ and C# and Python, starting with Python (or C if he daring...).", "If he wants to learn Mac Programming, learn C, Objective-C and either Ruby or Python.", "Then you can branch off from there.", "Some people recommend Java as a first language...", "I'm not a huge java fan, but it is a very good candidate."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I found that a fantastic way to learn (especially when your younger) is through video tutorials.", "I learned PHP through Lynda.com tutorials.", "They are great and cover the basics and beyond.", "You can get a free trial (http://www.lynda.com/promo/freepass/Default.aspx?lpk35=240) and try it out.", "I think that is one of the best ways to go IMHO.", "Once you know the basics through the video series, you can go on to reading manuals for other languages (like Python), but manuals can be daunting if its your first time.", "Depends what kind of learner he is."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://www.lynda.com/promo/freepass/Default.aspx?lpk35=240", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.lynda.com/promo/freepass/Default.aspx?lpk35=240"}]}, {"text": ["You can learn some bad practice in PHP, so its best to watch the series to get some programming basics, then go on to read about another languages. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If he'd rather learn C first (some people prefer learning it first) http://vtc.com/ has a great C series of video tutorials."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://vtc.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://vtc.com/"}]}, {"text": ["Good luck!"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["If you don't mind spending some money on a book (about $20 from Amazon.com), you could try Python Programming for the Absolute Beginner by Michael Dawson.", "I have skimmed it (a coworker's copy) and it is extremely basic, assuming no programming experience.", "It's written in an approachable, casual style; and builds up gradually to games with Pygame.", "Obviously it's best if you can find it at a brick-and-mortar store to check it out yourself."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Python Programming for the Absolute Beginner", "tag": "a", "pos": 0, "childList": [{"text": "Python Programming for the Absolute Beginner", "tag": "i"}], "childNum": 1, "href": "http://rads.stackoverflow.com/amzn/click/1598631128"}, {"text": "Python Programming for the Absolute Beginner", "childNum": 0, "tag": "i", "pos": -1, "childList": []}]}, {"text": ["Quick general recommendation in case you haven't already thought of it:  Use Python 2.x rather than 3.x.", "The book I mentioned, and probably 98% of all other existing books, tutorials, and third-party modules (including, crucially, Pygame) have not yet switched over to 3.x, and probably will not for at least a few more years."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["[Oh, and I was just reminded of another beginner book candidate while checking out the Pygame site to confirm that it doesn't work with Python 3.x: Hello World!", "Computer Programming for Kids and Other Beginners by Warren D. Sande and Carter Sande.", "I have not personally seen this book at all, but Guido van Rossum himself has reviewed it.", "It strikes me as a bit too kid-focused for a 16-year-old, but it may be worth checking out."], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "Hello World!\nComputer Programming for Kids and Other Beginners", "tag": "a", "pos": -1, "childList": [{"text": "Hello World!\nComputer Programming for Kids and Other Beginners", "tag": "i"}], "childNum": 1, "href": "http://www.manning.com/sande/"}, {"text": "Hello World!\nComputer Programming for Kids and Other Beginners", "childNum": 0, "tag": "i", "pos": -1, "childList": []}, {"text": "Guido van Rossum himself has reviewed it", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://neopythonic.blogspot.com/2009/05/so-you-want-to-learn-python.html"}]}], [{"text": ["Having gone through the Alice website, I wouldn't be too hopeful, it seems like a platform for a bunch of people to charge for texts, and workshops.", "Really, python has a billion beginner tutorials and that'll pay off.", "While Alice will remain relatively unknown.", "Much depends upon what your brother, not you, want to accomplish.", "Does he want to 'learn' programming?", "Or maybe he sits on facebook all day, and would benefit from learning php so he can do things against the facebook API, or what have you.", "I would worry more about the activity, than the language he starts with.", "Assuming, he's got someone to ask questions."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And about the best thing you can do is have some confidence in him, and encourage your brother."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think programmers are the last group of people you should ask for such advice.", "Mostly because you'll get fairly predictable responses about how Alice and the visual interface seems condescending, and why would one not just learn how to do it the proper way.", "I've often used the \"python as executable pseudocode\" line myself.", "But, beleive it or not, there are many, many people out there who don't grok pseudocode all that quickly and give up on programming.", "To a large degree, most people on this forum are programmers because they \"got it\" pretty quickly."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You know your brother best, and might choose or tailor an approach best suited to the way he grasps ideas, concepts, etc.", "In evaluating Alice, you should at least consider the actual studies and papers written by educators:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": ["http://www.alice.org/index.php?page=publications/publications"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}]}, {"text": ["Also see the answers by John Y and Alex Martelli, which consider the opinion of other educators."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["(Incidentally, one of the people behind Alice was the late Randy Pausch of CMU, who made headlines a while back based on his \"last lecture\"."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Alice is python underneath (from here).", "There are people who use both together.", "So it's a double head fake. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cs.cmu.edu/~stage3/publications/95/journals/IEEEcomputer/CGandA/paper.html"}]}]]