[[{"text": ["Python is excellent for UnitTesting C# code.", "Our app is 75% in Python and 25% C#(Python.Net), and our unit tests are 100% python.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I find that it's much easier to make use of stubs and mocks in Python which is probably one of the most critical components that enable one to write effective unittests."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Will's answer is good - you're introducing a new requirement for developers."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In addition, what's the tool support like?", "I haven't tried any of this myself, but I'd want to know:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "How easy is it to debug into failing unit tests?", "tag": "none", "senID": 2}, {"text": "How easy is it to run unit tests from the IDE? (e.g. with ReSharper)", "tag": "none", "senID": 3}, {"text": "How easy is it to automate the unit tests from a continuous build server?", "tag": "none", "senID": 4}]}, {"text": ["It could be that all of these are fine - but you should make check them, and document the results."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["There are other options as well as IronPython, of course - Boo being a fairly obvious choice."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "Boo", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://boo.codehaus.org/"}]}], [{"text": ["Actually testing is a great opportunity to try integrating a new language.", "Languages like Python shine especially well in testing, and it's a low risk project to try - the worst case is not too bad at all."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As far as experience testing another language in Python, I've tested C and C++ systems like this and it was excellent.", "I think it's definitely worth a shot."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["What Jon says is true, though - the level of tooling for Python in general, and IronPython in particular, is nowhere near that of C#.", "How much that affects you is something you'll find out in your pilot."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["There's an obvious disadvantage which is that everyone working on the code now needs to be proficient in two languages, not just one.", "I'm fairly hairy but not very pointy, but I do see why managers might be sceptical."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "disadvantage", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Python being a much less verbose language than C# might actually lower the barrier to writing unit tests since there is still a lot of developers that are resistant to doing automated unit testing in general.", "Introducing and having them use a language like IronPython that typically tends to take less time to write the equivalent code in C# might actually encourage more unit tests to be written which is always a good thing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Plus, by using IronPython for your test code, you might end up with less lines of code (LOC) for your project overall meaning that your unit tests might be more likely to be maintained in the long run versus being ignored and/or discarded."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Very interesting. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["What would happen if you write all your code with IronPython (not just the unit tests)?", "Would you end up with approximately 10 times less code? "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Maybe I should learn IronPython too. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I gotta go with Will and Jon.."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I would prefer my tests be in the same language as the code I'm testing; it causes fewer cognitive context switches.", "But maybe I'm just not as mentally agile as I once was."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": "Jon", "tag": "none", "senID": 2}]}], [{"text": ["I've recently been re-evaluating my testing attitudes after discovering parameterised testing in mbUnit and NUnit.", "Previously, I recommended Python unittest as a way to automate any testing possible, because of the concise nature and discoverability of the tests."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "mbUnit", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.mbunit.com/"}, {"text": "NUnit", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://nunit.net/blogs/?p=60"}]}, {"text": ["Parameterised tests allow you to customise the test fixtures with a range of data parameters and thus your C# tests can end up even more concise than Python tests."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n [TestCase(12, 3, 4)]\n[TestCase(12, 2, 6)]\n[TestCase(12, 4, 3)]\n[TestCase(12, 0, 0, ExpectedException = typeof(System.DivideByZeroException),\n      TestName = “DivisionByZeroThrowsExceptionType”)]\n[TestCase(12, 0, 0, ExpectedExceptionName = “System.DivideByZeroException”,\n      TestName = “DivisionByZeroThrowsNamedException”)]\npublic void IntegerDivisionWithResultPassedToTest(int n, int d, int q)\n{\n      Assert.AreEqual(q, n / d);\n}\n</code>\n</pre>\n", "senID": 2}]]