[[{"text": ["If you are looking to do file transfers, XMLRPC is likely a bad choice.", "It will require that you encode all of your data as XML (and load it into memory)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["\"Data requests\" and \"file transfers\" sounds a lot like plain old HTTP to me, but your statement of the problem doesn't make your requirements clear.", "What kind of information needs to be encoded in the request?", "Would a URL like \"http://yourserver.example.com/service/request?color=yellow&amp;flavor=banana\" be good enough?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["There are lots of HTTP clients and servers in Python, none of which are especially great, but all of which I'm sure will get the job done for basic file transfers.", "You can do security the \"normal\" web way, which is to use HTTPS and passwords, which will probably be sufficient."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you want two-way communication then HTTP falls down, and a protocol like Twisted's perspective broker (PB) or asynchronous messaging protocol (AMP) might suit you better.", "These protocols are certainly well-supported by Twisted."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "perspective broker (PB)", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/projects/core/documentation/howto/pb-intro.html"}, {"text": "asynchronous messaging protocol (AMP)", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/documents/8.1.0/api/twisted.protocols.amp.html"}]}], [{"text": ["Pyro (Python Remote Objects) is fairly clever if all your server/clients are going to be in Python.", "I use XMPP alot though since I'm communicating with hosts that are not always Python.", "XMPP lends itself to being extended fairly easily too."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Pyro", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pyro.sf.net"}, {"text": "XMPP", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.xmpp.org"}]}, {"text": ["There is an excellent XMPP library for python called PyXMPP which is reasonably up to date and has no dependancy on Twisted."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "PyXMPP", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pyxmpp.jajcus.net"}]}], [{"text": ["I suggest you look at 1.", "XMLRPC 2.", "JSONRPC 3.", "SOAP 4.", "REST/ATOM\nXMLRPC is a valid choice.", "Don't worry it is too old.", "That is not a problem.", "It is so simple that little needed changing since original specification.", "The pro is that in every programming langauge I know there is a library for a client to be written in.", "Certainly for python.", "I made it work with mod_python and had no problem at all.", "The big problem with it is its verbosity.", "For simple values there is a lot of XML overhead.", "You can gzip it of cause, but then you loose some debugging ability with the tools like Fiddler."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My personal preference is JSONRPC.", "It has all of the XMLRPC advantages and it is very compact.", "Further, Javascript clients can \"eval\" it so no parsing is necessary.", "Most of them are built for version 1.0 of the standard.", "I have seen diverse attempts to improve on it, called 1.1 1.2 and 2.0 but they are not built one on top of another and, to my knowledge, are not widely supported yet.", "2.0 looks the best, but I would still stick with 1.0 for now (October 2008)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Third candidate would be REST/ATOM.", "REST is a principle, and ATOM is how you convey bulk of data when it needs to for POST, PUT requests and GET responses.", "For a very nice implementation of it, look at GData, Google's API.", "Real real nice."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["SOAP is old, and lots lots of libraries / langauges support it.", "IT is heeavy and complicated, but if your primary clients are .NET or Java, it might be worth the bother.", "Visual Studio would import your WSDL file and create a wrapper and to C# programmer it would look like local assembly indeed."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The nice thing about all this, is that if you architect your solution right, existing libraries for Python would allow you support more then one with almost no overhead.", "XMLRPC and JSONRPC are especially good match."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Regarding authentication.", "XMLRPC and JSONRPC don't bother defining one.", "It is independent thing from the serialization.", "So you can implement Basic Authentication, Digest Authentication or your own with any of those.", "I have seen couple of examples of client side Digest Authentication for python, but am yet to see the server based one.", "If you use Apache, you might not need one, using mod_auth_digest Apache module instead.", "This depens on the nature of your application"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Transport security.", "It is obvously SSL (HTTPS).", "I can't currently remember how XMLRPC deals with, but with JSONRPC implementation that I have it is trivial - you merely change http to https in your URLs to JSONRPC and it shall be going over SSL enabled transport."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["HTTP seems to suit your requirements and is very well supported in Python. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "HTTP", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.ietf.org/rfc/rfc2616.txt"}]}, {"text": ["Twisted is good for serious asynchronous network programming in Python, but it has a steep learning curve, so it might be worth using something simpler unless you know your system will need to handle a lot of concurrency."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Twisted", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/"}]}, {"text": ["To start, I would suggest using urllib for the client and a WSGI service behind Apache for the server.", "Apache can be set up to deal with HTTPS fairly simply."], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "urllib", "tag": "a", "pos": 0, "childList": [{"text": "urllib", "tag": "code"}], "childNum": 1, "href": "http://www.python.org/doc/lib/module-urllib2.html"}, {"text": "urllib", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "WSGI service behind Apache", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://code.google.com/p/modwsgi/"}]}], [{"text": ["ProtocolBuffers was released by Google as a way of serializing data in a very compact efficient way.", "They have support for C++, Java and Python.", "I haven't used it yet, but looking at the source, there seem to be RPC clients and servers for each language.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "ProtocolBuffers", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/protobuf/"}]}, {"text": ["I personally have used XML-RPC on several projects, and it always did exactly what I was hoping for.", "I was usually going between C++, Java and Python.", "I use libxmlrpc in Python often because it's easy to memorize and type interactively, but it is actually much slower than the alternative pyxmlrpc."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "pyxmlrpc", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://sourceforge.net/projects/py-xmlrpc/"}]}, {"text": ["PyAMF is mostly for RPC with Flash clients, but it's a compact RPC format worth looking at too."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["When you have Python on both ends, I don't believe anything beats Pyro  (Python Remote Objects.", ")  Pyro even has a \"name server\" that lets services announce their availability to a network.", "Clients use the name server to find the services it needs no matter where they're active at a particular moment.", "This gives you free redundancy, and the ability to move services from one machine to another without any downtime."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Pyro", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pyro.sourceforge.net/"}]}, {"text": ["For security, I'd tunnel over SSH, or use TLS or SSL at the connection level.", "Of course, all these options are essentially the same, they just have various difficulties of setup."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I'd use http and start with understanding what the Python library offers. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "library", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/lib/asyncore-example.html"}]}, {"text": ["Then I'd move onto the more industrial strength Twisted library."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Twisted", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/Twisted-Examples"}]}], [{"text": ["SSH can be a good choice for file transfer and remote control, especially if you are concerned with secure login.", "Most Linux and Solaris servers will already run an SSH service for administration, so if your Python program use ssh then you don't need to open up any additional ports or services on remote machines. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["OpenSSH is the standard and portable SSH client and server, and can be used via subprocesses from Python.", "If you want more flexibility Twisted includes Twisted Conch which is a SSH client and server implementation which provides flexible programmable control of an SSH stack, on both Linux and Windows.", "I use both in production."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "OpenSSH", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.openssh.com/"}, {"text": "Twisted Conch", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/trac/wiki/TwistedConch"}]}], [{"text": ["XMLRPC is very simple to get started with, and at my previous job, we used it extensively for intra-node communication in a distributed system.", "As long as you keep track of the fact that the None value can't be easily transferred, it's dead easy to work with, and included in Python's standard library. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Run it over https and add a username/password parameter to all calls, and you'll have simple security in place.", "Not sure about how easy it is to verify server certificate in Python, though."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["However, if you are transferring large amounts of data, the coding into XML might become a bottleneck, so using a REST-inspired architecture over https may be as good as xmlrpclib."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "REST", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://sv.wikipedia.org/wiki/REST"}]}], [{"text": ["There is no need to use HTTP (indeed, HTTP is not good for RPC in general in some respects), and no need to use a standards-based protocol if you're talking about a python client talking to a python server."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Use a Python-specific RPC library such as Pyro, or what Twisted provides (Twisted.spread)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Facebook's thrift project may be a good answer.", "It uses a light-weight protocol to pass object around and allows you to use any language you wish.", "It may fall-down on security though as I believe there is none."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Facebook's thrift", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://incubator.apache.org/thrift/"}]}], [{"text": ["In the RPC field, Json-RPC will bring a big performance improvement over xml-rpc: \nhttp://json-rpc.org/wiki/python-json-rpc"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://json-rpc.org/wiki/python-json-rpc", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://json-rpc.org/wiki/python-json-rpc"}]}]]