[[{"text": ["Yes you can.", "But you can also use apache on windows.", "If you go the IIS way there's only CGI and it's pretty hard to set up.", "You can also use python based server like CherryPy which is pretty good and will work on all platforms with python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Some frameworks like django support both CGI and WSGI, so you don't have to worry about the details of WSGI or CGI much."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you ask me, WSGI is the future for python web apps."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["web.py includes a server...", "It will do the trick for small jobs."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["By the way, Apache works on windows."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Yes, if you use CGI, FastCGI or depending on your framework, even a self-contained web server (so IIS and Apache would be a reverse-proxy) then that would all work."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The difference will be the configuration of the OS-specific servers, and also your Python environment on each OS.", "So you may find yourself doing a small bit of work at the beginning to make sure your paths are right, etc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["A rather big Python based web framework is ZOPE."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "ZOPE", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.zope.org/"}]}, {"text": ["ZOPE is available on Linux and Windows, and you can use Python to write your Zope Web Apps (it includes a simpler templating system, too)."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Zope Web Apps", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["consider also the possibility of using web2Py, or XML-RPC implementation, or Twisted..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Writing python web apps is a topic on itself, but I would say that by default, it will be portable on multiple servers / platforms. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["When developping python web applications, you will often use frameworks that provide their own web server.", "For performance reasons, you might want to place it behind apache, but it is not even necessary, however, you might get a performance boost by placing it behind an apache server."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Some of the most popular frameworks for web python are : Plone, Zope, CherryPy and TurboGears, only to name a few."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Under apache, you could also use python server pages through mod_python, and since apache runs on windows too, this would aslo be portable."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]