[[{"text": ["I'm not sure how you can say that when you say yourself that you have no experience in the language.", "C++ is a good tool for some things, Python is good for other things.", "What you want to do should be driving this decision, not the technology in and of itself."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "want to do", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["C# programmer or not, I would assume that you can pick up any language, but a language is just a tool, so your question is difficult to answer."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Python may be easier to get started with, but a dynamically typed scripting language is a very different language from C# or C++.", "You will learn more about programming learning it than you will by hopping to a close cousin of a language you already know.", "Really, solid familiarity with at least one scripting language (Python, Perl and Ruby are the favorites) should be a requirement for all programmers."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "different", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["If you want to apply to Google then Python might be the one to go for, surely MS would like the C# already.", "If nothing else the competition would not be as fierce as there are much more folk out there with multi years of C++ experience.", "Also Python gives you a broader language skill and would be a good path to more languages and scripting."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["But as said and will be said again, choose your tool wisely and see whether it's a nail or a screw you're trying to secure."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["C++ is usually used when speed, and low-level OS access is involved.", "It's a good skill to have if you want to expand."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python allows you to do thing quickly, and it's quite easy to learn, and provides more power than you'd expect from a scripting language, and probably one of the fastest ones out there."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["C++ isn't exactly slow to develop, if you've got an IDE, it's not hard to write per-se, but the syntax is going to get you."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you want to apply to Google and/ or Microsoft then I'd say that of the two you need both!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Given more choice, probably C++ and one other language - either dynamic, functional, or both (Scala might be a good choice too)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It's not necessarily about whether you'd use the languages themselves but more about the different approaches they require and encourage."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you continue to be \"scared\" by C++ you're probably going to struggle applying as a dev at either of those organisations - unless you are highly specialised elsewhere."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["C# is a little closer to Java and C++ than it is to Python, so learn Python first out of the two."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, my advice would be:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["Stick with your current language and learn more techniques, such as a wider range of algorithms, functional programming, design by contract, unit testing, OOAD, etc."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["learn C (focus on figuring out pointers, multi-dimensional arrays, data structures like linked lists, and resource management like memory allocation/deallocation, file handles, etc)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["learn Assembly (on a modern platform with a flat memory architecture, but doing low-level stuff like talking to hardware or drawing on a canvas)"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["learn Python or Ruby.", "Chances are, you'll stick with one of these for a while, knowing all of the above, unless some hot new language has come along by then."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]}], [{"text": ["I think you just asked wrong question.", "It is not about the tool itself.", "It should be about what kind of software do you really find enjoying to create.", "C++ is used in creating different types of applications that are written in C# or Python.", "Please mind, that C# or .NET itself is not easy to learn.", "It may be quite easy to develop something that works somehow, but if you just delve into the details..."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "easy", "childNum": 0, "tag": "em", "pos": 4, "childList": []}, {"text": "somehow", "childNum": 0, "tag": "em", "pos": 5, "childList": []}]}, {"text": ["Anyway, my point is: if you're interested in developing web solutions: go for Python.", "There is a lot of hype about Python at the moment, and even Microsoft realized the power of this language (you may use your knowledge of .NET and Python programming using IronPython).", "C++ is at the moment used in some specific areas.", "Business apps are written mostly in Java or .NET, and C++ is still great for more low level programming, in areas where performance is the crucial thing (and I mean 'performance' as performance of language/platform itself).", "The good example is game industry: Java and C# are definitely easier to learn than C++, but... how many 'big games' have been created entirely in C#/Java?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I have another advice for you: if you want to work for Microsoft or Google, do not focus on language itselft.", "It is NOT the most important thing.", "Focus on problem solving, algorithms and other stuff (Stevie Yegge's post about how to prepare for an interview at Google).", "Oh, and of course as a fan of C++ (and C# too) I must admit that it is not true, that developing anything in C++ takes ages.", "You probably think of C++ as of \"C with clasees\" - take a look at STL, templates, advanced templates, Boost...", "Somehow all those people working in games industry manage to create better and better games in not so looooong time that takes others to create 'boring and easy' business app in Java/C#."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Stevie Yegge's post about how to prepare for an interview at Google", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://steve-yegge.blogspot.com/2008/03/get-that-job-at-google.html"}]}], [{"text": ["As someone familiar with C# and .NET you should consider IronPython.", "Python for .NET.", "This would be a good way to leverage what you know and learn a new dynamic language at the same time."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Why not learn some of each.", "Studying a language for a week or so won't make you an expert, but it will answer a lot of questions in your head and plant a seed for the future."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It's important to not just read through exercises.", "Find some simple problems that can be programmed in a page or two at most and solve them with each language.", "That will help you to learn the strengths and weaknesses in the context of the way you think and how you solve problems."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "you", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "you", "childNum": 0, "tag": "em", "childList": []}]}], [{"text": ["You might be interested in looking at Windows Powershell.", "It's the latest scripting technology from Microsoft, built on .NET, and can be extended via C#."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Granted, it's not as portable as C++ or Python, but it would leverage your C#/.NET experience more readily.", "Otherwise, I would suggest C++ (and possibly C).", "Microsoft builds a lot more of its products with C/C++ than with Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]