[[{"text": ["I agree with Viktor's Jython suggestion.", "Other than that and JavaScript (which you've mentioned, and is built into Java 6+ via the javax.script package), Groovy and JRuby are also worth looking at too."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "javax.script", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"href": "http://groovy.codehaus.org/", "text": "Groovy", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://jruby.codehaus.org/", "text": "JRuby", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["By the way, you should look at Wyvern, also an MMORPG written in Java and using Jython for scripting.", "Steve Yegge, its author, has much to say about it from time to time.", ":-)"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Wyvern", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cabochon.com/"}, {"text": "Steve Yegge", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://steve-yegge.blogspot.com/"}]}], [{"text": ["I'm responsible for a fairly large hybrid Java/Jython system.", "We use java for core API development, then wire Java objects together using Jython.", "This is in a scientific computing environment where we need to be able to put together ad-hoc data analysis scripts quickly."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If I were starting this system from scratch today, I would not choose Jython as the scripting language.", "I like Python fine, but I frequently encounter awkward mismatches between the Python type system and the Java type system.", "For example, if you just want a hashtable, should you use a Python dictionary or a Java HashMap?", "The decision might be different depending on whether you are just using the data structure locally in Python code or passing it across the Java boundary.", "Jython does a certain amount of type coercion for you, but it's not perfect.", "It's annoying to even have to think about issues like this when the purpose of using a scripting language in the first place is to enhance your productivity. "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "not", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["I assume JavaScript or JRuby would have similar issues.", "Today I would choose a scripting language that is specifically targeted to the JVM and leverages the Java type system.", "The obvious candidates are Groovy and Beanshell; Groovy seems to have been picking up momentum lately so I'd look most closely at it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["How about Jython?", "http://www.jython.org/Project/"], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}, {"text": "http://www.jython.org/Project/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.jython.org/Project/"}]}], [{"text": ["Java supports a variety of (scripting) languages, some are listed in Wikipedia here and here.", "You probably should choose language with powerful DSL and metaprogramming capabilities, such as Clojure."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/List_of_Java_scripting_languages"}, {"text": "here", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/JVM_Languages"}, {"text": "Clojure", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://clojure.org/"}]}, {"text": ["But if you need something simpler, JavaScript might be a viable alternative."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["what about creating your own specialized scripting language?", "If your app is written with java, you can use ANTLR (http://www.antlr.org/) to create your language parsing code. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.antlr.org/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.antlr.org/"}]}, {"text": ["The reason I say this is because a general purpose scripting language may provide too much power (because the script it to be used for quests only i assume). "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But if making your own language is too hard then any of the above suggestions works - you just have to figure out how to bind the game's runtime into the script.", "I also suggest Lua (http://www.lua.org/) as another choice that lots of games use."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://www.lua.org/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.lua.org/"}]}], [{"text": ["Don’t use a scripting language!", "Instead focus on configurability (which is something that a non-programmer can do well)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["One oft-used argument in favour of having a scripting language is that it allows for lesser programmers to more trivial tasks.", "Don't belive this, it will not save you any time, since trivial tasks are already accomplished by real programmers in no time.", "Aim for configurability instead of scripting, and you will have a much lower risk of bleeding over complex algorithms and concepts into the incapable hands of game designers.", ":)"], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "having", "childNum": 0, "tag": "i", "pos": 0, "childList": []}, {"text": "not save", "childNum": 0, "tag": "i", "pos": 1, "childList": []}, {"text": "no time", "childNum": 0, "tag": "i", "pos": -1, "childList": []}]}, {"text": ["Lack of hotswapping (edit-and-continue) would have been a reason to implement a scripting language in an MMOG (you don’t want to reload the whole game for a minor code change), but using Java, with built-in hotswap, you really have no reason for adding a scripting language on top."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I have spent years pondering these questions; in the day I implemented a complete scripting language, IDE, VM, debugger, etc for an MMOG myself.", "Since, I have grown wiser."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If you still choose to go down the infinitely crappy path of no return, keep the following in mind."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "Pick a mature language which has been around for a while.", "tag": "none", "senID": 5}, {"text": "Auto testing, debugging and editing will suck bigtime until you make your own tools/plugins/start hacking around in the VM.", "tag": "none", "senID": 6}]}, {"text": ["To date, I have never seen a DSL that improved the situation (getting a more maintainable product).", "Myself, I integrated Python into my indie game engine, but eventually came to my senses and ripped it out.", "\"Stackless Python\" is just a way of saying \"unmaintainable but fast\".", "Please, anyone correct me if I'm wrong?"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["See Java: Scripting language (macro) to embed into a Java desktop application"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Java: Scripting language (macro) to embed into a Java desktop application", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/143388/java-scripting-language-macro-to-embed-into-a-java-desktop-application"}]}], [{"text": ["You have quite a few options:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "Groovy - ", "tag": "none", "senID": 1}, {"text": "Jython - ", "tag": "none", "senID": 2}, {"text": "JRuby - ", "tag": "none", "senID": 3}]}, {"text": ["Possibly even BeanShell (http://www.beanshell.org/)"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://www.beanshell.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.beanshell.org/"}]}, {"text": ["I'm a fan of Python myself so I'd recommend Jython, but they're probably all reasonable options. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I would have to recommend Javascript for this purpose.", "Mozilla Rhino http://www.mozilla.org/rhino/ is an excellent implementation that would fit your needs perfectly."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.mozilla.org/rhino/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.mozilla.org/rhino/"}]}, {"text": ["I recommend Javascript over Jython or JRuby because of familiarity.", "Trivial Javascript follows a very familiar syntax that anybody can use.", "However if someone wants to do something more intense, Javascript is a very powerful functional programming language."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I regularly use Groovy and Ruby professionally and believe that their purpose is best for writing parts of applications with particularly complex logic where Java is cumbersome to write.", "Javascript is a much better choice as an embedded, general scripting language to use in a game.", "I haven't used Python, but it's syntactically similar to Ruby and I would believe it's purpose would also be similar."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["LuaJ seems to be a nice way to embed Lua into Java:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://sourceforge.net/projects/luaj/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://sourceforge.net/projects/luaj/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://sourceforge.net/projects/luaj/"}]}], [{"text": ["I am a big fan of Python/Jython due to the clean syntax - which may suit you if you have some python experience. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Otherwise Groovy which is based on Java syntax and may be an easier learning curve if most of your developers are Java guys.", "It also has the advantage of closer ties with the Java language and libraries. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Beanshell is good if you have simple scripting in mind - it doesn't support classes.", "However I don't think it has had any support over the last few years (the JSR seemed to kill it off...) so is perhaps a bad choice if support is important to you."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]