[[{"text": ["Part of learning a new programming language is learning to read code in that language.", "A crutch like this may make it easier to read your own code, but it's going to impede the process of learning how to read anyone else's Python code.", "I really think you'd be better off getting rid of the end of block comments and getting used to normal Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I like to put blank lines around blocks to make control flow more obvious.", "For example:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n if foo:\n   bar = baz\n\n   while bar not biz:\n      bar = i_am_going_to_find_you_biz_i_swear_on_my_life()\n\ndid_i_not_warn_you_biz()\nmy_father_is_avenged()\n</code>\n</pre>\n", "senID": 1}], [{"text": ["You could try increasing the indent size, but in general I would just say, relax, it will come with time.", "I don't think trying to make Python look like C is a very good idea."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Rather than focusing on making your existing structures more readable, you should focus on making more logical structures.", "Make smaller blocks, try not to nest blocks excessively, make smaller functions, and try to think through your code flow more."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you come to a point where you can't quickly determine the structure of your code, you should probably consider refactoring and adding some comments.", "Code flow should always be immediately apparent -- the more you have to think about it, the less maintainable your code becomes."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Perhaps the best thing would be to turn on \"show whitespace\" in your editor.", "Then you would have a visual indication of how far in each line is tabbed (usually a bunch of dots), and it will be more apparent when that changes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"code": "<pre>\n<code>\n from __future__ import braces\n</code>\n</pre>\n", "senID": 0}, {"text": ["Need I say more?", ":)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Seriously, PEP 8, 'Blank lines', §4 is the official way to do it."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "PEP 8", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/dev/peps/pep-0008/"}]}], [{"text": ["I would look in to understanding more details about Python syntax.", "Often times if a piece of code looks odd, there usually is a better way to write it.", "For example, in the above example:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n bar = foo if baz else None\nwhile bar not biz:\n    bar = i_am_going_to_find_you_biz_i_swear_on_my_life()\n\ndid_i_not_warn_you_biz()\nmy_father_is_avenged()\n</code>\n</pre>\n", "senID": 1}, {"text": ["While it is a small change, it might help the readability.", "Also, in all honesty, I've never used a while loop, so there is a good change you would end up with a nice concise list comprehension or for loop instead.", ";)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Although the author claims its a joke, you could try pybraces.", "It would make your code look more like C."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pybraces", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://timhatch.com/projects/pybraces/"}]}]]