[[{"text": ["By this time, both implementations are reasonably mature and solid, and their functionality is pretty similar (I don't think it's quite 100% equal yet, but, moving in that direction).", "So, if you already know only one of the two languages, I'd say \"just go for it\".", "If you already know both, you don't need my advice;-)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you know neither, but are rarin' to try some of the non-Java languages that are (more or less;-) supported on the JVM side of GAE (I believe this includes Scala, server-side Javascript, JRuby, etc), then it's worth trying.", "If you know neither, and don't want to risk a \"not-first-class-supported language\", I'd definitely agree with your observation that Python's faster to learn (but of course I'm biased in favor of Python;-)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I have used both, and my conclusion is that biggest difference is in libraries.", "In theory both have good libraries to do almost everything but in practice many libraries don't work with app engine:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "All Java libraries are ", "tag": "none", "senID": 1}, {"text": "Python on the other hand have way less libraries out there, and many are just wrappers for native ", "tag": "none", "senID": 2}]}, {"text": ["As both versions have such bad support for libraries, I call it tie.", "For very simple \"just to show some content\" -web app you don't need any external libraries of course."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I use now Python because it rules.", ";)"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["\"Better\" is always subjective.", "For GAE, the choice of which is better for you depends on what you're most familiar with.", "If you've got experience with Java, use that, and if you've got experience with Python, use that.", "I don't think there's any objective criteria that would point to one being \"better\" than the other."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "for you", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["Its not just the language that you need to consider here.", "Libraries, frameworks, and tools are also relevant factors."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you have no background in either language or web development, I would suspect Python would be easier to get off the ground with.", "It has been around longer, there is likely more support and knowledge available.", "Doing something simple is generally simple to do and the Python framework is in my opinion more lightweight."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Despite this, I would rather use Java.", "However, my reasons are controversial and I don't want to troll :D."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Python was the language Google AppEngine was originally designed for, and it has been supported for longer than Java (which only got included comparatively recently).", "Additionally, Guido van Rossum, the creator of Python, works on the Python side of AppEngine.", "The same can not be said about Java's creator."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It seems that there is more documentation and articles about Python on AppEngine than Java, probably because Python has been used in AppEngine for longer."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["My advise: Use Python.", "But that doesn't mean Java is a bad choice, because it is not, I just think Python is a better choice in this instance."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Python ( subjectively speaking ) "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": [".py chosen here for all gae projects for reasons more readable, less lines code, higher level same time java has more ways to solve a given problem.", "Approx estimate same function with python is 1/10 the code compared to java."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://montao.googlecode.com"}]}], [{"text": ["i use python, becouse always can get the best of django in appengine"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I use Groovy (Grails) with GAE.", "It has Java's library universe and you should have roughly the same LOC compared to Python.", "Yeah, its not 100% Java (if you want to), but very close.", "The BIG difference is roughly the JavaVM speed, that's one of the reasons Groovy (Grails) has gained so much popularity - especially people like my who dislike Python ."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "BIG", "childNum": 0, "tag": "strong", "pos": 3, "childList": []}]}], [{"text": ["It maybe possible to use Jython in appengine so you could use both.", "One thing I would say about the python productivity vs Java productivity argument is Java has excellent IDE's to speed up development where as Python is really lacking in this area because of its dynamic nature.", "So even though I prefer to use Python as a language, I don't believe it gives quite the productivity boost compared to Java when using a new framework.", "Also I have as yet not been able to get the python version of google app engine to work in Netbeans which is a royal pain."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]