[[{"text": ["IDE: No.", "Python IDEs are nowhere near as good or mature as Matlab's, though I've heard good things about Wing IDE.", "Generally, I find IDEs to be total overkill for Python development, and find that I'm more productive with a well-setup text editor (vim in my case) and a separate visual debugger (WinPDB)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Changing functions: Modules must be reloaded after changes using the reload() built-in function."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "reload()", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n import foo\n#now you've changed foo.py and want to reload it\nfoo = reload(foo)\n</code>\n</pre>\n", "senID": 2}, {"text": ["I've switched over myself from Matlab to Python, because I find that Python deals much better with complexity, i.e., I find it easier to write, debug and maintain complex code in Python.", "One of the reasons for this is that Python is a general purpose language rather than a specialist matrix-manipulation language.", "Because of this, entities like strings, non-numerical arrays and (crucially) associative arrays (or maps or dictionaries) are first-class constructs in Python, as are classes. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["With regards to capabilities, with numpy, scipy and matplotlib, you pretty much have the whole set of functionality that Matlab provides out of the box, and quite a lot of stuff that you would have to buy separate toolboxes for."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["You might also want to check out some of the answers in the following thread, although they don't address your 2 major concerns:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Should i switch to Python?"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Should i switch to Python?", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/5063037/should-i-switch-to-python/5065585#5065585"}]}, {"text": ["I'm also a total convert from Matlab:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["As others have mentioned, since the numerical/quantitative libraries came to Python instead of a numerical library hacking a language on top, you have an incredible amount of flexibility that you don't have with Matlab.", "Also the Python community, especially in the numerical/quantitative areas, is really quite fantastic. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["We use the Wing IDE for Python development.", "It is quite well featured, has integrated debugging support, and can be connected to the profiler of your choice."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Wing IDE", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wingware.com/"}]}, {"text": ["Regarding (2), I know exactly what you mean since I miss that very same feature from Lisp, and so far as I know you need to actively reimport the libraries after changing them.", "This isn't a real hangup, though, since you can easily write (once) a small function that does that for every module you care about, and then put that function on a key macro so all you have to do is eg hit CTRL-T after changing code."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "eg", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["I've been getting on very well with the Spyder IDE in the Python(x,y) distribution.", "I'm a long term user of Matlab and have known of the existence of Python for 10 years or so but it's only since I installed Python(x,y) that I've started using Python regularly."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["almost everything is covered by others .. i hope you don't need any toolboxes like optimizarion toolbox , neural network etc.. [ I didn't find these for python  may be there are some .. i seriously doubt they might be better than Matlab ones..]"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["if u don't need symbolic manipulation capability and are using windows python(x,y) is the way to go[they don't have much activity on their linux port (older versions are available)]\n(or need some minor symbolic manipulations use sympy , i think it comes with EPD and python(x,y) supersedes/integrates  EPD)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["if you need symbolic capabilities sage is the way to go, IMHO sage stands up good with Matlab as well as Mathematica .."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["i'm also trying to make a switch  ...(need for my engg projs)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["i hope it helps .."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Concerning the IDE question, have look at What IDE to use for Python?, where the top answer is PyDev which uses Eclipse."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "What IDE to use for Python?", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/q/81584/321973"}, {"href": "http://pydev.org/", "text": "PyDev", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["I also think Sage might be worth looking at"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Sage", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.sagemath.org/"}]}], [{"text": ["Also look at the Python/Jython IDE from the jHepWork project"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "jHepWork project", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://jwork.org/jhepwork/"}]}, {"text": ["It has a code assist which is especially designed for Python/Jython and Java.", "This IDE  contains complete syntax highlighting for Python, bracket matching, indentation matching.", "Finally, the output graphics is a way better than in Matlab "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]