[[{"text": ["\"but from a business point of view it's not that easy.", "\"  It's worse.", "From a business point of view technology change is essentially impossible."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In order to make \"business case\" you often need incontrovertible, absolute return in investment numbers.", "There aren't any such numbers for any programming language.", "Show me the ROI for VB or Java, and I'll show the ROI numbers for Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So, you can't really do this in \"hard\" dollars and cents."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Further, every business person will raise the \"risk\" issue.", "What's the risk of new technology?", "What's the risk of change?", "What's the risk of driving to work in the morning?", "What's the risk of the sky falling?  "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["There's only two \"business cases\" that actually work when you don't have risk-free dollars and cents kind of numbers."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The first approach is called \"benchmarking\".", "The second approach is called \"skunk-works\"."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["The skunk works approach makes you put your money where your mouth is.", "If it's better, then succeed using it.", "Once you succeed, the business case is -- well -- indisputable."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["Google uses it!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["My justification would be along the lines of preparing for cross-platform compatibility in the future.", "Yes, Perl is available on multiple platforms, but it doesn't enforce good coding style as typically as does Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you needed to be able to point to applications using Python, the following pop to mind right-off: Google; Smithsonian website (Plone); NASA website (Plone); Red Hat's installer (Anaconda) and update utilities (yum and up2date); Zenoss network monitoring; Rice University's Connexions site (Plone with extensions); more here: http://plone.net/sites. "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://plone.net/sites", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://plone.net/sites"}]}, {"text": ["The product I work with on a daily basis for handling server management utilizes Python heavily, and it's used by dozens of top companies around the world on [almost] every major platform: HP-UX, AIX, Solaris, RHEL, SuSE, Windows.", "(No shameless plug for my employer or the product name!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I'd personally argue that finding Python developers will also tend to make those applying more likely to be Good, but that may be personal bias."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You ask \"what specifically could it do that we can't do today?", "\"  Since you probably are asking what things Python makes much easier to save time/money, you may find this stack overflow question helpful (the first answer lists lots of things that Python makes easy that are much more difficult in Java): http://stackoverflow.com/questions/49824/java-python"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://stackoverflow.com/questions/49824/java-python", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/49824/java-python"}]}, {"text": ["Also, as far as introducing Python to your team, someone else asked a similar question, and the first answer details the pros and cons of switching and when it might be a good or bad idea: http://stackoverflow.com/questions/19654/introducing-python"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://stackoverflow.com/questions/19654/introducing-python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/19654/introducing-python"}]}, {"text": ["Plus, as others have pointed out, Python is used by Google, the Washington Post, Industrial Lights and Magic, and NASA.", "So hopefully that should help overcome any objections that real projects/businesses don't use Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You can get more done in less time."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It's easier to maintain."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You don't need to change languages to rewrite something that started out as a script and has grown into an application."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["This is where I would start:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["it will make development more efficient and more stable, saving time (=money) and increasing quality.", "Here are the beginnings of a justification of this."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": [], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": [], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Some personal bullets:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "Industry studies have shown a two- to five-fold increase in programmer productivity when using a high level language.", "tag": "none", "senID": 5}, {"text": "The industry started in assembly, migrated to C, and now migrates again to HLLs.", "tag": "none", "senID": 6}, {"text": "HLLs enhance programmer productivity, LLLs give raw performance.", "tag": "none", "senID": 7}, {"text": "Games are performance critical, but only in certain places. Simulation is computationally intense, game logic not. Use a HLL - when you can: pay a small runtime performance cost, and receive a tremendous boost in developer productivity.\nWhats the point of making the code you write fast, if you don’t have enough time to finish the product?", "tag": "none", "senID": 8}, {"text": "If you write something and find its too slow, you can always go back and optimize it.", "tag": "none", "senID": 9}, {"text": "You can’t recover time spent writing code that was abandoned. Prototype in HLLs. ", "tag": "none", "senID": 10}]}, {"text": ["If python isn't a huge improvement over whatever other scripts you are using, then perhaps it actually isn't worth the effort."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}], [{"text": ["what specifically could it do that we can't do today?", "I've had this discussion with a co-worker of mine who loves Python.", "From a developer's point of view it may be obvious, but from a business point of view it's not that easy"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "what specifically could it do that we can't do today? I've had this discussion with a co-worker of mine who loves Python. From a developer's point of view it may be obvious, but from a business point of view it's not that easy", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["Why in the world are you trying to push for a change to Python if you don't know that it will save you time or money?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You cannot divorce the technological reasons from the business reasons.", "You exist at work to save money with technology.", "They are not at cross-purposes."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you can't answer this question yourself, you have no business trying to convince someone else that it's a good idea."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Try teaching anything else to non-programmers.", "Python is readable and can be made simple enough for non-programmers to maintain.", "Yet it is full-featured enough to do anything.", "Python is indeed \"batteries included\".", "It does run everywhere and powerful packages such as SCons make it a no-brainer. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"tag": "ul", "num": 3, "lis": [{"text": "Bring up specific APIs and/or features that could solve real problems you have", "tag": "none", "senID": 0}, {"text": "See if it can bring exitement to the rest of the team before making the case", "tag": "none", "senID": 1}, {"text": "Microsoft \"", "tag": "none", "senID": 2}]}], [{"text": ["For many classes of problems, Python hits the sweet spot of power-vs-development speed: it's significantly more powerful (and maintainable) than batch/VBScript, but has a lot less overhead (and is usually much faster to develop in) than Java et.", "al."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Python lets you migrate your code to cheap Linux servers should you want to, or lets your GUI applications run unchanged on OS X."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If Microsoft ever abandons .NET, it's dead.", "Think that won't happen?", "So did my company when we wrote hundreds of KLOC in Visual FoxPro.", "So did all the people stuck with huge VB6 codebases that can't be migrated to VB.NET.", "If Google gets bored with developing Python, there are many other qualified groups who could step in to maintain it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I also firmly disagree that Java or .NET can solve \"bigger\" problems than Python.", "I really can't think of any projects I've seen in either of those that couldn't have been done in Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So, I guess I'd turn the question around.", "Given a well-supported, popular, cross-platform, Open Source language suitable for tiny and huge projects, why wouldn't you pick it?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You can start small by writing any new helper scripts (e.g.", "build files, utility files, etc.", ") using Python instead of VBScript or batch files.", "This allows other developers (and managers) to see the usefulness and versatility of Python.", "This is a low risk path.", "As others in your organization become more familiar and comfortable with the presence of Python then perhaps later on it can be a more palatable option to use Python on bigger projects."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "new", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Using Python for general scripting in place VBScript and batch files is not unusual in the Windows world.", "Microsoft supports it on its TechNet site as one of the languages (alongside VBScript, Perl, etc.", ") for which it provides sample scripting files."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Microsoft supports it on its TechNet site", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.microsoft.com/technet/scriptcenter/scripts/python/default.mspx?mfr=true"}, {"text": "alongside VBScript, Perl, etc.", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.microsoft.com/technet/scriptcenter/scripts/language.mspx?mfr=true"}]}]]