[[{"text": ["Code is usually read many times, and it is written only once.", "Saving writing time at the expense of readability is not usually a good choice, unless you are doing some throw-away code."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}, {"text": ["The second version is less explicit, and you need some time to understand what the code is doing.", "And we are simply talking about variable instantiation, not about algorithms!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["A good text editor can make these things a non-issue.", "For example, I can type the following line in my code:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n print `\"January February March April May June July August September October November December\".split()`\n</code>\n</pre>\n", "senID": 1}, {"text": ["And then using the key sequence V:!python&lt;ENTER&gt; I can run the line through the python interpreter, and the output is the following:"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "V:!python&lt;ENTER&gt;", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']\n</code>\n</pre>\n", "senID": 3}, {"text": ["I'm using Vim for my example, but I'm sure this is just as easy with Emacs, TextMate, etc."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["In a reasonably smart editor you could:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Readable and easy to type... respect the power of the editor!"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "and", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["In general, I think this is a bad idea.", "The first example isn't SO bad (it's sort of a substitute for python's lack of qw), but the second is much more difficult to understand.", "In particular, I think this sort of thing is very unpythonic, and certainly not appropriate when writing Python code, at any rate.", "Code readability is much more important than saving a little time writing the code.", "If you really have THAT much data to hardcode, write a script to generate it for you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["How often do you really need to type [\"January\", \"February\"... etc]?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "[\"January\", \"February\"... etc]", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Granted your approach might save you time but why add complexity to your code for no good reason other than you are a bit lazy?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you really do have to type it that often... Copy-Paste!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["In production code, do it the right way.", "In test code, as long as this idiom shows up more than once or twice, I think this is acceptable.", "If, in test code, this situation shows up once or twice, do it the right way. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think such a thing should be done only once per program.", "If you do the same \"all over the place\" then it doesn't matter which one do you use, you're creating a monster. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Such declaration should be written only ONCE for all the code. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It's a reasonable thing to do for data that you don't expect to change, such as months or days of the weeks.", "It's also reasonable to do this while mocking up or stubbing out interactions with files or databases, because it isolates your code for testing.", "However, this isn't a good long-term solution for production code, nor does it really save you much time.", "Anything big enough to allow big time-savings is big enough to require storing data someplace else, like a separate file o a database. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I all but swear by Steve McConnell'sCode Complete: one of the core insights is that bad programmers write code in order to get computers to do something, period, while good programmers write first to write code that people can understand and only second to get the computer to do things."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Steve McConnell'sCode Complete", "tag": "a", "pos": 0, "childList": [{"text": "Code Complete", "tag": "em"}], "childNum": 1, "href": "http://www.powells.com/partner/24934/biblio/9780735619678"}, {"text": "Code Complete", "childNum": 0, "tag": "em", "childList": []}]}, {"text": ["(Having code that is written without readability as a major concern is like trying to find things in a closet or filing cabinet where people just cram stuff in without any thought to making something you can navigate and find things in."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think you could profit a lot from reading Code Complete; I know I did."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Code Complete", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["your quick and clever methods while nice, take more time to read which is not good.", "Readability comes first always.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I don't think that type of thing should be in the source."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If I were you, I'd have Python evaluate the respective second versions and then paste the results into my source code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think putting statements like"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["\"January February March April May June July August ...\".split()"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["at module global level is fine.", "This way it is only executed once during import.", "I even sometimes use it in non-performance critical functions because of the reduced line noise. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["On a sidenote i think that Python Interpreters could be made to execute the \"split()\" at compile-time which would eradicate the method-call overhead.", "Reason being that a string is a builtin literal and Python does not allow to add/override methods on the very base string type so the compiler can know that \"\".split() can only refer to one specific method. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I would find this acceptable, if a bit lazy, as long as what is being done isn't too performance critical.", "You could always go back and optimize it if you need more speed."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]