[[{"text": ["I wrote a script that uses my cellphone's bluetooth ID as a sort of physical security token.", "When the PC (Windows) resumes from sleep, it scans for nearby Bluetooth devices, and if it doesn't locate my phone, locks the workstation. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Corny, and not very secure, but serves its purpose. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n \"\"\"\nIntended to run on Windows resume. Scans for bluetooth devices and if a \nparticular device is not present, locks the computer.\n\"\"\"\nimport bluetooth\nimport ctypes\nimport sys\n\n# Bluetooth UID of \"token\" device\nwanted = \"XX:XX:XX:XX:XX:XX\"\n\nprint \"performing inquiry...\"\n\n# Hack.... if 0 devices are present, pybluez throws an exception\npassed = False\ntry:\n    discovered = bluetooth.discover_devices()\n    if wanted in discovered:\n        print \"Found phone\"\n        passed = True\n    else:\n        passed = False\nexcept:\n    passed = False\n\nif not passed:\n    print \"Locking\"\n    ctypes.windll.user32.LockWorkStation()\n</code>\n</pre>\n", "senID": 2}, {"text": ["Requires:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Another idea: Read The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!", ") from \"Joel On Software\" and then write a utility to scan all the HTML files on your system and make sure they are encoded correctly.", "That is, make sure that the content-type the page claims to have is the same as the one that was actually used."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!)", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.joelonsoftware.com/articles/Unicode.html"}]}], [{"text": ["Using Python 2.5 I wrote a script that dumps my Subversion repository, compresses the dump file and scp's it over to two backup servers.", "Email me with the results of the backup.", "This is done on a daily basis.", "Having done this I realised how much I like Python and how powerful it can be. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The next step is to modify the script to use rsync and copy over some web site backups as well. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Certainly showed me the utility of Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The two self-made  tiny text-utilities I use the most are \"sum\" and \"checkUTF8\".", "The first is a filter that sums up the lines in a file on standard input, like so: "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n $ grep '[0-9.]' somefile | sum\n567567\n</code>\n</pre>\n", "senID": 1}, {"text": ["... needless to say, I do alot of exploratory log-crunching."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The second checks whether at text-file is properly encoded in UTF8 and if not, shows the line number, byte offset, character offset and actual text of the problem line, with the start of the problem area highlighted.", "This makes it possible to correct the problem with a hex-editor, if necessary.", "It is much less of a problem now than when I converted from iso8859-1 to utf8, but it still happens."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Though \"sum\" is easily made in any scripting language you need good unicode-support for the other one."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I also wrote a PyZip utility to do quick backups.", "It takes a filename template and a list of file patterns, something like this:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n pyzip store\\ProjectFiles-[date] *.py *.txt\n</code>\n</pre>\n", "senID": 1}, {"text": ["if the \"store\" folder doesn't exist, it is created"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["if the template filename doesn't include \".zip\", it is added"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["a [date] token is replaced with the current date, 20090624"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["likewise for [time], 155859"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I'm working on a [#] token to be replaced with the next matching number based on existing filenames matching the whole pattern, for numbered instead of date-stamped backups"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["as time goes on, I'd like to replicate as much of the old PKZip command line capability as possible, and create a corresponding PyUnzip"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"tag": "hr", "senID": 8}, {"text": ["I generally use ActiveState Python on Windows machines, and this comes with the win32 extensions, so I have been writing lots of ActiveDirectory management scripts, Word and Excel COM automation, managing small SQLite database, and lots of other things that I used to do with VBScript, and many things that couldn't be done (easily anyway) with VBScript."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}], [{"text": ["I wrote a script that uses rsync to backup a remote directory tree on a local drive, and then starts rotating the backups after an arbitrary number of runs using only the deltas (sorta like time machine on the mac).", "Got that sucker running on a few geographically separate machines and feel much better about the safety of my data from destruction at least."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Large parts of the script were ported from other people's bash scripts, so that provided a nice stable feature scope to crib off of - maybe taking a look at some utility shell scripts would give you an idea to \"translate\" it into python, thus making it a little more extensible and readable."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You can check out the repo on bitbucket."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "repo", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://bitbucket.org/prairiedogg/pd%5Frsync/"}]}], [{"text": ["I wrote a script to find all the jar files on my system and build a java classpath environment variable to set when my shell starts up interactively.", "That one script saved me many hours of problems."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["When I needed to use a new jar, I just downloaded it, and reran the script."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I wrote a related script that let me search for a particular Java class name/file/etc in all of the jars on my system."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["In general, find the simple repetitive tasks that you do each day and write a script to do them.", "You'd be amazed how much time you can save, and how much you'll learn."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["For example, it's surprisingly easy to write a program that puts an icon in the system tray that changes according to whether you have any new unread emails."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I made a snippet that listed the total, remaining and used space of each hard drive on the system in neat columns.", "Needed it for reporting uses."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also made an email log parser, which was a quite funny exercise.", "I had not used custom state machines prior to that very much, but this got me really interested in their potential applications (pretty much everything hehe."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["How about something that looks at the magic numbers of all the files in a given directory and fixes the file extension if necessary.", "For example, if a .wav file starts with \"MThd\" it's probably a Midi file that somehow got misnamed."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "magic numbers", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Magic%5Fnumber%5F%28programming%29#Magic%5Fnumbers%5Fin%5Ffiles"}]}], [{"text": ["I used Python as a simple stats script (things like battery, cpu usage, memory) to pipe into the dynamic bar in dwm."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Similarly as a backend to Openbox's pipe menus."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["There are many custom log analyzers, installers, version checkers etc.", "Some scripts gather data for visualization in tools like Cacti or MRTG."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You can find mamy system utilities written in Python at Python Recipes"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Python Recipes", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.activestate.com/recipes/langs/python/"}]}], [{"text": ["I have lots of songs, videos and images which I dump into folder named very intuitively \"myfolder\", i try to be organize but with time I have found many duplicate songs in various folders, same images at multiple places and so on"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["so i have written a script which i run to delete duplicate files, that could be a interesting exercise. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["SO question http://stackoverflow.com/questions/748675/finding-duplicate-files-and-removing-them does implement similar script :)"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://stackoverflow.com/questions/748675/finding-duplicate-files-and-removing-them", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/748675/finding-duplicate-files-and-removing-them"}]}], [{"text": ["I once wrote a small Python module that I integrated with the \"cleanup\" utility menu on WinCVS.", "It provided a convenient shortcut to easily remove all those files that Microsoft Visual Studio generates per project that should not be put under version control but were somehow committed in. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "WinCVS", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.wincvs.org/"}]}], [{"text": ["Have a look at the book Python for Unix and Linux System Administration.", "You will probably find some inspiration there."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python for Unix and Linux System Administration", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9780596515829/"}]}], [{"text": ["Try writing a very simple e-mail client, as a step toward being able to e-mail your computer specialized messages that tell it to do specific things, like run a job, reboot, reply with some information, etc."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["On the Windows platform, I wrote a wrapper class around the win32file.FindFilesW() API (from the python extensions for Windows package) to efficiently calculate the total size of any given folder, local or remote.", "The API is itself a wrapper around the FindFilesW() function from the Win32 API.", "For my class object, I added additional features that were very helpful beyond just getting the total folder size.", "In particular, I added a feature to capture the full path of files and sub-folders that were denying access so that I could know whether I was getting a skewed or true result; I added a feature to retrieve the total size up to a certain amount (in case I only wanted to know whether any data existed at all, e.g.", "1 byte, 15 bytes, 1MB, etc.", "); and I added a feature to continue on access denied errors.", "I did these because in VBScript (which I originally used, for political reasons), the ability to capture the total size of a given folder will fail if it encounters any access denied errors.", "And in the Windows Explorer shell, looking at the properties of a folder will tell you the total size, but not notify you if any access denied errors were encountered, thus potentially skewing the size property without you knowing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I wrote a util to rsync, set user/group and normalize my music collection.", "Yeah it could have been done in bash but I suck at bash."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I sort of a continuous integration process for some javascript code at a former employer that worked off of post commit hooks in mercurial to do various operations like minify/compress run YUItest and other steps that were needed to get it ready for production use.", "I doubt they are still using it though.", "It was built in an attempt to save me some frustration."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["More recently I built a script to rip through a bunch of jwc's and generate png's via graphviz showing the dependencies between all the tapestry components in my current employers code base.", "We will probably be working that into the CI for our nightlies at some point."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["And lastly, about 3 years ago, I replaced about 10K lines of really nasty t-sql with what ended up being a full blown py-tk app for migrating customers data from version of the app to another. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["There's been various utils to parse and pull various things out of server logs in a pinch."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["other fun stuff."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"tag": "ul", "num": 4, "lis": [{"text": ["An automatic unarchiver, because I got sick of remembering all the tar flags."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "tar", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Scripts to send IP updates to my no-ip and OpenDNS accounts (Mainly using urllib, and re to check the response)"], "childNum": 4, "tag": "p", "senID": 1, "childList": [{"text": "urllib", "tag": "a", "pos": 0, "childList": [{"text": "urllib", "tag": "code"}], "childNum": 1, "href": "http://docs.python.org/library/urllib.html"}, {"text": "urllib", "childNum": 0, "tag": "code", "childList": []}, {"href": "http://docs.python.org/library/re.html", "text": "re", "childNum": 1, "tag": "a", "childList": [{"text": "re", "tag": "code"}]}, {"text": "re", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Tool to calculate total disc space, total used, total free, and display it in human readable terms.", "Could use either os module, or parse the output of the df command (using the subprocess and re modules).", "You also need to write a function to turn the number of bytes into GB/TB/etc"], "childNum": 8, "tag": "p", "senID": 2, "childList": [{"text": "os", "tag": "a", "pos": 1, "childList": [{"text": "os", "tag": "code"}], "childNum": 1, "href": "http://docs.python.org/library/os.html"}, {"text": "os", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "df", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "subprocess", "tag": "a", "pos": -1, "childList": [{"text": "subprocess", "tag": "code"}], "childNum": 1, "href": "http://docs.python.org/library/subprocess.html"}, {"text": "subprocess", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "re", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "GB", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "TB", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Youtube FLV file downloader, perhaps using urllib to retrieve the source, BeautifulSoup to parse the HTML, and urllib again to download the file (the Firefox Live HTTP Headers addon helps working out how it resolves the flv URL)"], "childNum": 4, "tag": "p", "senID": 3, "childList": [{"text": "urllib", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"href": "http://www.crummy.com/software/BeautifulSoup/", "text": "BeautifulSoup", "childNum": 0, "tag": "a", "childList": []}, {"text": "urllib", "childNum": 0, "tag": "code", "childList": []}, {"href": "http://livehttpheaders.mozdev.org/", "text": "Firefox Live HTTP Headers", "childNum": 0, "tag": "a", "childList": []}]}]}]]