[[{"text": ["A register machine is a hardware or software unit that when working with data takes it from memory, puts it in a location where it can work with it quickly, and then returns the result."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For example a regular CPU is a register machine.", "Since the ALU (the unit that works with numbers in a CPU) can only work with numbers in a register."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["A stack based machine adds the data onto a stack and then either pops or pushes stuff onto it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For example, adding two numbers would be"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n Push 2 // Push 2 onto the stack\nPush 3 // Push 3 onto the stack\nAdd // Add the top two things on the stack.\n</code>\n</pre>\n", "senID": 4}, {"text": ["When in a register machine it would be something like this."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n Load x, r0 // Load x onto register 0\nLoad y, r1 // Load y onto register 1\nAdd r0, r1, r2 // Add 1 and 2 and store the result in register 2\n</code>\n</pre>\n", "senID": 6}], [{"text": ["A register machine almost always has a stack, also."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But a stack machine rarely has architecturally visible registers, or it may only have one or two."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["A register machine may have some stack ops and may even have a stack addressing mode."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The difference is one of orientation.", "The register machine will mostly have instructions that operate on registers, and will have a handful of ops for loading and storing between the registers and the stack or memory."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["A stack machine .. and these are very rare as actual hardware devices .. will operate directly on the stack with its instructions and wll have a handlful of ops for loading and storing between the stack and memory."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Now, the reasons that hardware register machines are faster than hardware stack machines are possibly unrelated to the reasons that software \"register\" VM's are faster, according to the cited paper, than software \"stack\" machines."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["For the software VM's, it's apparently the case that fewer instructions need to be executed.", "This was determined empirically according to claims in the cited paper, but I imagine it's because far fewer overhead instructions like push, pop, and exchange need to be done in the register machine, and because the register machine can reuse operands easily if they are still lying around in the register file, without needing load or push ops.", "Of course, it's all just memory really; they are virtual registers."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["A register machine uses a fixed number of registers or buckets for storing intermediate values for computation.", "For example the \"add\" instruction could add the values in two specific registers and store the result in another register."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A stack based machine uses a stack for storing intermediate values during computation.", "For example, to add two numbers the \"add\" instructions pops off two values from the stack, adds them, and pushes the result back onto the stack."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Not really.", "A stack of some sort is pretty much the only way to implement recursive function calls.", "But a \"stack-based machine\" goes much further in doing everything via the stack.", "Not just function calls, but also arithmetic operations.", "In a way, they behave as if every machine instruction is a function call handled via the stack.", "It makes for a very simple machine design, but rather hard-to-write assembler/machine code."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "everything", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["A register machine has some fast internal storage (registers) and performs most of its operations on data in these registers.", "There are additional machine instructions for copying data between registers and main memory."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["IIRC there are two kinds of stack machines:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "Accumulator machines have an \"accumulator\", which is basically a single register that holds the result of calculations (and may also supply an operand), with most machine instructions operating on the accumulator.", "tag": "none", "senID": 3}, {"text": "\"Pure\" stack machines put the result of calculations on top of the stack after consuming the operands.", "tag": "none", "senID": 4}]}], [{"text": ["A register machine is an abstract machine whose opcodes are defined by reference to their operation on a set of named registers, rather than by their operation on the top portion of a stack."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In a register machine: add could be defined to take three register names as operands, add the contents of the first two, and place the result in the third.", "(More common is the design where only one or two are named and the result always goes in a special accumulator register, but that's not the point."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In a stack machine: add could be defined to pop two operands from the stack, add them, and push the result onto the stack."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Did your compiler generate machine code?", "If so, then its target was a register machine (nearly all CPU designs are register machines)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Stack machines store all values on a stack, whereas register machines have a fixed number of storage slots whose \"addresses\" do not change (unlike stack machines)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]