[[{"tag": "ul", "num": 2, "lis": [{"text": "If you're looking to ", "tag": "none", "senID": 0}, {"text": "If\nyou're looking to ", "tag": "none", "senID": 1}]}, {"text": ["Python 3.1 doesn't have the same library support (yet!", ") as Python 2.6, so you'll encounter difficulties working with existing software projects.", "If you're not pressed to produce a working product at this very moment, I'd suggest trying out Python 3.1.", "And there is no better place to start than Dive Into Python 3, as has been mentioned by Clint.", "Good luck!"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Dive Into Python 3", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://diveintopython3.org"}]}, {"text": ["UPDATE 2011-2-27: I'd say that support for Python 3 is improving constantly and you might want to check and see if your project can't be done with Python 3.", "There's a website devoted to tracking support for Python 3: http://getpython3.net/"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://getpython3.net/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://getpython3.net/"}]}], [{"text": ["I would go with 2.6 for a couple of reasons."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You really want to stick with the later version.", "Python 2.6 and the rest of the 2.x versions that come out are really for compatibility.", "However, this is not true if you want to use a framework like Django right away because it is incompatible with the 3.x series at the moment."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A tip for learning Python?", "Just start using it and find online documentation for it.", "I feel it's an easy (and awesome) language to pick up."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You would want to go with 2.6 today."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Why?", "Because there is no library support for 3.1.", "We've just finished porting setuptools (under the name Distribute) to Python 3, so hopefully library support for Python 3 will increase dramatically during the next year, but it's not there yet."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And it's not so hard to switch.", "It's not like it's a whole new language, like some Python critics make it sound like.", "So if you start with Python 3, it's no disaster either.", "It's just that it's going to be hard to actually be productive in Python 3 at the moment.", "So go with 2.6."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you're looking to learn python: http://diveintopython3.org/ was recently finished and can be read completely free online or you can buy the hardcopy.", "It's a great tutorial and introduction to the language."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://diveintopython3.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://diveintopython3.org/"}]}], [{"text": ["As for tips on learning Python, I would work through the main tutorial (http://docs.python.org/3.1/tutorial/) and then explore the Beginner's Guide.", "O'Reilly's Learning Python is pretty handy if you prefer using a book."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://docs.python.org/3.1/tutorial/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/3.1/tutorial/"}]}], [{"text": ["If you want to use existing libraries and modules written in C/C++ or use SWIG, you'll have to use python2, otherwise I don't really see a reason to stick with python2."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]