[[{"text": ["You could use Ant, Makefile, or a batch script.", "Or a combination of them."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I use Puppet for some of the deployements / initial configuration of server.", "Maven and Ant for Java based projects."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Go for KWateeSDCM.", "It comes with a straightforward web GUI and does not require obscure scripting and integrates nicely with your build chain via a REST API."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["We use Maven and pull out to the ant-plugin when required.", "In turn the ant-plugin very occasionally calls out to some native scripting language/application/packager/whatever but we're finding that over time we can generally find a Maven or ANT plugin/task to do the trick."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "very", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["You might want to look up Continuous Deployment, it's a pretty hot topic in the  build and CI space right now."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["For Python you could use Fabric or Paver\nFor Ruby, there's capistrano and 'vlad the deployer'\nFor Java, it's the Ant."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For PHP/Python projects I also use Peritor Webistrano, a neat frontend for capistrano.", "It involves changing a few of the default recipes to remove the rails-specific stuff, but it's worth it once you get it setup correctly."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think the best choice you could do is using maven.", "Even if maven is mostly used for Java projects, you can with the right plugins (or the one you write) deploy anything anywhere."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["you can use maven, ant, ivy along with hudson for java projects."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["We use Ant or Maven for different projects we have in house (depending on the need and how old the project is too...).", "We tend to use Jenkins (formerly known as Hudson) as our build and deployment tool."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And then we encourage developers to write code that does not hard code to DB's, URL's, etc.", "We try to abstract via the container (ie, Data Sources, pure JMS API's, etc) when running within an app server.", "And we tend to abstract environment specifics via properties files that we look up at runtime.", "The path to the properties file is to be defined as a variable on the server.", "This way we can be flexible enough to build code once and move it through to all our environments."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]