[[{"text": ["Well, Google uses a lot of Python, so there goes that argument..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Scalability is a complex issue, and can never be reduced to saying that X is more scalable than Y. Scalable how?", "Memory?", "Speed?", "Storage?", "It's like saying that PHP is greener than Python, or the other way around.", "It's just utter nonsense."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["If you design a solid architecture.", "If you are able to make it evolve quickly.", "It will scale. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Yahoo!", "uses PHP, Google uses Python.", "But both use C/C++ for resource intensive processing, because you won't use an interpreted language for that anyway."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Now the real deal is, which one will let your team scale the most easily ?", "Since I worked with Python and PHP a lot, I tend to think that the first one leads to a much easier to debug / maintain code.", "And when your project will grow, your team will follow, so its an important point to take in consideration."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["What some folks like to say is this."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PHP is embedded within Apache, and uses relatively little memory."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python is less often embedded within Apache, and uses more memory than PHP.", "Python is sometimes run as a separate daemon process.", "(It can also be embedded, so one could run head-to-head tests, FWIW.", "It's not worth much trying to do head-to-head, more on that below."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["We don't use PHP, so I don't have numbers.", "However, the daemonized Python (via mod_wsgi) runs our transactions fast enough that I can't easily put together a load test because my laptop can't pump enough transactions through the VPN and Firewall to measure anything other than VPN delays."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Further, as our usage grows, we simply add Python daemon instances through simple Apache changes to handle the workload.", "If we eventually outgrow the VM, we'll simply split the Apache front-ends from the Python backends onto separate VM's.", "We can't foresee a limit to this kind of growth -- more Apache, more Python daemons."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["You can't easily compare PHP and Python because the approach to a web application is generally quite different.", "PHP is programming language, template language and HTTP handler in one single bundle.", "Python is just a language.", "You have to add a template processor (there are many) and an HTTP handler (there are many) to have a comparable toolset."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["In my own mind, it's not the language that matters, as much as how that language is used, and how the applications, are well written to be more scalable."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And also important is how well it works with the databases, and file i/o, what caching methods are available..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["At least that's my 2 cents."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Check out my article on scalability: http://www.tomhoad.com/blog/?p=23.", "I would argue that the way you design your app or site, and the principles you employ when building it, are far more important than what language or framework you're using."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.tomhoad.com/blog/?p=23", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.tomhoad.com/blog/?p=23"}]}, {"text": ["There's more to scalability than language or framework."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["A nice article by Jeff Atwood: PHP Sucks, But It Doesn't Matter"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PHP Sucks, But It Doesn't Matter", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.codinghorror.com/blog/archives/001119.html"}]}], [{"text": ["Little old but compare performance between php (symfony) and python framework (django).", "An element of reponse."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.alrond.com/en/2007/jan/25/performance-test-of-6-leading-frameworks/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.alrond.com/en/2007/jan/25/performance-test-of-6-leading-frameworks/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.alrond.com/en/2007/jan/25/performance-test-of-6-leading-frameworks/"}]}], [{"text": ["PHP is really no match to Python.", "I have been PHP developer for 3 years and switched to python because i feel Python is more like a hybrid language.", "Because of python flexibility features i can easily scale."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]