[[{"text": ["This question appears to have two things in it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You could use Comet, but I strongly discourage you from doing so.", "I'd just write a short Javascript, using jQuery this is really straightforward."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Comet", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Comet%5F%28programming%29"}, {"text": "jQuery", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://jquery.com"}]}, {"text": ["Another possibility is the use of an iframe that reloads every 30 seconds, this would prevent the whole page from reloading."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["If you want to do it entirely in python you can use pyjamas."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pyjamas", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pyjs.org/"}]}, {"text": ["It generates javascript directly from python code, so you avoid writing javascript yourself completely."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["JavaScript is the primary way to add this sort of interactivity to a website.", "You can make the back-end Python, but the client will have to use JavaScript AJAX calls to update the page.", "Python doesn't run in the browser, so you're out of luck if you want to use just Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["(It's also possible to use Flash or Java applets, but that's a pretty heavyweight solution for what seems like a small problem."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You need Javascript in one way or another for your 30 second refresh.", "Alternatively, you could set a meta tag refresh for every 30 seconds to redirect to the current page, but the Javascript route will prevent page flicker."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Write your output to a log file, and load the log file to the browser thru web server.", "If you need auto refresh, create a template HTML file with tag to refresh every 15 seconds:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n &lt;META HTTP-EQUIV=\"refresh\" CONTENT=\"15\"&gt;\n</code>\n</pre>\n", "senID": 1}, {"text": ["and use server side include to include the log file on the page."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "server side include", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Server%5FSide%5FIncludes"}]}], [{"text": ["If you want a dead simple way to print data from a Python script to a webpage and update automatically, you can just print from the script.", "For example, using Apache with the below Python CGI script: "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n #!/usr/bin/python \n\nimport time\nimport sys\nimport random\n\ndef write(inline=''):\n    sys.stdout.write(inline)\n    sys.stdout.write('\\r\\n')\n    sys.stdout.flush()\n\n#prints out random digits between 1 and 1000 indefinitely\nwrite(\"Content-type: text/html\\r\\n\")\ni = 0\nwhile(True):\n    i = i + 1\n    time.sleep(1)\n    write(str(i) + \"&lt;br /&gt;\")\n</code>\n</pre>\n", "senID": 1}, {"text": ["If I navigate to that in a browser (Firefox, don't know if other browsers might work differently with regards to buffering etc), it prints the digits continually.", "Mind you, it prints in sequential order so the newer data is at the bottom rather than that top, but it might work depending on what exactly you're looking to do. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If this isn't really what you're looking for, the only other way to do this is an automatic refreshing page (either in an iframe, or the whole page) or with javascript to do the data fetching. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["You can use a meta refresh tag in your iframe or page HTML source, and your CGI can print the new data each time it's refreshed.", "Alternatively, you can use javascript with an XMLHTTPRequest to read the new data in without a visual page refresh."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Is this for a real webapp?", "Or is this a convenience thing for you to view output in the browser?", "If it's more so for convenience, you could consider using mod_python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["mod_python is an extension for the apache webserver that embeds a python interpreter in the web server (so the script runs server side).", "It would easily let you do this sort of thing locally or for your own convenience.", "Then you could just run the script with mod python and have the handler post your results.", "You could probably easily implement the refreshing too, but I would not know off the top of my head how to do this."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Hope this helps... check out mod_python.", "It's not too bad once you get everything configured."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Perhaps \"long polling\" is what you're looking for?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "\"long polling\"", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/333664/simple-long-polling-example-code"}]}, {"text": ["Long polling could be described as \"HTTP push\", basically you have a (Python) script served via a web-server, which only outputs data when available.. Then you try and load this page asynchronously via Javascript, when it fails you retry, when it succeeds you do something with the data (display it, usually)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The examples in my answer are in PHP, but it it's only really 2 commands (sleep(rand(1, 10)) - the other few are to demonstrate the javascript's error handling)"], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "my answer", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/333664/simple-long-polling-example-code/333884#333884"}, {"text": "sleep(rand(1, 10))", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Well, it's not quite that simple.. You can't just serve a CGI python script via Apache, because you will run out of worker-threads, and the web-server will not be able to accept any further connections..", "So, you need to use a more specialised server.."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "quite", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 3, "lis": [{"text": "The ", "tag": "none", "senID": 4}, {"text": ["cometd"], "childNum": 0, "tag": "a", "senID": 5, "childList": []}, {"text": ["slosh"], "childNum": 0, "tag": "a", "senID": 6, "childList": []}]}]]