[[{"text": ["Two DJango e-commerce solutions you might try:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["Lightning Fast Shop"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": ["Satchmo"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}]}, {"text": ["As far as PHP goes, we've used osCommerce (demo)."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "osCommerce", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.oscommerce.com/"}, {"href": "http://www.oscommerce.com/shops/demonstration", "text": "demo", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["I've no experience with Django.", "I develop websites using Wordpress and a year ago I tested Magento (not tested it since)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I was surprised of how user friendly Magento was.", "Both front end and backend.", "It was really easy to set up.", "You can easilly customize the layout as well using Magento template API."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Here are some pros and cons:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Pros "], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Pros", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 7, "lis": [{"text": "Don't develop your own e-commerce\nsite. It's a lot of work to re-invent\nthe wheel.", "tag": "none", "senID": 4}, {"text": "By using a well know e-commers product, you will also find support.", "tag": "none", "senID": 5}, {"text": "E-commerse like Magento is easy to set up and offers the option for change look and feel to match the rest of the web site.", "tag": "none", "senID": 6}, {"text": "You can easilly combine CMS and e-commerce", "tag": "none", "senID": 7}, {"text": "E-commerse apps like Magento offers the option for custom static / dynamic pages (like a mini cms)", "tag": "none", "senID": 8}, {"text": "You will save money (development time) by using something that is already developed", "tag": "none", "senID": 9}, {"text": "Most e-commerce sites handles payment towards different banking providers.", "tag": "none", "senID": 10}]}, {"text": ["Cons "], "childNum": 1, "tag": "p", "senID": 11, "childList": [{"text": "Cons", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 3, "lis": [{"text": "Magento does not work on all servers (server configuration). This however might have changed the past year.", "tag": "none", "senID": 12}, {"text": "If free e-commers products like Magento does not sattisfy your needs, you need to buy licenses. And that costs a lot of money.", "tag": "none", "senID": 13}, {"text": "It takes a lot of time developing your own e-commerce site if you want quality and usability. There is no way you can develop a good e-commerce site from scratch in just 3 months.", "tag": "none", "senID": 14}]}], [{"text": ["I don't know anything about Django, but I faced this exact same problem a few years ago after our company decided to stop using share-it for sales and develop our own solution in PHP.", "Our problem with hosted platforms like share-it (and I assume shopify, although I've never used it) is that their fees are much higher than you would incur by just rolling your own solution and processing your orders with Paypal or something."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So you may consider doing what we did: buying pre-built shopping cart software and then extensively customizing it.", "We used Digishop, which is designed more for a online catalog-type store than our software site, but after about 2-4 weeks of adding necessary functionality it was good to go.", "Although out of the box Digishop was way too bloated for our needs, if you're familiar with PHP it should be a breeze to navigate through it and selectively add or remove features as you see fit."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Digishop", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://digishop.sumeffect.com/"}]}, {"text": ["Good luck!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Since the deadline is 3 months you should definitely use an existing, packaged ecommerce.", "I'm sure I won't be the only to point that out.", "Equally, you might find it takes all of 3 months to get up to speed with Magento - which is quasi-enterprise-complexity.", "As a compromise you might find Magento suits your needs with a little outside help from some experienced professionals.", "(I am such a professional and I like Magento for it's sophistication and features)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}, {"text": ["There are many more ecommerce solutions out there to choose from, I couldn't possibly list them all here.", "Don't feel tied to a particular language either, you might not be the only one to fix the site in future so look at the skills available to your employer.", "Python's growth doesn't compare well to other languages, such as PHP and Ruby, so may not be the future."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Python's growth doesn't compare well to other languages", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://redmonk.com/sogrady/2011/04/04/changes-programming-languages/"}]}], [{"text": ["Many of us have been in the same situation before - code-from-scratch (CFS) or use a framework. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My experience - I started scripting with Perl.", "And one of the most used module (for web programming) of PERL is CGI.", "Some considered it a 'heavy' module and thus a few had developed a 'lighter' version of it.", "For a newbie, this could be confusing - which module to use?", "Browsing the archive mailing lists of Perl, I came across what I still consider a gem of a wisdom - what you don't know matters as much as what you know. "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "what you don't know matters as much as what you know", "childNum": 0, "tag": "strong", "pos": 4, "childList": []}]}, {"text": ["This perl guru reminded everyone that the CGI module had been reviewed by many developers.", "He went on to explain how the way strings was handled by C (Perl is made with C) was used by crackers to exploit web apps, but the CGI module had code to prevent such security exploits.", "He went on to add that NONE of the new CGI modules thats he had come aross had code to prevent this same exploit because none of them were aware about this issue!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["And ofcourse, like James Black commented on your question, you need to consider the time factor too. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["When selecting a framework or module:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["At the end of the day, the answer comes down to how comfertable you are with both options.", "In the past when I have come across the 2 options, I usually go with the preexisting solution."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Reason to create your own:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["Flexability"], "childNum": 0, "tag": "strong", "senID": 2, "childList": []}, {"text": ["You know the code"], "childNum": 0, "tag": "strong", "senID": 3, "childList": []}]}, {"text": ["Reason to use a out of the box/open source solution "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["Community"], "childNum": 0, "tag": "strong", "senID": 5, "childList": []}, {"text": ["Preexisting API solutions"], "childNum": 0, "tag": "strong", "senID": 6, "childList": []}, {"text": ["Security"], "childNum": 0, "tag": "strong", "senID": 7, "childList": []}, {"text": ["Timeline"], "childNum": 0, "tag": "strong", "senID": 8, "childList": []}]}, {"text": ["I'd have to put my vote in for using Zencart as a solution.", "I've used then on several occation and the software has never let me down.", "They have a great community, much more so than oscommerce which feels pretty dead at this point. "], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "Zencart", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.zen-cart.com/"}]}, {"text": ["Also with zencart you can make static pages where you can put whatever content you want on them.", "You could of course also put a second CMS to handle the static pages. "], "childNum": 0, "tag": "p", "senID": 10, "childList": []}], [{"text": ["If you are leaning between Magento/Satchmo and you prefer Django, definitely go with Satch.", "I've worked with both and frankly Magento is a nightmare to work with (if that looks like a fun time go for it).", "In my experience Django/Satchmo are much more flexible and easier to customize, as well as easier to maintain, plus you can take advantage of Django's rich ecosystem of packages.", "And seriously Python > PHP."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Magento is a nightmare to work with", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.magentocommerce.com/knowledge-base/entry/magento-for-dev-part-1-introduction-to-magento"}, {"text": "Django's rich ecosystem of packages", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://djangopackages.com/"}]}, {"text": ["In the long run I think you'll be much better off with Django/Satchmo.", "At some point in the distant future (because no project is ever truly finished, nor as simple as your initial requirements might imply) your client will come back and say \"Oh, well...we really wanted X to happen when user Y does Z\".", "And at that point you'll either say \"Sure no problem, your site is built on Django so that's a piece of cake!", "\" or go into convulsions because you'll think of all the work that will entail with Magento."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]