[[{"text": ["If you use A, you could copy paste your block in python shell, B will get unexpected indentation error."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "A", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "B", "childNum": 0, "tag": "strong", "childList": []}]}], [{"text": ["The PEP 8 does not seem to be clear on this issue, although the statements about \"blank lines\" could be interpreted in favor of B.", "The PEP 8 style-checker (pep8.py) prefers B and warns if you use A; however, both variations are legal.", "My own view is that since Python will successfully interpret the code in either case that this doesn't really matter, and trying to enforce it would be a lot of work for very little gain.", "I suppose if you are very adamantly in favor of one or the  other you could automatically convert the one to the other.", "Trying to fix all such lines manually, though, would be a huge undertaking and really not worth the effort, IMHO."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PEP 8", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/dev/peps/pep-0008/"}]}], [{"text": ["That empty line belongs to foo(), so I would consider A to be the most natural.", "But I guess it's just a matter of opinion."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "foo()", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "A", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}], [{"text": ["My experience in open-source development is that one should never leave whitespace inside blank lines.", "Also one should never leave trailing white-space.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It's a matter of coding etiquette."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Emacs does B) for me, but I really don't think it matters.", "A) means that you can add in a line at the correct indentation without any tabbing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I wouldn't necessarily call the first example \"broken\", because I know some people hate it when the cursor \"jumps back\" when moving the cursor up or down in code.", "E.g.", "Visual Studio (at least 2008) automatically prevents this from happening without using any whitespace characters on those lines."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["TextMate breaks block collapsing if you use B, and I prefer A anyway since it's more \"logical\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]