[[{"text": ["There's no way to truly do this in Python.", "Rather unpythonic, it is.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As Guido would say, we're all consenting adults here."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Here's a good summary of the philosophy behind everything in Python being public."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "summary of the philosophy behind everything in Python being public", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mail.python.org/pipermail/tutor/2003-October/025932.html"}]}], [{"text": ["Python is distributed as source.", "The very idea of a private method makes very little sense."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The programmer who wants to extend B, frustrated by a privacy issue, looks at the source for B, copies and pastes the source code for method into the subclass C.  "], "childNum": 4, "tag": "p", "senID": 1, "childList": [{"text": "B", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "B", "childNum": 0, "tag": "code", "childList": []}, {"text": "method", "childNum": 0, "tag": "code", "childList": []}, {"text": "C", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["What have you gained through \"privacy\"?", "The best you can hope for is to frustrate your potential customers into copying and pasting."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["At worst, they discard your package because they can't extend it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["And yes, all open source is extended in one way or another.", "You can't foresee everything and every use to which you code will be put.", "Preventing some future use is hard to do when the code is distributed as source."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["See http://stackoverflow.com/questions/261638/how-do-i-protect-python-code"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "http://stackoverflow.com/questions/261638/how-do-i-protect-python-code", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/261638/how-do-i-protect-python-code"}]}, {"tag": "hr", "senID": 6}, {"text": ["Edit  On \"idiot-proof\" code."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "Edit", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["First, python is distributed as source 90% of the time.", "So, any idiot who downloads, installs, and then refuses to read the API guide and calls the methods out of order still has the source to figure out what went wrong."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["We have three classes of idiots."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["People who refuse to read the API guide (or skim it and ignore the relevant parts) and call the methods out of order in spite of the documentation.", "You can try to make something private, but it won't help because they'll do something else wrong -- and complain about it.", "[I won't name names, but I've worked with folks who seem to spend a lot of time calling the API's improperly.", "Also, you'll see questions like this on SO."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["People who are confused by API's and call the methods every different way you can imagine (and some you can't.", ")  You can try to make something private, but they'll never get the API."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["People who reject your API and want to rewrite it to make it \"idiot proof\"."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}]}, {"text": ["At this point, what has privacy done for you?", "Some people will refuse to understand it; some people are confused by it; and some people want to work around it."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["How about public, and let the folks you're calling \"idiots\" learn from your code?"], "childNum": 0, "tag": "p", "senID": 14, "childList": []}], [{"text": ["You can prefix methods and members with a single or double underscore.", "A single underscore implies \"please don't use me, I'm supposed to be used only by this class\", and a double underscore instructs the Python compiler to mangle the method/member name with the class name; as long as the class and its subclasses don't have the same name, the methods/members can be considered \"private\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, the solution to your requirements so far is to write clear documentation.", "If you don't want your users to call methods in the wrong order, then say so in the documentation."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["After all, even C++ privates aren't that private.", "For example think the old trick:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n #define private public\n#include &lt;module&gt;\n</code>\n</pre>\n", "senID": 3}], [{"text": ["I am surprised that no one has mentioned this, but prefixing the method name with a single underscore is the correct way of labelling it as \"private\".", "It's not really private of course, (as explained in other answers), but there you go."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "private", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n def _i_am_private(self):\n    \"\"\"If you call me from a subclass you are a naughty person!\"\"\"\n</code>\n</pre>\n", "senID": 1}], [{"text": ["To make a method sort of private, you can name-mangle a method like so:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class Foo:\n    def __blah():\n        pass\n\nclass Bar(Foo):\n    def callBlah():\n        self.__blah() # will throw an exception\n</code>\n</pre>\n", "senID": 1}, {"text": ["But subclasses can still find your methods through introspection if they really want to. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["But Python (by deliberate design and choice) has no notion of private members."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Contrary to popular fashion on this subject, there are legitimate reasons to have a distinction between public, private, and protected members, whether you work in Python or a more traditional OOP environment.", "Many times, it comes to be that you develop auxiliary methods for a particularly long-winded task at some level of object specialization.", "Needless to say, you really don't want these methods inherited by any subclass because they make no sense in the specialized context and shouldn't even be visible; and yet they are visible, and they diminish the utility of things like tab completion, object navigators, and other system software, because everything at all different levels of abstraction get flattened and thrown together.", "These programming aids are not trivial, mind you.", "They are only trivial if you're a student and enjoy doing the same thing a million times just because you're learning how."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "are", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Python historically developed in such a way that to implement the public/private distinction became increasingly difficult due to ideological inertia and compatibility concerns.", "That's the plain truth.", "It would be a real headache for everyone to change what they've been doing.", "Consequently, we now have a million Python fans out there, all of whom have read the same one or two original articles deciding unequivocally that the public/private distinction is \"unpythonic\".", "These people, for lack of critical thought or fairness to wide-spread, common practices, instantly use this occasion to accrete a predictable slew of appologetics -- De Defensione Serpentis -- which I suspect arises not from a rational selection of the via pythonis (the pythonic way) but from neglect of other languages, which they either choose not to use, are not skilled at using, or are not able to use because of work."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "De Defensione Serpentis", "childNum": 0, "tag": "em", "pos": 4, "childList": []}, {"text": "via pythonis", "childNum": 0, "tag": "em", "childList": []}]}, {"text": ["As someone already said, the best you can do in Python to produce an effect similar to private methods is to prepend the method name with __ (two underscores).", "On the other hand, the only thing this accomplishes, practically speaking, is the insertion of a transmogrified attribute name in the object's __dict__.", "For instance, say you have the following class definition:"], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "__", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "__dict__", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"code": "<pre>\n<code>\n class Dog(object):\n    def __bark(self):\n        print 'woof'\n</code>\n</pre>\n", "senID": 3}, {"text": ["If you run dir(Dog()), you'll see a strange member, called _Dog__bark.", "Indeed, the only reason this trick exists is to circumvent the problem I described before: namely, preventing inheritance, overloading, and replacement of super methods."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "dir(Dog())", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "_Dog__bark", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["Hopefully there will be some standardized implementation of private methods in the future, when people realize that tissue need not have access to the methods by which the individual cell replicates DNA, and the conscious mind need constantly figure out how to repair its tissues and internal organs."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["\"Everything must be public\" proponents think the author is trying to hide a useful API from the users.", "This guy doesn't want to violate an unquestionable law of Python.", "He wants to use some methods to define a useful API, and he wants to use other methods to organize the implementation of that API.", "If there's no separation between the two it doesn't mean the author is not an idiot.", "It means the author was too lazy to actually define an API."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In Python, instead of marking properties or methods as private, they may be prefixed with _ as a weak \"internal use\" indicator, or with __ as a slightly stronger one.", "In a module, names may be prefixed with _ in the same way, and you may also put a sequence of strings that constitute the modules' public API in a variable called __all__."], "childNum": 4, "tag": "p", "senID": 1, "childList": [{"text": "_", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "__", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "_", "childNum": 0, "tag": "code", "childList": []}, {"text": "__all__", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["A foolish consistency is the hobgoblin of little minds."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["This may be a fair approximation.", "Lexical scoping to the \"rescue\":"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n #!/usr/bin/env python\n\nclass Foo(object):\n    def __init__(self, name):\n        self.name = name\n        self.bar()\n\n    def bar(self):\n        def baz():\n            print \"I'm private\"\n            print self.name\n\n        def quux():\n            baz()\n\n        self.quux = quux\n\n\nif __name__ == \"__main__\":\n    f = Foo(\"f\")\n    f.quux()\n\n    g = Foo(\"g\")\n    g.quux()\n\n    f.quux()\n</code>\n</pre>\n", "senID": 1}, {"text": ["Prints:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n I'm private\nf\nI'm private\ng\nI'm private\nf\n</code>\n</pre>\n", "senID": 3}], [{"text": ["Changing an inherited method from public to private breaks inheritance.", "Specifically, it breaks the is-a relationship."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "breaks inheritance", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Imagine a Restaurant class with a open-doors public method (i.e.", "it's dinnertime and we want to flip the front door sign from closed to open).", "Now we want a Catering class that would share many of the implementation details of Restaurant (they both need cooks, kitchens, dishes, food suppliers, and maybe even waitstaff), but not have a dining area, front doors, or the open-doors method.", "Inheritance from Restaurant is a mistake!", "It might appear that all you need to do is change the open-doors method to private so no one can use it, but then \"any Catering object is-a Restaurant\" is false, since part of Restaurant's public interface is open-doors.", "It's better to refactor Restaurant by adding a new base class and then both Restaurant and Catering derive from it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Languages with a notion of protected or private inheritance support this idea of inheritance for implementation only, but Python is not one of those.", "(Nor is it useful in those languages, except rarely.", ") Usually when non-public inheritance is sought, containment (aka \"has-a relationship\") is the better path, you can even make the attribute protected or private."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Python spells protected with a single leading underscore and private with double leading underscores, with the modification of the \"consenting adults\" philosophy mentioned in Triptych's answer.", "\"Dangerous\" attributes and methods of your class, e.g.", "ones that might cause data loss, should be non-public (whether to make them protected or private is influenced by other factors), with public methods used to provide a simpler, safer interface."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Triptych's answer", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "#452023"}]}], [{"text": ["Even among consenting adults, there are reasons why you do not want to expose methods to a derived class.", "The question is, can I have a hierarchy like Parent > Child, where a user can derive from either Parent or Child but not be exposed any private or protected methods.", "In the following example, Child explicitly overloads Parent.__private without exposing it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class Parent(object):\n    def __private(self):\n        print 'Parent'\n\n    def go(self):\n        self.__private()\n\nclass Child(Parent):\n    def __init__(self):\n        Parent.__init__(self)\n        self._Parent__private = self.__private\n\n    def __private(self):\n        print 'Child'\n</code>\n</pre>\n", "senID": 1}]]