[[{"text": ["I personally prefer Python/django.", "Size is small given u have necessary things installed. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["With disk space at the current price, size shouldn't matter.", "Give both a try and figure out which will be easier for you to learn and maintain.", "Despite the fact that people believe that when you know one language, you know all, that's only true as long as you write code on the \"hello world\" level."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["One option with Ruby on Rails is to go with a JRuby deployment which would allow you to pack it all into a single .war file.", "This would require the person deploying the web application to have a java web application server (Jetty is probably the smallest and easiest to bundle)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["With Rails, you are generally going to have to install Ruby and any required ruby gems.", "The Ruby install is going to be machine specific- different for Windows/Linux.", "Everything else should be easily scripted.", "If you go with an Apache Passenger (mod_ruby) solution, you will need to get that installed as well. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In reality, I haven't run into many server applications with simple, compact installs."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I just used heroku to deploy a blog written in Rails, and it was a fantastically easy experience.", "If you're interested in simplicity, it's probably the most simple deploy I've ever experienced."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "heroku", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://heroku.com"}]}], [{"text": ["I don't think you can get them both.", "I'm sorry to say this but you have to choose which one is more important to you. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "Django application is smaller in size because many things is already provided out of the box, but deployment is not as easy.", "tag": "none", "senID": 1}, {"text": "On the other hand, RoR apps deployment is easier (both Ruby MRI or JRuby) but the application's size is naturally larger given you have to install other gems and RoR plugins.", "tag": "none", "senID": 2}]}], [{"text": ["If you are experienced with Java and concerned about deploying Django and Rails apps, I'd recommend you give JRuby a try.", "This will give you several benefits from a Java-perpective:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "JRuby", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://jruby.org/"}]}], [{"text": ["With the cheeseshop, any python application can be made installable with a single command.", "I'm a big fan of Django, but it will require you to hook into an external webserver, as the built in server is for development only.", "You might look for something that has a more robust builtin web server if you want something you can just plunk down and start running.", "Twisted might meet your needs, though there's a bit more of a learning curve on that.", "I'm not sure how other python or ruby apps stand up on this front."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]