[[{"text": ["I guess you could do something based on Levenshtein distance, but there's no real way to do this automatically - without creating a fairly complex rules-based system."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Levenshtein distance", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Levenshtein_distance"}]}, {"text": ["Unless you can define a rules system that can work out for any x and y whether x is a duplicate of y, you're going to have to deal with this in a fuzzy, human way."], "childNum": 4, "tag": "p", "senID": 1, "childList": [{"text": "x", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "y", "childNum": 0, "tag": "code", "childList": []}, {"text": "x", "childNum": 0, "tag": "code", "childList": []}, {"text": "y", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Stack Overflow has a fairly decent way of dealing with this - warn users if something may be a duplicate, based on something like Levenshtein distance (and perhaps some kind of rules engine), and then allow a subset of your users to merge things as duplicates if other users ignore the warnings."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "may", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["From the examples you give, it sounds like you have more a natural language problem than an exact matching problem.", "Given that natural language matching is inexact by nature you're unlikely to come up with a perfect solution. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "String distance doesn't really work, as strings that are algorithmically close may not be semantically close (e.g. \"DJ Above &amp; Beyond\" should match  \"Above and Beyond\" but not \"DJ Above &amp; Beyond 2\" which is closer in Levenshtein distance.", "tag": "none", "senID": 1}, {"text": "Some cheap alternatives to natural language parsing are ", "tag": "none", "senID": 2}, {"text": "If this is a User-interacting program, you could echo \"near misses\" to the user, e.g. \"Is one of these what you meant to enter?\"", "tag": "none", "senID": 3}, {"text": "You could normalize the entries in some way so that different entries map to the same normalized value (e.g. case normalize, \"&amp;\" -> \"And\", etc, etc. which some of the above suggestions might be a step towards) to find near misses or map multiple inputs to a single value.", "tag": "none", "senID": 4}]}, {"text": ["Add the caveat that my experience only applies to English, e.g.", "an english PorterStemmer won't recognize the one French title you put in there."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I think this is more of a social problem than a programming problem.", "Any sort of programatic solution to natural language processing like this is going to be buggy and error prone.", "It's very hard to distinguish things that are close, but legitimately different from the sort of undesired duplicates that you're talking about."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As Dominic mentioned, Stack Overflow's tagging system is a pretty good model for this.", "It provides cues to the user that encourage them to use existing tags if appropriate (drop down lists as the user types), it allows trusted users to retag individual questions, and it allows moderators to do mass retags.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This is really a process that has to have a person directly involved."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["This is not a complete solutions but one thought I had:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class DJ(models.Model):\n    #other fields, no alias!\n\nclass DJAlias(models.Model):\n    dj = models.ForeignKey(DJ)\n</code>\n</pre>\n", "senID": 1}, {"text": ["This would allow you to have several Aliases for the same dj."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["But still you will need to find a proper way to ensure the aliases are added to the right dj.", "See Dominics post."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Dominics", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/2110238/merging-duplicates-in-a-list-question-is-more-complex-than-it-seems/2110291#2110291"}]}, {"text": ["But if you check an alias against several other aliases pointing to one dj, the algorithms might work better."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["You could try to solve this problem for this instance only (replacing the \"&amp;\" with \"&amp;\" and \"DJ\" with \"Disk jokey\" or ignore \"DJ\" etc..).", "If your table only contains DJ's you could set up a bunch of rules like those.", "If your table contains more diverse stuff you will have to go with a more structural approach.", "Could you give a sample of your dataset?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["First of all of course the programming task (NLP etc.", "as mentioned) is interesting.", "But as mentioned it's overkill aiming to perfect that."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But the other view is as mentioned (\"social\"), who enters the data, who views it, how long and how correct should it be?", "So it's a naming convention issue and reminds me to the great project musicbrainz.org - should your site \"just work\" or do you prefer to go along standards, in latter case i would orient myself along the mb project - in case you haven't done that and not heard of it.", "ie.", "see here for Above &amp; Beyond: they have on alias defined, they use it to match user searches.", "http://musicbrainz.org/show/artist/aliases.html?artistid=58438 \ncheck out also the Artist_Alias page in the wiki."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Above &amp; Beyond", "childNum": 0, "tag": "em", "pos": 3, "childList": []}, {"text": "http://musicbrainz.org/show/artist/aliases.html?artistid=58438", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://musicbrainz.org/show/artist/aliases.html?artistid=58438"}]}, {"text": ["The data model is worth a look and there are even several API bindings to sync data, also in python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["How about changing the model so \"alias\" to be list of keys to other table that looks like this (skipping small words like \"the\", \"and\", etc.", "):\n1 => Above;\n2 => Beyond;\n3 => Disk;\n4 => Jokey;"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Then when you want to insert new record just check how many of the significant words from the title are already in the table and match currently existing model entities.", "If more than 50% (for example) maybe you have a coincidence and you can show list of them to the visitor and asking \"do you mean some of this one\"."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]