[[{"text": ["It might be worth checking out what options are available in Twisted.", "For example, the Twisted.Conch page reports:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Yes, you can do this with paramiko."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you're connecting to one server, you can run multiple channels through a single connection.", "If you're connecting to multiple servers, you can start multiple connections in separate threads.", "No need to manage multiple processes, although you could substitute the multiprocessing module for the threading module and have the same effect."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I haven't looked into twisted conch in a while, but it looks like it getting updates again, which is nice.", "I couldn't give you a good feature comparison between the two, but I find paramiko is easier to get going.", "It takes a little more effort to get into twisted, but it could be well worth it if you're doing other network programming."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You can simply use subprocess.Popen for that purpose, without any problems."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, you might want to simply install cronjobs on the remote machines.", ":-)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Reading the paramiko API docs, it looks like it is possible to open one ssh connection, and multiplex as many ssh tunnels on top of that as are wished.", "Common ssh clients (openssh) often do things like this automatically behind the scene if there is already a connection open."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["This might not be relevant to your question.", "But there are tools like pssh, clusterssh etc.", "that can parallely spawn connections.", "You can couple Expect with pssh to control them too."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I've tried clusterssh, and I don't like the multiwindow model.", "Too confusing in the common case when everything works. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I've tried pssh, and it has a few problems with quotation escaping and password prompting."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The best I've used is dsh:"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "dsh", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://packages.debian.org/sid/dsh"}]}, {"text": ["Its very flexible in scheduling and topology: you can request something close to a calling tree if need be.", "But the default is a simple topology of one command node to many leaf nodes."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["http://www.netfort.gr.jp/~dancer/software/dsh.html"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://www.netfort.gr.jp/~dancer/software/dsh.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.netfort.gr.jp/~dancer/software/dsh.html"}]}]]