[[{"text": ["I've done both, and Apache/mod_python tended to be easier to work with and more stable.", "But these days I've jumped over to Apache/mod_wsgi, which is everything I've ever wanted and more:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Easy management of daemon processes.", "tag": "none", "senID": 1}, {"text": "As a result, ", "tag": "none", "senID": 2}, {"text": "Easy code reloads (set it up right and you can just touch the ", "tag": "none", "senID": 3}, {"text": "More predictable resource usage. With mod_python, a given Apache child process' memory use can jump around a lot. With mod_wsgi it's pretty stable: once everything's loaded, you know that's how much memory it'll use.", "tag": "none", "senID": 4}]}], [{"text": ["lighttpd with FastCGI will be nominally faster, but really the time it takes to run your python code and any database hits it does is going to absolutely dwarf any performance benefit you get between web servers."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["mod_python and apache will give you a bit more flexibility feature-wise if you want to write code outside of django that does stuff like digest auth, or any fancy HTTP header getting/setting.", "Perhaps you want to use other builtin features of apache such as mod_rewrite."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If memory is a concern, staying away form apache/mod_python will help a lot.", "Apache tends to use a lot of RAM, and the mod_python code that glues into all of the apache functionality occupies a lot of memory-space as well.", "Not to mention the multiprocess nature of apache tends to eat up more RAM, as each process grows to the size of it's most intensive request."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Nginx with mod_wsgi"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Personally I've had it working with FastCGI for some time now (6 months or so) and the response times 'seem' quicker when loading a page that way vs mod___python.", "The critical reason for me though is that I couldn't see an obvious way to do multiple sites from the same apache / mod_python install whereas FastCGI was a relative no-brainer."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I've not conducted any particularly thorough experiments though :-)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["[Edit] Speaking from experience though, setting up FastCGI can be a bit of a pain the first time around.", "I keep meaning to write a guide..!"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "[Edit]", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["I'm using it with nginx.", "not sure if it's really faster, but certainly less RAM/CPU load.", "Also it's easier to run several Django processes and have nginx map each URL prefix to a different socket.", "still not taking full advantage of nginx's memcached module, but first tests show huge speed advantage."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "huge", "childNum": 0, "tag": "em", "pos": 3, "childList": []}]}], [{"text": ["There's also mod_wsgi, it seems to be faster than mod_python and the daemon mode operates similar to FastCGI"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'd recommend WSGI configurations; I keep meaning to ditch apache, but there is always some legacy app on the server that seems to require it.", "Additionally, the WSGI app ecology is very diverse, and it allows neat tricks such as daisy-chaining WSGI \"middleware\" between the server and the app."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, there are currently known issues with some apps and apache mod_wsgi, particularly some ctypes apps, so be wary if you are trying to run, say, geodjango which uses ctypes extensively.", "I'm currently working around those issues by going back to  fastcgi myself."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "known issues with some apps and apache mod_wsgi", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://groups.google.com/group/modwsgi/browse_thread/thread/a488d2551c4c7df0"}, {"text": "geodjango", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://geodjango.org/"}]}]]