[[{"text": ["There is no hard and fast line between a \"scripting language\" and a \"programming language\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Properties of \"scripting languages\" tend to include:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["garbage-collected memory manager, with no need to explicitly allocate and free objects"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["ability to simply execute commands, without a bunch of boilerplate code.", "Java is usually used as a counter-example of this.", "In Python you can simply say print(\"Hello, world!", "\") but in Java you need a lot more syntax (the example here is seven lines of code)."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "print(\"Hello, world!\")", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "here", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.javacoffeebreak.com/java101/java101.html"}]}, {"text": ["Related to the above, usually in a \"scripting language\" you don't have to explicitly declare variables, and you rarely need to declare types of variables.", "Some scripting languages (such as Javascript) will coerce types with wild abandon, and others (such as Python) are strongly typed and raise exceptions on type mismatches."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["no need for an explicit compile or link step; you just write code and run it.", "(A \"scripting language\" can still be Just-In-Time compiled internally; Python does this, for example."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]}, {"text": ["Beyond these basics, a \"scripting language\" can range from something primitive and trivial, like the \"batch\" language in MS-DOS, on up to an expressive and powerful language like Python, Ruby, etc."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["You've basically discovered that the distinction between a scripting language and a \"non-scripting\" language is pretty artificial.", "Python can be compiled to JVM bytecode (with Jython), and I believe Ruby also can -- then the \"engine\" running the Python or Ruby code in question will be a JVM, the same \"engine\" that runs Java code (or Scala code, etc etc).", "Similarly with .NET and IronPython (or IronRuby) -- then the \"engine\" is Microsoft's CLR, just as for C#, Boo, and so on.", "Languages said to be \"scripting\" are often dynamically typed ones... but I've never heard the term used for other important dynamically typed languages such as Smalltalk, Mozart/OZ, or Erlang...;-)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Probably the closest thing to what you are talking about is an interpreter:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "interpreter", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Interpreter%5F%28computing%29"}]}, {"text": ["Basically an intepreter (or scripting engine if you prefer) is the component that is responsible for turning a script into machine code at execution time (as opposed to a compiler which creates machine code prior to execution time)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I know you have accepted an answer, however there is some amgiguity."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["When referring to a scripting engine, we typically mean a small embedded language that sits within a template and generates textual output or documents.", "For example Freemarker and Velocity are often referred to as scripting engines.", "Erb would sit here too, but oddly is not referred to as a scripting engine that often."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "scripting engine", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["A scripting language generally needs no compile step, therefore can be run more simply as a, or, from a shell script.", "This includes things like awk, perl, tcl, python, ruby and so on.", "These languages typically need to be terse and type safety is often optional.", "Windows supports a number of languages in it's scripting host facilities.", "This exposes scripting languages to various components within Windows."], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "scripting language", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "needs", "childNum": 0, "tag": "em", "pos": -1, "childList": []}, {"text": "scripting host", "childNum": 0, "tag": "em", "pos": 3, "childList": []}]}, {"text": ["So then fully compiled languages such as Java may well run as bytecode and could be considered as interpreted, however the point is that there is an explicit compile step, there is no interpreter (with the Sun JRE anyway) that provides a runtime executable environment for java code."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Other languages such as VBA are embedded, many of the languages above can be embedded.", "Embedded languages could be referred too as a scripting engine for the host application."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["In my mind a scripting engine interprets programmatic instructions and in turn instructs a larger host application or system.", "The instructions are executed immediately without concern for any remaining instructions."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Many Lisps have no distinction between data and code, possibly compiling dynamically at runtime.", "The interpret, compile and execute steps are available to the Lisp programmer to be manipulated as programmers manipulate data in other languages."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["\"Scripting language\" might be called a colloquialism.", "The term is not well defined, and you will see some disagreement about which languages are scripting languages.", "It is sometimes useful for conveying a vague idea of the properties of a language (See steveha's answer)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "steveha's answer", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/1691201/what-is-a-scripting-engine/1691250#1691250"}]}, {"text": ["\"Scripting language\" might also refer to a particular use of a language.", "For example, a piece of software might use Lua as its scripting language -- the language used by the end user to automate (or \"script\") complex tasks."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["One useful distinction between scripting / interpreted languages and compiled languages is that you can typically embed a scripting language's interpreter in a compiled project, such as a game engine."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]