[[{"text": ["web2py does have a smaller market share than competitor products but it is also much younger.", "I have knowledge of at least 13 consulting companies that provide web2py support.", "Anyway, I do believe web2py is much easier to use than other systems and therefore you will need less support that you may think.", "Most of the current users get their support via the web2py google group where you can find 29781 messages and almost all questions have been answered within 24 hours by one of the contributors."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "13 consulting companies", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.web2py.com/examples/default/support"}, {"text": "web2py google group", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://groups.google.com/group/web2py"}]}], [{"text": ["Learning is bad.", "Sherlock Holmes explains:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I'm sure I'm not the only one who has wasted an inordinate amount of time wading through the many bad and poorly documented Python web frameworks trying to find one I can just use.", "If I was programming in Ruby or PHP I probably would have spent that time actually writing a web application.", "This is the curse of web development in Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This bit of flamebait may help:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"src": "http://spreadsheets.google.com/pub?key=tZCdBPAkC75t27UzsPdLfMg&oid=2&output=image", "tag": "img", "senID": 3}, {"text": ["Omitted from the chart are the 13,000+ questions tagged [php], but let's not go there."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["To be clear, even though choosing a framework for Python web development can be confusing, once you decide on one you get to program in Python.", "This is the blessing of web development in Python.", "It can be really nice."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "you get to program in Python", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["My advice is don't accept anything less than a framework with excellent documentation.", "With the amount of choices out there there's no need to settle for poor, incomplete docs.", "Failing that, the simplest frameworks, those lacking room for any magic, are pleasant to work with and quickly learnable."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["web2py may be young, but the mailing list has ~2000 messages / month, which is similar to Django and far more than Turbogears.", "I usually get answers to my questions within a few hours.", "There is also an excellent online book, but I find the best source of information is the mailing list."], "childNum": 4, "tag": "p", "senID": 0, "childList": [{"text": "the mailing list", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://groups.google.com/group/web2py/about"}, {"text": "Django", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://groups.google.com/group/django-users/about"}, {"text": "Turbogears", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://groups.google.com/group/turbogears/about"}, {"text": "excellent online book", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://web2py.com/book"}]}, {"text": ["I have used both RoR, Django, Turbogears, and web2py, and find web2py the most productive. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Learning is good."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Learning something (that eventually goes away) is no loss at all.", "The basic skills of web development (HTML, CSS, URL-parsing, GET vs. POST) don't ever change."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Frameworks come and go.", "Learn as many as you can.", "Learn how to manage your learning so that you (a) get to the important stuff first and (b) leave the other framework stuff behind when tackling a new framework."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Every framework has it's bias (or focus).", "Once you figure this out, you can make use of them without all the \"compare and contrast\" that slows some people down.", "Once you've learned web2py, you have to be careful learning Django that you start fresh, with no translation from old concepts to new."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Web2py is a good one to learn.", "If this is going to be deployed to a server, double check it supports wsgi.", "Sometimes php is the way to go because you know it's supported almost anywhere."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Ask yourself what you are looking to gain from the experience.", "Ie, is it more important to just get the application built and running with a minimum of time and effort, or are you trying to learn about web stack architecture? "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you're just looking for results, obviously you'll have more code and documentation to borrow from if you stick with a more commonly used framework.", "If you grit your teeth and accept Django's view of the world, you can build very functional applications very quickly.", "If you can find some pre-made reusable Django apps that handle part of your problem, it'll be even faster. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But if you want to make sure you have a very solid understanding of everything in the request cycle from HTTP request handling to database access and abstraction to form generation and processing and HTML templating, you'll be bettered served with a minimal framework that forces you to think more about the architecture and has a small enough codebase that you can just read it all top to bottom and not really need documentation beyond that.", "In that case though, I'd advise going even deeper and building your own framework on top of a WSGI library (you don't actually want to waste time learning the intricacies of working around browser quirks if you can help it).", "Once you've built your own and seen where things get complicated and where the tradeoffs are, you'll be in an excellent position to judge other frameworks and decide if there's one that does things the way you want to work."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["This may seem slightly off-topic, but Paul Graham has probably the best essay on this subject that I have seen: The Python Paradox."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "The Python Paradox", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.paulgraham.com/pypar.html"}]}, {"text": ["Let me put it this way, if you want to work for me, I notice this kind of free thinking and experimentation on a resume, whether the work was commercial, academic, or otherwise.", "And I'm pretty sure I'm not alone."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Glad I found this thread!", "Cause some outdated pages and broken external links on Web2Py's website almost scared me off.", "But at least now I know there's a pretty good community around Web2Py."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I've just been looking through a load of Python web frameworks, and Web2Py's description sounded enticing and managed to make Django sound overly laborious.", "Pretty sure there are some tangible benefits to Django's design decisions avoiding \"too much magic\" when it comes to larger projects."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But to just throw something up on the web with err \"sane defaults\" sounds perfectly good to me.", "Instead of throwaway scripts, we can make throwaway websites to handle some temporary thing..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["There should be room for an appliance style framework with no installation...", "Interesting possibilities for some projects.", "I saw someone already got a python framework + server to work on android phones :))"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["For me, thanks to this thread, I will just learn both."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Another thought; if Web2Py is open source and you like what it does you might not even mind being the only user at some point in the future, since you can add features to it yourself?  "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Mind you, I have not used either yet, just read the docs.", "I think the Web2Py people should put up a blurb on their website to differentiate themselves from Django in more detail, I haven't been able to check off all my question marks for choosing the right one."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["I'm agree with S.Lott saying that:\"Learning something (that eventually goes away) is no loss at all.", "\" "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["YEAH It's true but let me suggest that also a scholastic project should be able to reach the better support possible, otherwise could be very frustrating and a waste of time to learn and teach something not well supported, debugged, stable etc.", "The time you spent, and maybe your auditors/students, should in some sense projected with an eye to the future..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["just for example take a look to turbogears"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "turbogears", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://turbogears.com/"}]}], [{"text": ["All depends on what you need.", "At the moment I'm using Java EE6 for a big project in the insurance market, and web2py for small projects and pleasure.", "If what you want is to increase your value in the current market as a software engineer probably you should consider Java/.NET/ROR/Groovy.... depends on when you live... just dig into the jobs sites.... the future?", "I wish to have the crystal ball"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Not much results will be returned when searching for a problem related to the less common framework."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]