[[{"text": ["There are many implementations of the Python language; the three that are certainly solid, mature and complete enough for production use are CPython, IronPython, and Jython.", "All of them are typically compiled to some form of bytecode, also known as intermediate code.", "The compilation from source to bytecode may take place as and when needed, but you can also do it in advance if you prefer; however Google App Engine, which lets you run small Python web apps, including Django, for free, as one of its limitations requires you to upload source and not compiled code (I know of no other host imposing the same limitation, but then I know of none giving you so many resources for free in exchange;-)."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "CPython", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/CPython"}, {"text": "IronPython", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.codeplex.com/IronPython"}, {"text": "Jython", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.jython.org/"}]}, {"text": ["You might be most at home with IronPython, which is a Microsoft product (albeit, I believe, the first Microsoft product to be entirely open-source): in that case you can be certain that it is \"compiled like .net\", because it is (part of) .net (more precisely, .net and silverlight).", "Therefore it cannot be neither more nor less obfuscated and/or secure than .net (meaning, any other .net language)."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "is", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "is", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Jython works on JVM, the Java Virtual Machine, much like IronPython works on Microsoft's Common Language Runtime, aka CLR.", "CPython has its own dedicated virtual machine."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For completeness, other implementations (not yet recommended for production use) include pypy, a highly flexible implementation that supports many possible back-ends (including but not limited to .net); unladen swallow, focused on evolving CPython to make it faster; pynie, a Python compiler to the Parrot virtual machine; wpython, a reimplementation based on \"wordcode\" instead of \"bytecode\"; and no doubt many, many others."], "childNum": 4, "tag": "p", "senID": 3, "childList": [{"text": "pypy", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://codespeak.net/pypy/dist/pypy/doc/"}, {"href": "http://code.google.com/p/unladen-swallow/", "text": "unladen swallow", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://code.google.com/p/pynie/", "text": "pynie", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://code.google.com/p/wpython/", "text": "wpython", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["CPython, IronPython, Jython and pypy can all run Django (other implementations might also be complete enough for that, but I'm not certain)."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I don't know about the security part but."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Python is interpreted. Like PHP. (It's turned into bytecode which CPython reads)", "tag": "none", "senID": 1}, {"text": "Django is just a ", "tag": "none", "senID": 2}, {"text": ["Python can be compiled."], "childNum": 0, "tag": "a", "senID": 3, "childList": []}, {"text": "And no not all hosts support python + django.", "tag": "none", "senID": 4}]}], [{"text": ["You shouldn't have to worry about obfuscating your code, specially since it's going to run on your server."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You are not supposed to put your code in a public directory anyway.", "The right thing to do with django (as oposed to PHP) is to make the code accessible by the webserver, but not by the public."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And if your server's security has been breached, then you have other things to worry about..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Obfuscation is false security.", "And the only thing worse than no security is false security.", "Why would you obfuscate a web app anyways?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python is compiled to bytecode and run on a virtual machine, but usually distributed as source code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Unless you really plan to run your webapp on \"pretty much every web host\" that question doesn't matter.", "There are many good hosts that support python and django."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The Python is interpreted language.", "But you can compile the python program into a Unix executable using the Freeze."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Freeze", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/Freeze"}]}], [{"text": ["Code obfuscation in .NET are mostly a question of changing variable names to make it harder to understand the disassembled code.", "Yes, you can do those techniques with CPython too."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Now, why ever you would want to is another question completely.", "It doesn't actually provide you with any security, and does not prevent anybody from stealing your software."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "want", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}]]