[[{"text": ["If the class expects the code to run on Windows then I would install a VM with Windows on it since it is possible that some things may not work quite the same way (especially if you are doing system-specific things like file-system access or executing OS commands)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Classwork/homework always goes smoother when you have the exact same environment as the professor and the rest of the class."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "exact", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Definitely start with Mac.", "If it turns out that it really does need Windows, you can switch once you're sure.", "But Python development is definitely more natural on a Unix-based machine."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Most online graders will let you submit multiple times, and the first assignment is usually easy, so you should know pretty quickly if using a Mac is causing you problems.", "In the meantime though, you'll have a much smoother ride doing Python on a Mac than on Windows."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["If they will be testing your code on windows then you really need to be targeting that platform.", "However if you feel more comfortable on the Mac, do your dev there but also run a virtual win machine so you can test on the target platform.", "I would suggest the excellent VirtualBox.", "You can share local folders with the VM, which reduces the pain of switching back and forth, once the VM has python setup you can just hop in and and run the code direct from the directory on the Mac you developed in."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "VirtualBox", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.virtualbox.org/"}]}], [{"text": ["From their site it looks like Mac is fully supported (up to 10.5 -- it's true that 10.6 is different enough to give occasional problems...", "I haven't upgraded yet even though I did buy a family pack of 10.5 to 10.6 upgrades, as I'm not looking for trouble right now).", "If you can use a Macbook with 10.5, I'd say to go for it -- the familiarity and extra productivity are worth the miniscule risk that despite all their claims of support something goes wrong (and you can in fact download and start testing right now!).", "If your Mac options are limited to 10.6, then I'd go for a VMWare or Parallels VM with a Windows (not sure if Windows 7 is fully supported yet, maybe XP is a more prudent option) installation instead."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "their site", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.roboteducation.org/MacOSX%5FSetup"}]}], [{"text": ["Develop and test on a Mac.", "If it works on the Mac, then test it on Windows before submitting.", "Done this tons of times with my own programming courses, albeit with a different set of languages and technologies."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Go Mac and never go back."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["More seriously, a Mac offers UNIX environment, and Windows offers blue screens."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]