[[{"text": ["You can actually do it all with GET methods.", "However, you'll want to use a full challenge response protocol for the logins.", "(You can hash on the client side using javascript.", "You just need to send out a unique challenge each time.", ")  You'll also want to use SSL to ensure that no one can see the strings as they go across."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In some senses there's no real security difference between GET and POST requests as they both go across in plaintext, in other senses and in practice... GET is are a hell of a lot easier to intercept and is all over most people's logs and your web browser's history.", ":)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["(Or as suggested by the other posters, use a different method entirely like HTTP auth, digest auth or some higher level authentication scheme like AD, LDAP, kerberos or shib.", "However I kinda assumed that if you didn't have POST you wouldn't have these either."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You could use HTTP Authentication, if supported."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You'd have to add SSL, as all methods, POST, GET and HTTP Auth (well, except Digest HHTP authentication) send plaintext."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["GET is basically just like POST, it just has a limit on the amount of data you can send which is usually a lot smaller than POST and a semantic difference which makes GET not a good candidate from that point of view, even if technically they both can do it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["As for examples, what are you using?", "There are many choices in Python, like the cgi module or some framework like Django, CherryPy, and so on"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["With a bit of JavaScript, you could have the client hash the entered password and a server-generated nonce, and use that in an HTTP GET."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["A good choice: HTTP Digest authentication"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "HTTP Digest authentication", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://advosys.ca/viewpoints/2006/08/http-digest-authentication/"}]}, {"text": ["Harder to pull off well, but an option: Client-side hashing with Javascript"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Client-side hashing with Javascript", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://blog.paranoidferret.com/index.php/2007/07/22/secure-authentication-without-ssl-using-javascript/"}]}], [{"text": ["Javascript is the best option in this case."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Along with the request for the username and password, it sends a unique random string.", "You can then use a javascript md5 library to generate a hashed password, by combining the random string and the password [pwhash = md5(randomstring+password)].", "The javascript then instantiates the call to http://SERVER/login.cgi?username=TheUsername&amp;random=RANDOMSTRING&amp;pwhash=0123456789abcdef0123456789abcdef"], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "http://SERVER/login.cgi?username=TheUsername&amp;random=RANDOMSTRING&amp;pwhash=0123456789abcdef0123456789abcdef", "childNum": 1, "tag": "em", "pos": 2, "childList": [{"text": "http://SERVER/login.cgi?username=TheUsername&amp;random=RANDOMSTRING&amp;pwhash=0123456789abcdef0123456789abcdef", "tag": "a"}]}, {"href": "http://SERVER/login.cgi?username=TheUsername&random=RANDOMSTRING&pwhash=0123456789abcdef0123456789abcdef", "text": "http://SERVER/login.cgi?username=TheUsername&amp;random=RANDOMSTRING&amp;pwhash=0123456789abcdef0123456789abcdef", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["The server must then do two things:\n  Check if the random string has EVER been used before, and it if has, deny the request.", "(very important for security)"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "very important", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["Lookup the plaintext password for username, and do md5(randomstring+password).", "If that matches what the user supplied in the URL as a pwhash, then you know it's the user."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The reason you check if the random string has ever been used before is to stop a repeat attack.", "If somebody is able to see the network traffic or the browser history or logs, then they could simply log in again using the same URL, and it doesn't matter whether they know the original password or not."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I also recommend putting \"Pragma: no-cache\" and \"Cache-Control: no-cache\" at the top of the headers returned by the CGI script, just so that the authenticated session is not stored in the browser's or your ISPs web cache."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["An even more secure solution would be using proper encryption and Challenge-Response.", "You tell the server your username, the server sends back a Challenge (some random string encrypted with your password), and you tell the server what the random string was.", "If you're able to tell the server, then obviously you have the password and are who you say you are!", "Kerberos does it this way, but quite a lot more carefully to prevent all sorts of attacks."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["Logging in securely is very subjective.", "Full 'security' is not easy to achieve (if at all possible...debatable).", "However, you can come close.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If POST is not an option, maybe you can use a directory security method such as .htaccess or windows authentication depending on what system you're on."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Both of the above will get you the pop-up window that allows for a username and password to be entered."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["To use POST as the method to send the login credentials, you'd just use an HTML form with method=\"post\" and retrieve the information from, say, a PHP or ASP page, using the $_POST['varname'] method in PHP or the request.form(\"varname\") method in ASP.", "From the PHP or ASP page, as an example, you can do a lookup in a database of users, to see if that username/password combination exists, and if so, redirect them to the appropriate page."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["As reference, use http://www.w3schools.com/ASP/showasp.asp?filename=demo_simpleform for the HTML/ASP portion"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://www.w3schools.com/ASP/showasp.asp?filename=demo_simpleform", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.w3schools.com/ASP/showasp.asp?filename=demo_simpleform"}]}]]