[[{"text": ["\"I checked it out and it looks good, but I also heard that processes, unlike threads, can't share a lot of information...\""], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "\"I checked it out and it looks good, but I also heard that processes, unlike threads, can't share a lot of information...\"", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["This is only partially true."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Threads are part of a process -- threads share memory trivially.", "Which is as much of a problem as a help -- two threads with casual disregard for each other can overwrite memory and create serious problems."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Processes, however, share information through a lot of mechanisms.", "A Posix pipeline (a | b) means that process a and process b share information -- a writes it and b reads it.", "This works our really well for a lot things."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "a | b", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["The operating system will assign your processes to every available core as quickly as you create them.", "This works out really well for a lot of things."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Stackless Python is unrelated to this discussion -- it's faster and has different thread scheduling.", "But I don't think threads are the best route for this."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["\"I think my program will need to share a lot of information."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "\"I think my program will need to share a lot of information.\"", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["You should resolve this first.", "Then determine who to structure processes around the flow of information.", "A \"pipeline\" is very easy an natural to do; any shell will create the pipeline trivially."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["A \"server\" is another architecture where multiple client processes get and/or put information into a central server.", "This is a great way to share information.", "You can use the WSGI reference implementation as a way to build a simple, reliable server."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"tag": "ul", "num": 3, "lis": [{"text": ["Stackless"], "childNum": 0, "tag": "strong", "senID": 0, "childList": []}, {"text": ["Threaded"], "childNum": 0, "tag": "strong", "senID": 1, "childList": []}, {"text": ["Multiprocessing"], "childNum": 0, "tag": "strong", "senID": 2, "childList": []}]}, {"text": ["Update"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Update", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Indepth Analysis"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Use threaded for an easy time.", "However, if you call C routines that take a long time before returning, then this may not be a choice if your C routine does not release the lock."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "long", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["Use multiprocessing if it is very limited by cpu power and you need maximum responsiveness."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "very", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Don't use stackless, I have had it segfault before and threads are pretty much equivalent unless you are using hundreds of them or more."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["There was a good talk on multiprocessing at Pycon this year.", "The takeaway message was \"Only use multiprocessing unless you're sure you have a problem that it will solve, that cannot be solved with threads; otherwise, use threads.", "\" "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Processes have a lot of overhead, and all data to be shared among processes must be serializable (ie pickleable). "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You can see the slides and video here:\nhttp://us.pycon.org/2009/conference/schedule/event/31/"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["A process has its own memory space.", "It makes it more difficult to share information, but also makes the program safer (less need for explicit synchronization).", "That being said, processes can share the same memory in read-only mode. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A thread is cheaper to create or kill, but the main difference is that it shares memory with other threads in the same process.", "This is sometimes risky, and in addition crashing the process would kill all threads."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["One advantage of using multiple processes over multiple threads is that it would be easier to scale your program to work with multiple machines that communicate via network protocols. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For example, you could potentially run 16 processes on 8 dual-core machines, but would not have a benefit from more than 4 threads on a quad-core machine.", "If the amount of information you need to communicate is low, multiprocessing may make more sense. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["As for the youtube-style you've described, I would say that suggests multiprocessing.", "If you follow MVC approaches, your GUI should not also contain the model (calculation result).", "With multiprocess, you can then communicate to a work manager that can report what data is already available."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["With CPython multiple threads can't execute at the same time because of the GIL: link text."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "link text", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Global%5FInterpreter%5FLock"}]}, {"text": ["I think it's still possible that threads boost your application, e.g.", "a thread might block on I/O while another one does some work."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you've never used threads, I suggest that you try them first.", "It will be useful in any other language, and you'll find a lot of ressources on the web.", "Then if you realize that you need more parallelism, you still can switch back to processes."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you would like to read a lengthy discussion of multi-threading in Mozilla, consider having a look at this discussion which started in 2000.", "The discussion doesn't necessarily answer your question.", "However, it's an indepth discussion that I believe is interesting and informative, which I suggest may be quite valuable because you've asked a difficult question.", "Hopefully it'll help you make an informed decision."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "this discussion", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://bugzilla.mozilla.org/show%5Fbug.cgi?id=40848"}]}, {"text": ["Incidentally, several members of the Mozilla project (notably Brendan Eich, Mozilla's CTO and the creator of JavaScript) were quite critical of multi-threading in particular.", "Some of the material referenced here, here, here, and here supports such a conclusion."], "childNum": 4, "tag": "p", "senID": 1, "childList": [{"text": "here", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://weblogs.mozillazine.org/roadmap/archives/2007/02/threads%5Fsuck.html"}, {"href": "http://weblogs.mozillazine.org/roc/archives/2005/12/night%5Fof%5Fthe%5Fliving%5Fthreads.html", "text": "here", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://weblogs.mozillazine.org/roc/archives/2006/12/parallelism%5F1.html", "text": "here", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://weblogs.mozillazine.org/roc/archives/2007/05/performance%5Fobs.html", "text": "here", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Hope that helps and good luck."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I always prefer multiple threads for simplicity, but there is a real issue with affinity.", "There is no way (that I know of) to tell Python's threading implementation to bind to a specific processor.", "This may not be an issue for you, it doesnt sound like it should be.", "Unless you have a good reason not to, it sounds like your problem can be solved easily with Python's threading implementation."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you do decided on using processed, sharing information between sub processes can be accomplished in several ways: tcp/udp connections, shared memory or pipes.", "It does add some overhead and complexity."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It sounds like you'd want threading.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The way you described it, it sounded like there was one single thing that actually took a lot of CPU...the actual running of the simulation.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["What you're trying to get is more responsive displays, by allowing user interaction and graphics updates while the simulation is running.", "This is exactly what python's threading was built for.  "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["What this will NOT get you is the ability to take advantage of multiple cores/processors on your system.", "I have no idea what your simulation looks like, but if it is that CPU intensive, it might be a good candidate for splitting up.", "In this case, you can use multiprocessing to run separate parts of the simulation on separate cores/processors.", "However, this isn't trivial...you now need some way to pass data back and fourth between the processes, as the separate processes can't easily access the same memory space."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]