[[{"text": ["3.0 is slower than 2.5 on official benchmarks.", "From \"What’s New in Python 3.0\":"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "\"What’s New in Python 3.0\"", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/3.0/whatsnew/3.0.html#performance"}]}], [{"text": ["I'd say any difference will be below trivial.", "For example, looping over a list will be the exact same."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The idea behind Python 3 is to clean up the language syntax itself - remove ambigious stuff like except Exception1, Exception2, cleanup the standard modules (no urllib, urllib2, httplib etc)."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "except Exception1, Exception2", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["There really isn't much you can do to improve it's performance, although I imagine stuff like the garbage collection and memory management code  will have had some tweaks, but it's not going to be a \"wow, my database statistic generation code completes in half the time!", "\" improvement - that's something you get by improving the code, rather than the language!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Really, performance of the language is irrelevant - all interpreted languages basically function at the same speed.", "Why I find Python \"faster\" is all the built-in moudles, and the nice-to-write syntax - something that has been improved in Python3, so I guess in those terms, yes, python3's performance is better then python2.x.."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "has", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["I think ultimately it is too early to make that kind of comparison just yet.", "Wait until it is out of beta before benchmarking it.", "The interpreter will probably be polished enormously before the release but overall i think for most uses the performance would be comparable and if you are running a really speed conscious app is python really the right language to be using?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The IO library has been completely redesigned, and the new implementation is in pure Python.", "Whilst this is a functional improvement, it is at present much slower.", "Work is afoot to rewrite the bulk of the new system in C. For details see these bug reports."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "these", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://bugs.python.org/issue4533"}, {"href": "http://bugs.python.org/issue4561", "text": "bug", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://bugs.python.org/issue4565", "text": "reports", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["Unless there are plans for a new VM of some kind (and I haven't heard of any such plans), there is all the reason to believe that in the long run the performance of Py3K will, at least asymptotically, equal that of 2.5"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It may take a few months, but will eventually happen, as nothing in the new features of Py3k is inherently less performant. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["To conclude, I don't think there's place to worry about it.", "Neither to hope for a major improvement of some kind."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I don't if it faster now, but I have to expect that it eventually will be because that is where new performance work will happen and not all of that will be backported."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]