[[{"text": ["One challenge you'll find is that not only are the algorithms implemented in Python, but the book makes extensive use of Python libraries like BeautifulSoup, Numpy, PIL, and others (see appendix A)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I doubt there are any specifics of the algorithms that you couldn't port to another language, but you'll have trouble working through the exercises.", "Also, to translate the code, you'll have to learn Python at least a little bit, no?  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I suggest you just dive in and learn Python.", "You can use IronPython if you have any concern about interoperability with your C# projects."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You can do the same things in all Turing-complete languages.", "Here is an example for rendering a Mandelbrot fractal in SQL.", "The example shows: Even if you can use any language, the effort will be different."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Here is an example", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://thedailywtf.com/articles/stupid-coding-tricks-the-tsql-madlebrot.aspx"}]}, {"text": ["So my guess is that the code will become much longer since Python is so flexible and open."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I suggest translating them to C#.", "I have been porting chapter 2 \"Recommendations\" to VB.Net.", "Along the way I'm learning Python as a side-effect.", "Toby does some amazing things with Python lists."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Dealing with the the extra Python libraries is another story.", "Ndelicious is a close match to pyDelicious, but it is missing a few key features (popular posts!", ")."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Obligatory XKCD: http://xkcd.com/353/"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://xkcd.com/353/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://xkcd.com/353/"}]}, {"text": ["I know you explicitly say you don't want to learn Python (this year), but translating the Python examples to C# will definitely be a much steeper curve.", "Just dive in!"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "dive in!", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.diveintopython.org/"}]}], [{"text": ["The book is about algorithms, not the details of programming, and the language of choice is just to make the examples concrete.", "As the author says, \"The code examples in this book are written in Python... but I provide explanations of all the algorithms so that programmers of other languages can follow.", "\" (p. xv)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python is a great language and easy to learn, but I suspect the difficulties in applying ideas from the book will not be in the translating of the code to another language or set of libraries, but in understanding the ideas and modifying the code to suite your needs.", "I think there are two main reasons to stay with a language you're familiar with: 1) when your code doesn't work, if you're writing in an unfamiliar language, you won't know where to start looking for errors, e.g.", "if you're like most people you'll even start wondering if it's due to a bug in Python, which it won't be, but you'll wonder and it will distract.", "2) There are just natural limits to how much you can remember in a certain length of time; and learning a language at the same time will give you twice as much to remember."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It depends though how well you know C#, and what you lose by leaving it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Just learn it already!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Python seems to be to AI programming what LISP was for for many decades.", "Russel/Norvig's  famous book AI: A Modern Approach also provides lots of examples in Python."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "AI: A Modern Approach", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://aima.cs.berkeley.edu/"}, {"href": "http://aima.cs.berkeley.edu/python/readme.html", "text": "examples in Python", "childNum": 0, "tag": "a", "childList": []}]}]]