[[{"text": ["From the Python Enterprise Application Kit community:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python Enterprise Application Kit community", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://peak.telecommunity.com/DevCenter/PythonEggs"}]}], [{"text": ["Eggs are a pretty good way to distribute python apps.", "Think of it as a platform independent .deb file that will install all dependencies and whatnot.", "The advantage is that it's easy to use for the end user.", "The disadvantage are that it can be cumbersome to package your app up as a .egg file."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You should also offer an alternative means of installation in addition to .eggs.", "There are some people who don't like using eggs because they don't like the idea of a software program installing whatever software it wants.", "These usually tend to be sysadmin types."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": [".egg files are basically a nice way to deploy your python application.", "You can think of it as something like .jar files for Java. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["More info here."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://peak.telecommunity.com/DevCenter/PythonEggs"}]}], [{"text": ["One egg by itself is not better than a proper source release.", "The good part is the dependency handling.", "Like debian or rpm packages, you can say you depend on other eggs and they'll be installed automatically (through pypi.python.org)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pypi.python.org", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://pypi.python.org"}]}, {"text": ["A second comment: the egg format itself is a binary packaged format.", "Normal python packages that consist of just python code are best distributed as \"source releases\", so \"python setup.py sdist\" which result in a .tar.gz.", "These are also commonly called \"eggs\" when uploaded to pypi."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Where you need binary eggs: when you're bundling some C code extension.", "You'll need several binary eggs (a 32bit unix one, a windows one, etc.", ") then."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Whatever you do, do not stop distributing your application, also, as a tarball, as that is the easiest packagable format for operating systems with a package sysetem."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["For simple Python programs, you probably don't need to use eggs.", "Distributing the raw .py files should suffice; it's like distributing source files for GNU/Linux.", "You can also use the various OS \"packagers\" (like py2exe or py2app) to create .exe, .dmg, or other files for different operating systems."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["More complex programs, e.g.", "Django, pretty much require eggs due to the various modules and dependencies required."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]