[[{"text": ["I knew C before I knew Python.", "No offence intended, but I don't think that your C knowledge is that big a deal.", "Unless you read very, very slowly, just set out to learn Python.", "It won't take that long to skim through the material you're familiar with, and it's not as if a Python tutorial aimed at C programmers will make you a better Python programmer - it might teach you things in a different order, is all, and raise some specific things that you would do in C but that you should not do in Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Strings in Python actually are somewhat different from strings in C, and they're used differently.", "I strongly recommend learning them \"from scratch\", rather than thinking about them in terms of their differences from C strings.", "For one thing, in Python 2 it's best not to use Python's \"string\" class to represent strings: there's a separate unicode string class and for practical Python apps (pretty much anything involving user data), you need that.", "(Python 3 fixes this, making the str class a unicode string).", "You need to establish a good working practice for unicode/byte data and decode/encode."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "not", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "str", "childNum": 0, "tag": "code", "pos": 3, "childList": []}]}, {"text": ["A common mistake when learning a second programming language, is to think \"I know how to program, I just need to translate what I do in C into Python\".", "No, you don't.", "While it's true that an algorithm can be basically the same in different languages, the natural way to do a particular thing can be completely different in different languages.", "You will write better Python code if you learn to use Python idiomatically, than if you try to write Python like a C programmer.", "Many of the \"tricks\" you know that make sense in C will be either pointless or counter-productive in Python.", "Conversely many things that you should do happily in a typical Python program, like allocating and freeing a lot of memory, are things that in C you've probably learned to think twice about.", "Partly because the typical C program has different restrictions from the typical Python program, and partly because you just have to write more code and think harder to get that kind of thing right in C than you do in Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you're learning the language because you urgently need to program a system/platform which has Python but doesn't have C, then writing Python programs that work like C programs is a reasonable interim measure.", "But that probably doesn't apply to you, and even if it did it's not the ultimate goal."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["One thing you might be interested to look at because of your C experience, is the Python/C API.", "Python is great for many things, but it doesn't result in the fastest possible computational core of scientific apps [neither does C, probably, but let's not go into FORTRAN for now ;-)].", "So if you're aiming to continue with scientific programming through your move in Python, and your programs are typically memory-bus- and CPU-bound doing immense amounts of number-crunching (billions of ops), then you might like to know how to escape into C if you ever need to.", "Consider it a last resort, though."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["You do need to understand Python reasonably well before the Python/C API makes much sense, though."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Oh yes, and if you want to understand OOP in general, remember later on to take a look at something like Java, Objective-C, C++, or D. Python isn't just an OO language, it's a dynamic OO language.", "You might not realise it from comparing just C with Python, but dynamic vs static types is a completely independent issue from the OOP-ness of Python.", "Python objects are like hashtables that allow you to attach new fields willy-nilly, but objects in many other OO languages store data in ways which are much more like a C struct."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "struct", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}], [{"text": ["I learned everything I know about Python from the official documentation: http://docs.python.org/"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://docs.python.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/"}]}, {"text": ["And it's free."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["dive into python is a good place to start"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "dive into python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://diveintopython.net/"}]}, {"text": ["fire up an interpreter, IPython is even better than the plain Python interpreter"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["use dir() and help() to poke around "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["and don't forget to read through the official docs at least once"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "official docs", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org"}]}], [{"text": ["I'd recommend the book How to Think Like a Computer Scientist in Python.", "It really helped me get going in Python (now my favorite language) coming from Java, C and C++."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "How to Think Like a Computer Scientist in Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.greenteapress.com/thinkpython/"}]}], [{"text": ["Diveintopython, official docs, \"Learning python\" by Mark Lutz(4th edition)  is one of the best books. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you have a programming background, Python is pretty straightforward to pick up.", "The most onerous task is learning the libraries and idioms.", "The documentation at python.org is quite good and free.", "If you're doing number crunching you'll almost certainly want to become familiar with the numpy extension."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "numpy", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://numpy.scipy.org/"}]}], [{"text": ["As someone who has worked with Java for over 12 years, I found that picking up a problem and solving it in a new language is the best way to learn.", "I don't believe in reading - it wastes a huge amount of time, and you can easily end up reading for too long."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My advice is to find a problem and set off to solve it with Python.", "You will learn alot in the process."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Good luck"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]