[[{"text": ["You'll get holes in the head."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python's data structures and memory management are radically different from C++.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Whichever language you \"get\" first, you'll love.", "The other you'll hate.", "Indeed, you'll be confused at the weird things one language lacks that the other has.", "One language will be reasonable, logical, unsurprising.", "The other will be a mess of ad-hoc decisions and quirks."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you learn one all the way through -- by itself -- you'll probably be happier.  "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I find that most folks can more easily add a language to a base of expertise.  "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["[Not all, however.", "Some folks are so mired in the first language they ever learned that they challenge every feature of a new language as being nonsensical.", "I had a guy in a Java class who only wanted to complain about the numerous ways that Java wasn't Fortran.", "All the type-specific stuff in Java gave him fits.", "A lot of discussions had to be curtailed with \"That's the way it is.", "If you don't like it, take it up with Gosling.", "My job isn't to justify Java; my job is to get you to be able to work with java.", "Can we move on, now?", "\"]"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["If you are new to programming, I would say start with the C++ class.", "If you get the hang of it and enjoy programming, you can always learn Python later.", "There are a wealth of good books and Internet resources on pretty much any programming language out there that you should be able to teach yourself any language in your spare time.", "I would recommend learning that first language in a formal classroom, however, to help make it easier to learn the general concepts behind programming."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Edit: To clarify the point I was trying to make, my recommendation is to take whichever course is geared more towards beginning programmers.", "The important things to learn first are the basic fundamentals of programming.", "These apply towards almost any language.", "Thanks to the wealth of resources available online or in your bookstore/library, you can teach yourself practically any programming language that you want to learn.", "First, however, you must grasp the basics, and intro C/C++ classes typically (in my experiences, at least) do a good job of teaching programming fundamentals as well as the language itself."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Since you are a beginning programmer, I would not recommend trying to learn two languages at once (especially if you are trying to learn fundamentals at the same time).", "That's a lot of very similar (yet very different) information to keep track of in your head, almost like trying to learn two brand new spoken languages at the same time.", "You may be able to handle it perfectly fine but at least for most programmers that I know, it is much easier to get a good grasp on one language first and then start learning the second."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I think that given the circumstances (fulltime employee, etc) studying one language will be hard enough.", "Pick one, then study another.", "You'll learn basics from either language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As for \"which language to pick\"...", "I specialize in C++, and know a bit of python.", "C++ is much more difficult, more flexible, and more suitable for making \"traditional\" executables. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'd recommend to start with C++.", "You'll learn more concepts (some of them doesn't exist in python), and learning python after C++ won't be a problem."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["edit:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "edit:", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["From your comment on this question, it appears the Python course is not geared towards beginner programmers.", "They'll probably be covering some of the more advanced topics of programming without touching on the basics of program flow which are really essential.", "So if the C++ course is geared towards beginners, then I would recommend that you take the C++ course and teach yourself Python on the side. "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "this question", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/3416342/c-and-python-simultaneously-is-it-doable/3416435#3416435"}]}, {"text": ["There is a wealth of Python tutorials out there.", "The official one is also really good.", "You don't have to wait to learn Python, of course, you can do it right now by going to any of those tutorials.", "The first tutorial I linked, by Alan Gauld, is geared towards non-programmers and is really high quality.", "He's also a regular contributor/moderator of the python tutor list.", "If you want to really learn Python, subscribe to that list and ask questions when you have them and do your best to answer questions that are posed - that's how I learned Python and I credit that process with much of my knowledge and understanding.", "As a PhD you've probably seen countless times that teaching someone else helps you retain your knowledge better and forces you to really understand the concepts."], "childNum": 4, "tag": "p", "senID": 2, "childList": [{"text": "There", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.freenetpages.co.uk/hp/alan.gauld/"}, {"text": "is a wealth", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/BeginnersGuide/Programmers"}, {"text": "official one", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/tutorial/"}, {"text": "tutor list", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://mail.python.org/mailman/listinfo/tutor"}]}, {"text": ["When you do start learning, there's a great package of Python tools called Python (X,Y) that is designed for doing scientific type computing.", "It has all sorts of great tools packaged with it."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Python (X,Y)", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pythonxy.com/"}]}, {"tag": "s", "senID": 4}, {"text": ["If you've had any experience programming, then you should easily be able to handle both course loads.", "What I mean is that if you can understand the following two programs, you should be able to easily perform the course loads."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Python:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"code": "<pre>\n<code>\n elements = ['Sn', 'Pb', 'Au', 'Fr', 'F', 'Xe', 'H']\n\nfor element in elements:\n   if element == 'Sn':\n      print 'Tin'\n   elif element == 'Pb':\n      print 'Lead'\n   elif element == 'Au':\n      print 'Gold'\n   else:\n      print 'Other'\n</code>\n</pre>\n", "senID": 7}, {"text": ["C++"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"code": "<pre>\n<code>\n #include &lt;stdio&gt;\n#include &lt;string&gt;\nusing namespace std;\n\nint main(){\n    string name;\n    int age = 0;\n    cout &lt;&lt; \"Please enter your name: \";\n    cin &gt;&gt; name;\n    cout &lt;&lt; \"Please enter your age: \";\n    cin &gt;&gt; age;\n    cout &lt;&lt; \"Hello \" &lt;&lt; name &lt;&lt; \"! You are \" &lt;&lt; age &lt;&lt; \" years old!\" &lt;&lt; endl;\n    return 0;\n}\n</code>\n</pre>\n", "senID": 9}, {"text": ["Even if you don't know exactly what's going on, in the programs, if you kind of have an idea, you should do just fine.", "These are typical programs that you'd expect to see in the first few weeks of class, and if you can look at them and figure out what's going on you're probably at least better off than the average student. "], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["If you look at both of these programs and think, \"What in the...???", "I'm so confused!", "\", then you should only take the Python course.", "Python makes it a lot easier to grasp the concepts (and write programs) than C++.", "The knowledge you gain in either language easily translates to the other, but you have to be exposed to a lot more in C++ than Python.", "For example, that C++ program looks like this in python:"], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"code": "<pre>\n<code>\n name = raw_input(\"Please enter your name: \")\nage = raw_input(\"Please enter your age: \")\nprint \"Hello\", name, \"! You are\", age, \"years old!\"\n</code>\n</pre>\n", "senID": 12}, {"text": ["You can usually focus on one concept at a time without having to worry about possible bugs being introduced by other language features."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["But if you can guess what's going on in both programs within 5 minutes, I'd go ahead and take both classes - as a molecular biologist you've had to do plenty of logical thinking which is essential to programming (not so essential to being a high-schooler).\n"], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"text": ["Good luck!"], "childNum": 0, "tag": "p", "senID": 15, "childList": []}], [{"text": ["I think it all depends on the level or difficulty of the of the class and that the languages in and of themselves really don't make that much of a difference. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To me, programming is 95% logical and about 5% dealing with syntax and the actual language.", "I started programming in high school and up through college (a senior a Computer Eng Currently) the focus was all about understanding the mindset of things and learning how to logically think through a problem and then develop a solution.", "Very few of our classes were a C++ or Java or Python based class.", "Of course there were some that focused on the more obscure languages such as x86 Assembly, but even then the idea was more of learning how to attack a problem.", "As a MCB person you should be fine with that."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For the other 5%, which is the actual language, taking two classes in two different languages will lead to crossovers.", "Of course a lot of what you learn in both can be applied to the others such as loops, conditionals, classes etc.", "However syntax is what is going to mess you up.", "You'll find yourself writing the syntax for the other language when you don't mean to.", "Simple things such as an if statement"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Python:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n if x &gt; y\n</code>\n</pre>\n", "senID": 4}, {"text": ["C++:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n if (x &gt; y)\n</code>\n</pre>\n", "senID": 6}, {"text": ["But other than syntax issues, I really think all languages are pretty much the same.", "Sure people are going to disagree and that yes different languages are better at things than others but if you're not taking a graduate level class and these are both pretty basic intro classes what you learn could actually complement the other class you're taking. "], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["But of course the biggest question for you to consider is time.", "Even being a full time student taking multiple heavy programming classes is not smart.", "Often times assignments are longer than expected or more difficult than first realized.", "So if you're going to have multiple long involved projects dealing with coding you may want to pick just one class.", "Especially seeing as a lot of what you learn in one can easily be translated to the other and vice-versa."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["I think you pretty much answered this question yourself:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In other words, the Python course is not an introductory course -- it assumes you already know how the basics of programming.", "That's probably why the professor suggested you take the C++ course first."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I come from a computational maths background, and have written sizeable (commercial and accademic) programs in both C++ and python.", "They are very different languages and I would probably learn one first (or only one)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Which one would depend on what you want to be able to do with the language."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you want to build something useful with your language that is not (overly) compute or data heavy, go with python, you'll get something useful quicker. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you need to do something useful that is either compute heavy or data heavy, then you'll probably need to go with C++.", "But it will take you longer to get to something to do what you need --- It will take a while to learn C++, then additional time to code data-heavy or compute-heavy code effectively."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Now some will say that python can handle data/compute heavy jobs well enough.. but in molecular biology \"heavy\" can mean very heavy. "], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "very", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Having said this, my suggestion is go with python if you can."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["You've got to find out what people in your field are programming with so you can leverage existing libraries/APIs/projects.", "It won't do you any good re-inventing the wheel in C++ or Python if there's some wicked-cool FORTRAN library out there that is standard in your field.", "(And, if that is the case, God help you, I'm sorry.", ")  Anyway, the CS prof you talked to might not have any idea what computational molecular geneticists use."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]