[[{"text": ["Setuptools may be capable of more of what you're looking for than you realize -- if you need a custom version of lxml to work correctly on MacOS X, for instance, you can put a URL to an appropriate egg inside your setup.py and have setuptools download and install that inside your developers' environments as necessary; it also can be told to download and install a specific version of a dependency from revision control."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["That said, I'd lean towards using a scriptably generated virtual environment.", "It's pretty straightforward to build a kickstart file which installs whichever packages you depend on and then boot virtual machines (or production hardware!", ") against it, with puppet or similar software doing other administration (adding users, setting up services [where's your database come from?", "], etc).", "This comes in particularly handy when your production environment includes multiple machines -- just script the generation of multiple VMs within their handy little sandboxed subnet (I use libvirt+kvm for this; while kvm isn't available on all the platforms you have developers working on, qemu certainly is, or you can do as I do and have a small number of beefy VM hosts shared by multiple developers)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This gets you out of the headaches of supporting N platforms -- you only have a single virtual platform to support -- and means that your deployment process, as defined by the kickstart file and puppet code used for setup, is source-controlled and run through your QA and review processes just like everything else."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I always create a develop.py file at the top level of the project, and have also a packages directory with all of the .tar.gz files from PyPI that I want to install, and also included an unpacked copy of virtualenv that is ready to run right from that file.", "All of this goes into version control.", "Every developer can simply check out the trunk, run develop.py, and a few moments later will have a virtual environment ready to use that includes all of our dependencies at exactly the versions the other developers are using.", "And it works even if PyPI is down, which is very helpful at this point in that service's history."], "childNum": 5, "tag": "p", "senID": 0, "childList": [{"text": "develop.py", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "packages", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": ".tar.gz", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "virtualenv", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "develop.py", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}], [{"text": ["Basically, you're looking for a cross-platform software/package installer (on the lines of apt-get/yum/etc.", ") I'm not sure something like that exists?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "cross-platform software/package installer", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["An alternative might be specifying the list of packages that need to be installed via the OS-specific package management system such as Fink or DarwinPorts for Mac OS X and having a script that sets up the build environment for the in-house code?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I have continued to research this issue since I posted the question.", "It looks like there are some attempts to address some of the needs I outlined, e.g.", "Minitage and Puppet which take different approaches but both may accomplish what I want -- although Minitage does not explicitly state that it supports Windows.", "Lacking any better options I will try to make either one of these or just extensive customized use of zc.buildout work for our needs, but I still feel like there must be better options out there."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Minitage", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.minitage.org/doc/rst/about.html"}, {"text": "Puppet", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://reductivelabs.com/projects/puppet/"}]}], [{"text": ["You might consider creating virtual machine appliances with whatever production OS you are running, and all of the software dependencies pre-built.", "Code can be edited either remotely, or with a shared folder.", "It worked pretty well for me in a past life that had a fairly complicated development environment."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Puppet doesn't (easily) support the Win32 world either.", "If you're looking for a deployment mechanism and not just a \"dev setup\" tool, you might consider looking into ControlTier (http://open.controltier.com/) which has a open-source cross-platform solution. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://open.controltier.com/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://open.controltier.com/"}]}, {"text": ["Beyond that you're looking at \"enterprise\" software such as BladeLogic or OpsWare and typically an outrageous pricetag for the functionality offered (my opinion, obviously)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["A lot of folks have been aggressively using a combination of Puppet and Capistrano (even non-rails developers) for deployment automation tools to pretty good effect.", "Downside, again, is that it's expecting a somewhat homogeneous environment."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]