[[{"text": ["I would like to know the best methods for learning to program"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "I would like to know the best methods for learning to program", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["A.", "Read, practice and experiment"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["My problem is that I understand what I read but I can't apply my knowledge to anything."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "My problem is that I understand what I read but I can't apply my knowledge to anything.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["A.", "Start with simple programs first.", "Your first program can be to print something on the screen.", "The next program can be a loop to print numbers from 1 to 100.", "And so on.", "Don't try to write large programs at the beginning itself. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Should I stick with Python?", "(is there a better language I should be learning?", ") Where can I learn programming theory?"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Should I stick with Python? (is there a better language I should be learning?) Where can I learn programming theory?", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["A.", "No problem with sticking to Python.", "Its a good language for beginners.", "You can learn theory using good programming books or on the Internet."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["I get very hyper when reading my book sometimes, any tips on staying calm and focusing?"], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "I get very hyper when reading my book sometimes, any tips on staying calm and focusing?", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["A.", "You may be very exited to develop games and want to do it ASAP.", "But not able to do so in a small time makes you hyper.", "Please understand that it may take you several weeks to learn programming.", "Have patience.", "If you make haste, you may fail and eventually get frustrated and give up!"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Ultimately I feel like I am in a never ending tunnel that leads me no where.", "It feels like I am just completely unable to pursue anything in the world of programming, yet it is something I want to do very much."], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "Ultimately I feel like I am in a never ending tunnel that leads me no where. It feels like I am just completely unable to pursue anything in the world of programming, yet it is something I want to do very much.", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["A.", "Reading the above lines, tells me that you are passionate about programming.", "I bet that you have the ability to be the best programmer.", "The problem seems that you are in a hurry to develop your first game!", ":) Once again, please be patient.", "If you are not patient, frustration of failure will make you give up and you may never be able to write your own games."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["I had written the below article some time back.", "Read it."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["If you are not so good at programming you might have surely asked this question.", "And if you are a good programmer you might have surely faced this question."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["The question I am talking about is, \"How can I learn programming?"], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["This article is an attempt to answer this question.", "I have written ten points which I think would be helpful for being a programmer.", "Here they go."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["1.", "Improve your typing speed"], "childNum": 1, "tag": "p", "senID": 14, "childList": [{"text": "1. Improve your typing speed", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Surprising?", "But this is the most important point.", "There is no way in which you can convert your thoughts directly into a program.", "You have to key in your code using a keyboard.", "If you are really slow at typing, you may get irritated when writing large programs."], "childNum": 0, "tag": "p", "senID": 15, "childList": []}, {"text": ["Spend at least 30 minutes a day to practice typing.", "There are several free typing tutors available on the Internet which are worth trying."], "childNum": 0, "tag": "p", "senID": 16, "childList": []}, {"text": ["2.", "Get access to a computer"], "childNum": 1, "tag": "p", "senID": 17, "childList": [{"text": "2. Get access to a computer", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["You are not going to be a programmer just by reading programming books.", "Typing the programs, compiling and executing them is a must."], "childNum": 0, "tag": "p", "senID": 18, "childList": []}, {"text": ["If you don't have a computer at home, get one.", "You don't need a brand new Dual Core processor to learn programming.", "Even an old machine would do for a beginner.", "If you can't afford that too, at least get access to a computer at your school, college, a library or at your friends place where you can practice programming."], "childNum": 0, "tag": "p", "senID": 19, "childList": []}, {"text": ["3.", "Don't just read... Do it!"], "childNum": 1, "tag": "p", "senID": 20, "childList": [{"text": "3. Don't just read... Do it!", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Don't just keep reading programming books and articles.", "Mere reading will not help you learn much.", "Type the programs, compile and execute them.", "In that way you will be able to remember the things better."], "childNum": 0, "tag": "p", "senID": 21, "childList": []}, {"text": ["4.", "Study the code written by other programmers"], "childNum": 1, "tag": "p", "senID": 22, "childList": [{"text": "4. Study the code written by other programmers", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["No matter how intelligent you are, you cannot be the best at everything.", "You may be writing great programs.", "But somebody else may write some things better than you."], "childNum": 0, "tag": "p", "senID": 23, "childList": []}, {"text": ["So even if you think that you have written the best program in the world, its worth checking how others have written the same thing.", "You can learn a lot from other's programming styles and tricks!"], "childNum": 0, "tag": "p", "senID": 24, "childList": []}, {"text": ["5.", "Experiment a lot"], "childNum": 1, "tag": "p", "senID": 25, "childList": [{"text": "5. Experiment a lot", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Don't just stick to whatever the books say or your teachers or friends say.", "Experiment!", "Try your own things.", "Try writing the same program in different ways."], "childNum": 0, "tag": "p", "senID": 26, "childList": []}, {"text": ["Try whatever strikes your mind.", "Sometimes things which seem to be foolish will do the job just right!", "Sometimes your experiments will not give the results you expected, but they may result into something which you thought would never happen!", "If you get such results, try finding the reason behind them."], "childNum": 0, "tag": "p", "senID": 27, "childList": []}, {"text": ["6.", "Be a self learner"], "childNum": 1, "tag": "p", "senID": 28, "childList": [{"text": "6. Be a self learner", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Leave behind the habit of being spoon fed.", "Start learning yourself.", "There is wide range of content available on the Internet.", "There are thousands of books in the library waiting to be read.", "Go, pick couple of them."], "childNum": 0, "tag": "p", "senID": 29, "childList": []}, {"text": ["If you expect others to teach you everything then programming in not for you.", "Technology is changing fast.", "You have to stay updated yourself."], "childNum": 0, "tag": "p", "senID": 30, "childList": []}, {"text": ["7.", "Learn from other programmers"], "childNum": 1, "tag": "p", "senID": 31, "childList": [{"text": "7. Learn from other programmers", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["This point may seem contradictory to the previous one, but it isn't.", "I don't mean to say that you should learn programming from other programmers.", "What I mean to say is learn their programming style.", "Learn their habits.", "Try to find out why they are good programmers.", "Adopt some of their characteristics which you think will help you."], "childNum": 0, "tag": "p", "senID": 32, "childList": []}, {"text": ["8.", "Teach someone"], "childNum": 1, "tag": "p", "senID": 33, "childList": [{"text": "8. Teach someone", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Teachers say this often, \"You only learn when you teach.", "\" Agreed to a large extent."], "childNum": 0, "tag": "p", "senID": 34, "childList": []}, {"text": ["After you learn something, teach it to someone who wants to learn it.", "When you teach someone, you will be asked questions.", "Finding the answers to those questions will grow your knowledge."], "childNum": 0, "tag": "p", "senID": 35, "childList": []}, {"text": ["9.", "Think 100 times before blaming the compiler!"], "childNum": 1, "tag": "p", "senID": 36, "childList": [{"text": "9. Think 100 times before blaming the compiler!", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["I have seen many newbies blaming the complier for errors.", "They claim their program to be correct and say that the compiler is producing wrong errors.", "I tell you, in most of the cases (rather in almost every case) it is the programmers fault.", "My advice is, please think 100 times before you blame the compiler."], "childNum": 0, "tag": "p", "senID": 37, "childList": []}, {"text": ["10.", "Be patient and keep practicing"], "childNum": 1, "tag": "p", "senID": 38, "childList": [{"text": "10. Be patient and keep practicing", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Have patience.", "You are not going to be a programming expert in a day or two.", "It takes time to build your knowledge and skills."], "childNum": 0, "tag": "p", "senID": 39, "childList": []}, {"text": ["Sincerely keep doing your job of practicing, experimenting, learning and teaching.", "Don't give up! "], "childNum": 0, "tag": "p", "senID": 40, "childList": []}], [{"text": ["Any language will do for learning the absolute basics.", "Python is considered very good for beginners and you should stick with that for now.", "If you want to end up doing iPhone development, you'll probably switch to Objective-C at some point."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["First step, simply learn the three basic ways in which code is executed (apologies if you already know this, I'm assuming you're an absolute newcomer to programming as your question indicates):"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "sequence, one thing after another.", "tag": "none", "senID": 2}, {"text": "selection, choosing to do one of many things.", "tag": "none", "senID": 3}, {"text": "iteration, doing one thing over and over.", "tag": "none", "senID": 4}]}, {"text": ["Then find a program that combines all three such as a program Celsius to Fahrenheit converter which also lists if water would be frozen at that temperature:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n Celsius  Fahrenheit  WaterState\n-------  ----------  ----------\n    60-         76-  ice\n    50-         58-  ice\n    40-         40-  ice\n    30-         22-  ice\n    20-          4-  ice\n    10-         14   ice\n     0          32   ice\n    10          50   liquid\n    20          68   liquid\n    30          86   liquid\n    40         104   liquid\n    50         122   liquid\n    60         140   liquid\n    70         158   liquid\n    80         176   liquid\n    90         194   liquid\n   100         212   gas\n</code>\n</pre>\n", "senID": 6}, {"text": ["Once you've mastered that (or something similar), move onto something more complicated.", "The best bet is to find your own itch and scratch it, trying to create something that will be useful to you (ask yourself what your interests are: cute kittens, heavy metal, torture implements of the early fifteenth century; then think of something that will aid you in that).", "That way, you're more likely to see it through to the end."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["The code I used to produce that is below and could no doubt be improved but it's fine for entry-level.", "Don't look at it until you've tried it yourself since you'll get a much better sense of achievement from doing your own work.", "Think of it as something you could compare your solution to."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["And as @deceze points out in a comment, learn the best places to find information on your language of choice: the documentation followed in a very close second place by Stack Overflow itself :-)"], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "@deceze", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/users/476/deceze"}]}, {"code": "<pre>\n<code>\n print \"Celsius  Fahrenheit  WaterState\"\nprint \"-------  ----------  ----------\"\nfor cels in range(-60,110,10):\n    if cels &lt; 0:\n            cels2 = \"%6d-\"%(-cels)\n    else:\n            cels2 = \"%6d \"%(cels)\n\n    fahren = 9 * cels / 5 + 32\n    if fahren &lt; 0:\n            fahren2 = \"%9d-\"%(-fahren)\n    else:\n            fahren2 = \"%9d \"%(fahren)\n\n    if cels &lt;= 0:\n            state = \"ice\"\n    else:\n            if cels &lt; 100:\n                    state = \"liquid\"\n            else:\n                    state = \"gas\"\n\n    print \"%s  %s  %s\"%(cels2,fahren2,state)\n</code>\n</pre>\n", "senID": 10}], [{"text": ["If you are not in a hurry, Teach Yourself Programming in Ten Years is the best answer that I have ever read to this question."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Teach Yourself Programming in Ten Years", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://norvig.com/21-days.html"}]}, {"tag": "ul", "num": 10, "lis": [{"text": "Get interested in programming, and do some because it is fun.", "tag": "none", "senID": 1}, {"text": "Talk to other programmers; read other programs.", "tag": "none", "senID": 2}, {"text": "Program. The best kind of learning is learning by doing.", "tag": "none", "senID": 3}, {"text": "If you want, put in four years at a college (or more at a graduate school).", "tag": "none", "senID": 4}, {"text": "Work on projects with other programmers. Be the best programmer on some projects; be the worst on some others.", "tag": "none", "senID": 5}, {"text": "Work on projects after other programmers. Be involved in understanding a program written by someone else.", "tag": "none", "senID": 6}, {"text": "Learn at least a half dozen programming languages. Include one language that supports class abstractions (like Java or C++), one that supports functional abstraction (like Lisp or ML), one that supports syntactic abstraction (like Lisp), one that supports declarative specifications (like Prolog or C++ templates), one that supports coroutines (like Icon or Scheme), and one that supports parallelism (like Sisal).", "tag": "none", "senID": 7}, {"text": "Remember that there is a \"computer\" in \"computer science\". Know how long it takes your computer to execute an instruction, fetch a word from memory (with and without a cache miss), read consecutive words from disk, and seek to a new location on disk.", "tag": "none", "senID": 8}, {"text": "Get involved in a language standardization effort.", "tag": "none", "senID": 9}, {"text": "Have the good sense to get off the language standardization effort as quickly as possible. ", "tag": "none", "senID": 10}]}, {"text": ["In a short term, I would say that Python is a good choice.", "One book that can help you learn how to program and how to apply your knowledge at the same time is Python Programming: An Introduction to Computer Science"], "childNum": 1, "tag": "p", "senID": 11, "childList": [{"text": "Python Programming: An Introduction to Computer Science", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/1887902996"}]}], [{"text": ["Personally I find the problem with learning how to program is finding a book that doesn't assume prior knowledge.", "So for example, you pick up a book like 'Beginning iPhone Programming' and discover it's not really for beginners because it assumes that you know about objects etc, or will say \"...assume a knowledge in an OO language like Java, etc\", and early examples have non-intuitive syntax:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n int main (int argc, const char * argv[])\n</code>\n</pre>\n", "senID": 1}, {"text": ["(Try explaining what the * means to someone who is a total beginner)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["This is not a criticism of such books but it does mean that a beginner program does need to start off with something like Python at least to give them a foundation"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I also strongly text recommend this book though (especially if the end goal is iPhone):"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The Object-Orientated Thought Process"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "The Object-Orientated Thought Process", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0672330164"}]}, {"text": ["This book is really excellent because it teaches how to think about Objects without actually focussing on computer language (it does give examples in Java, C# etc ) but the focus of the book is as if you know none of these things but want to understand objects conceptually - I wish more books were like this."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["I think, forget about programming.", "Look at your life and prefer another way that makes you feel better.", "Programming should be your last chance :)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It looks like you're a young guy, maybe in college?", "If programming is something you are really interested in, take a couple of computer science classes and see what you think."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I started out with a specific application I wanted to create."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This helped me enormously, while I read about basic programming techniques I was constantly analysing where/whether each technique applied to what I was trying to achieve."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["OK, this was a long time ago, but each time I've tried to learn a new language I found it particularly productive to have a small specific application that I wanted to create in that new language."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I would recommend that you define yourself a small application you wish to create, or pick an existing small app that you're familiar with and try to recreate it from scratch (e.g a simple calculator)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Python is a great language to start with, you can try so many things directly in the interpreter and see what result you will get."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Programming a GUI involves another level of understanding, I'd be tempted to start out creating my app to be command-line driven.", "When you've got the basics of getting the program to run properly from the command line, putting it into a GUI will be a lot of fun that offsets the pain a little."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I think starting with a language such as python is quite a good idea.", "It has the advantage of being much less gnarly than something such as C or C++, gives you a quick edit test cycle so you very quickly see your mistakes, and it's widely used so there's plenty of wisdom out there.", "Also it's not your ultimate target, so you won't get sucked into being over ambitious and try to write the great apps you want to write before you have mastered programming."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "not", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}, {"text": ["That leads to my second point, it's really important to realise that there is a lot to learn and much of it is incremental, that is, things build.", "You learn one thing, and that enables you to do something else.", "You can't learn the later stuff first!", "So you must be patient, take whatever books you are using and do the examples.", "All (or at least most) of the examples.", "You are not just learning the details of the language you are learning ways of thinking and especially how to figure out the problems, why things don't work."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "incremental", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "do", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["So my suggestion fo dealing with the lack of concentration is that you may need to spend more time doing.", "Don't expect to read too much before you try some doing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Have fun!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You got great answers up here already, but I will add my two cents to them.", "Programming is NOT something that you can just learn and do immediately.", "It requires a lot of commitments and experience.", "Hence, just go ahead with whatever you are doing and continue doing it.", "I personally believe that Python is a great language that covers a lot of different language features that you would see in various languages.", "However, remember that after all, computer languages are just languages like English, Spanish, etc.", "Knowing different languages does not make a good programmer; however, knowing what you want to do and how you want to do it can make you a good programmer.", "Just keep coding.", "Start with simple hello world to fibonacci sequences to some puzzles to more complex designs to more complex architectures, etc.", "Practice with Project Euler."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Project Euler", "tag": "a", "pos": 9, "childList": [], "childNum": 0, "href": "http://projecteuler.net/"}, {"text": "", "childNum": 0, "tag": "br", "childList": []}]}, {"text": ["It's good to hear that you have great interest in programming.", "Good Luck!"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}], [{"text": ["I'm not going to answer your questions directly, but rather would like to tell you my story, because I had quite similar experiences in the beginning."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I started programming when I was 12.", "Me and my friend loved video games and were curious about making our own ones.", "He heard somethin' of C++.", "So I went to the library, borrowed a book on it and read it through 5 times, until I noticed, that I didn't understand anything :-P"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["\"My problem is that I understand what I read but I can't apply my knowledge to anything\", You see, that is pretty normal in the beginning - so don't get frustrated by it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I then started to learn easy languages like visual basic/blitz basic and slowly developed an understanding and mental model of computers (and programs)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Python sure isn't the wrong way to start.", "Keep it up!", "Show endurance!, and it will pay of!"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I wish you all the best and much fun with programming."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["You want to write games for iPhone?", "Well, what are you doing messing around with Python?", "Download Xcode and start hacking away ffs!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Seriously, don't bother trying to \"learn how to program\".", "You'll get there eventually anyway.", "Instead focus on graphics hacks, color fading, moving pixels around, scrolling, displaying images... "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Start with the 2d stuff first -- create a Snake game clone to get some idea about controlling input.", "Add more features to it (collision detection, food, walls).", "Write something akin to Pong which will give you a moment of clarity when you realize how easy you can implement the bounce!", "Add sound effects.", "Write an  implementation of the Game of Life to get som kind of data structure insights.", "Add an CPU opponent to your Snake/Pong game, try to make it clever! "], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "Snake", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Snake_%28video_game%29"}, {"text": "Pong", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Pong"}, {"text": "Game of Life", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://www.google.se/search?q=game+of+life"}]}, {"text": ["There are also lots of really cool 2d games tutorials on the net which is really fun to follow.", "But don't start there, explore the basics on your own, trying to have fun get some things moving on the screen! "], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "tutorials", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://icodeblog.com/2009/01/15/iphone-game-programming-tutorial-part-1/"}]}, {"text": ["Go now, young grasshopper, have fun!"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Go now, young grasshopper, have fun!", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Choose a language that is easy to read not easy to write.", "Programmers are lazy and pressed for time and many cannot type so they tend to invent languages with shorthand syntax making the code difficult to read."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Pascal and Basic were designed as learning languages with clean easy to read syntax.", "Later they grew to become fully fledged languages.", "There are both Basic and Pascal versions and compilers that you can use to write Operating Systems!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["COBOL reads like the newspaper and although I have never written a single line of COBOL, I learned a lot about computing just by reading COBOL code."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So choose any language that is easy to read.", "Once you have learned programming then learning a second language is easy."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["First, learning how to program should be your interest.", "Second, Read, read and read(about programming language of your interest).", "Third, Practice what you have read/learned.", "Fourth, Apply!", "and Last but not the least, learn from others.", "Happy programming."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I recently taught myself Objective-C/Cocoa (the language and libraries for OS X and iPhone development).", "I've been programming for six or seven years, I've learned multiple languages, and I found Cocoa really tough at first.", "It's all about using the Cocoa libraries and figuring out how to use them for what you want to do."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Developing GUI-based applications is a bit difficult, and I don't recommend it as a starting point."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think Python is a great learning language.", "Start there, doing simple programs without graphical interfaces.", "Since Python is often used as a teaching language, there are probably lots of resources and text books you can use.", "If you're interested in games, but not ready for GUI programming yet, think of text-based games you can make.", "I did a text-based Yahtzee in high school, for example."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Once you're comfortable with Python, try making a simple graphical game.", "(I've used pygame before and it was a good experience.", ") It will probably be hard, but rewarding."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Then consider moving to Objective-C and Cocoa.", "There are lots of great books and tutorials for you, but they assume prior programming knowledge.", "You might have to read up on C a little bit, because Objective-C is obviously based on C. You'll need to know about memory management, which Python won't teach you."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Remember that this will take time.", "It took me years to become a confident programmer, and I still have a lot to learn.", "Unless you're making this your full-time job, it will take a while.", "Be patient, and have fun!"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Also remember that you don't need a degree in CS to be a good programmer.", "I have a friend who majored in Anthropology in college and is now working as a full-time software developer at a major company because he taught himself a thing or two in his spare time."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["The python website has an interesting tutorial.", "This is how I learned Python for the first time (in the summer between my first and second years at university).", "Granted, I had SOME programming experience from back in high school, but I didn't remember any of it when I was learning python."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "python website", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/"}, {"text": "interesting tutorial", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.python.org/doc/2.5.2/tut/tut.html"}]}, {"text": ["Python is very easy to learn and learning python teaches you to think like a programmer.", "At first, you will have issues with not knowing how to apply things that you have learned.", "This is because what you have learned upto that point would be very simple (things like lists and other data structures).", "But once you've learned those, the applications become apparent in the following examples and you will soon fall in love with programming and python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Also, this might be a resource of use to you."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "this", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://software-carpentry.org/"}]}, {"text": ["Further, you might want to consider getting a proper IDE for your development in python, so for that I would direct you to this question on SO."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "this question on SO", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/81584/what-ide-to-use-for-python"}]}, {"text": ["Hope this helps\nGood Luck"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["My mantra to \"Learn any programming language is through Analogies\" and develop  small application or programs that you learn and finally integrate all the chunks into one big useful application ."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Since you are learning python  and apply your knowledge to anything ,  then i would suggest this website once finish learning python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python Challenge is a game in which each level can be solved by a bit of (Python) programming."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Python Challenge", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pythonchallenge.com/"}]}, {"text": ["Hope this is helpful !"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["find a friend who is also interested in the same goal.", "together it is more fun, human feedback loop instant and you learn what software-development really is: \"working in a team\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["further learn infrastructure stuff along the line: source-control-systems (e.g.", "subversion), command-line (e.g.", "bash)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["the IDE is also important.", "never the less start with basic tools (editor + compiler/interpreter).", "in my view beginners are always tempted and start to use full blown IDE from start on and have no clue about the 'behind the scenes'."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Most of the answers above plus the following..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Some ideas..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you are interested in games, try helping with an open source project rather than write one from scratch.", "Take an existing program and try to put your own special spin on it somewhere.", "You also might want to find a text based game (i.e.", "mud) that is recruiting developers.", "There are still tons of them out there believe it or not, and there is always someone recruiting.", "Some have horrible shlock code, and some have some pretty nice code engines. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Good luck."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Python for Software Design (How to Think Like a Computer Scientist) is aimed at beginner programmers learning with Python.", "Might be worth a look."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python for Software Design (How to Think Like a Computer Scientist)", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.greenteapress.com/thinkpython/"}]}], [{"text": ["Just make it fun !"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Amazingly Scala might be the easiest language if you try Kojo"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Kojo", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.kogics.net/sf%3akojo"}]}], [{"text": ["The lowest barrier to entry for iPhone game development is Corona, it uses Lua which is very easy to learn, read, write and use.", "Even simpler syntax than Python in most cases."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Corona", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://anscamobile.com/"}, {"text": "Lua", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.lua.org/"}]}], [{"text": ["JavaScript (client-side) can accelerate learning of programming, especially because:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 12, "lis": [{"text": "Syntax with strong similarities to Java, C, and C++ (braces and semicolons become natural).", "tag": "none", "senID": 1}, {"text": "Only need a web browser and some kind of text editing environment to start writing programs--no need for compilers, IDEs, additional runtimes.", "tag": "none", "senID": 2}, {"text": "If you prefer to use an IDE, JavaScript is well supported in many IDEs.", "tag": "none", "senID": 3}, {"text": "It's free; no need to purchase a licence.", "tag": "none", "senID": 4}, {"text": "Frequently involves writing functions; you will write a lot of these as a programmer.", "tag": "none", "senID": 5}, {"text": "Has powerful features that are abstracted in a programmer-friendly manner (example: associative arrays, dynamic typing).", "tag": "none", "senID": 6}, {"text": "Can be used in a manner that is similar to OOP--because it is object-based, one becomes more familiar with using objects. ", "tag": "none", "senID": 7}, {"text": "You can quickly see results in a web browser.", "tag": "none", "senID": 8}, {"text": "Virtually all modern browsers that run on most any platform/OS support JavaScript or at least a subset of it.", "tag": "none", "senID": 9}, {"text": "Lots of online resources and books, as well as code examples/snippets.", "tag": "none", "senID": 10}, {"text": "Extremely useful--good chance that sooner or later you will need JavaScript skills for web development, and a lot of programmers end up writing web apps at one point or another in their careers, even if they never intended to do web development.", "tag": "none", "senID": 11}, {"text": "Does not appear to be going out-of-style anytime soon.", "tag": "none", "senID": 12}]}]]