[[{"text": ["Yes, I do think that Python would be a good replacement.", "I understand that the Twisted Python framework is quite popular."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Twisted", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/trac/"}]}], [{"text": ["I'd say that if:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 9, "lis": [{"text": "Your C code contains no platform specific requirements", "tag": "none", "senID": 1}, {"text": "You are sure speed is not going to be an issue going from C to python", "tag": "none", "senID": 2}, {"text": "You have a desire to not compile anymore", "tag": "none", "senID": 3}, {"text": "You would like to try utilise exception handling", "tag": "none", "senID": 4}, {"text": "You want to dabble in OO", "tag": "none", "senID": 5}, {"text": "You might choose to run on many platforms without porting", "tag": "none", "senID": 6}, {"text": "You are curious about dynamic typing", "tag": "none", "senID": 7}, {"text": "You want memory handled for you", "tag": "none", "senID": 8}, {"text": "You know or want to learn python", "tag": "none", "senID": 9}]}, {"text": ["Then sure, why not.  "], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["There doesn't seem to be any technical reason you shouldn't use python here, so it's a preference in this case."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}], [{"text": ["Remember as well, you can leave parts of your program in C, turn them into Python modules and build python code around them - you don't need to re-write everything up-front."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Assuming that you have control over the environment which this application will run, and that the performance of interpreted language (python) compared to a compiled one (C) can be ignored, I believe Python is a great choice for this."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If I was faced with a similar situation I'd ask myself a couple of questions:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Is there anything more important I could be working on?", "tag": "none", "senID": 1}, {"text": "Does Python bring anything to the table that is currently handled poorly by the current application?", "tag": "none", "senID": 2}, {"text": "Will this allow me to add functionality that was previously too difficult to implement?", "tag": "none", "senID": 3}, {"text": "Is this going to disrupt service in any way?", "tag": "none", "senID": 4}]}, {"text": ["If I can't answer those satisfactorily, then I'd put off the rewrite. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Yes, I think Python is a good choice, if all your platforms support it.", "Since this is a network program, I'm assuming the network is your runtime bottleneck?", "That's likely to still be the case in Python.", "If you really do need to speed it up, you can include your long-since-debugged, speedy C as Python modules."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If this is an embedded program, then it might be a problem to port it since Python programs typically rely on the Python runtime and library, and those are fairly large.", "Especially when compared to a C program doing a well-defined task.", "Of course, it's likely you've already considered that aspect, but I wanted to mention it in the context of the question anyway, since I feel it's an important aspect when doing this type of comparison."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]