[[{"text": ["Here's some good advice on Python idioms from this page:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "this page", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://jaynes.colorado.edu/PythonIdioms.html"}]}, {"tag": "hr", "senID": 1}, {"text": ["Catch errors rather than avoiding them to avoid cluttering your code with special cases.", "This idiom is called EAFP ('easier to ask forgiveness than permission'), as opposed to LBYL ('look before you leap').", "This often makes the code more readable.", "For example:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Worse:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n #check whether int conversion will raise an error\nif not isinstance(s, str) or not s.isdigit:\n    return None\nelif len(s) &gt; 10:    #too many digits for int conversion\n    return None\nelse:\n    return int(str)\n</code>\n</pre>\n", "senID": 4}, {"text": ["Better:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n try:\n    return int(str)\nexcept (TypeError, ValueError, OverflowError): #int conversion failed\n    return None\n</code>\n</pre>\n", "senID": 6}, {"text": ["(Note that in this case, the second version is much better, since it correctly handles leading + and -, and also values between 2 and 10 billion (for 32-bit machines).", "Don't clutter your code by anticipating all the possible failures: just try it and use appropriate exception handling.", ") "], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["\"Is my python coding style too paranoid?", "Or is there a way to improve readability while keeping it fool-proof?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Who's the fool you're protecting yourself from?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You?", "Are you worried that you didn't remember the API you wrote?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["A peer?", "Are you worried that someone in the next cubicle will actively make an effort to pass the wrong things through an API?", "You can talk to them to resolve this problem.", "It saves a lot of code if you provide documentation."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["A total sociopath who will download your code, refuse to read the API documentation, and then call all the methods with improper arguments?", "What possible help can you provide to them?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The \"fool-proof\" coding isn't really very helpful, since all of these scenarios are more easily addressed another way."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["If you're fool-proofing against yourself, perhaps that's not really sensible. "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["If you're fool-proofing for a co-worker or peer, you should -- perhaps -- talk to them and make sure they understand the API docs."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["If you're fool-proofing against some hypothetical  sociopathic programmer who's out to subvert the API, there's nothing you can do.", "It's Python.", "They have the source.", "Why would they go through the effort to misuse the API when they can just edit the source to break things?"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["It's unusual in Python to use a private instance attribute, and then expose it through a property as you have.", "Just use self.text_values."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "self.text_values", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["Your code is too paranoid (especially when you want to protect only against yourself)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "paranoid", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["In Python circles, LBYL is generally (but not always) frowned upon.", "But there's also the (often unstated) assumption that one has (good) unit tests."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "But", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["Me personally?", "I think readability is of paramount importance.", "I mean, if you yourself think it's hard to read, what will others think?", "And less readable code is also more likely to catch bugs.", "Not to mention making working on it harder/more time consuming (you have to dig to find what the code actually does in all that LBYLing)"], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "yourself", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "does", "childNum": 0, "tag": "em", "pos": 4, "childList": []}]}], [{"text": ["If you try to make your code totally foolproof, someone will invent a better fool.", "Seriously, a good rule of thumb is to guard against likely errors, but don't clutter your code trying to think of every conceivable way a caller could break you."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "likely", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}], [{"text": ["instead of spending time in assert and private variable i prefer spend time in documentation and test cases.", "i prefer read documentation and when i have to read code i prefer read tests.", "this is more true the more code grow up.", "in the same time tests give you a fool-proof code and useful use cases."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "assert", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}], [{"text": ["I base the need for error checking code on the consequences of the errors that it's checking for.", "If crap data gets into my system, how long will it be before I discover it, how hard will it be to determine that the problem was crap data, and how difficult will it be to fix?", "For cases like the one you've posted, the answers are generally \"not long,\" \"not hard,\" and \"not difficult."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But data that's going to be persisted somewhere and then used as the input to a complicated algorithm in six weeks?", "I'll check the hell out of that."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I don't think this is specific to python.", "I'm a firm believer in Design by Contract: Ideally all functions should have clear pre- and post-conditions; unfortunately most languages (Eiffel being the canonical exception) don't provide particularly convenient ways to achieve this which contributes to the apparent conflict between clarity and correctness. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As a practical matter, one approach is to write a 'checkValues' method so as to avoid cluttering __init__.", "You can even compress it to:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "__init__", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n def __init__(self, text_values):\n   self.text_values = checkValues( text_values )\n\ndef checkValues(text_values):\n   for text_value in text_values:\n        assert isinstance(text_value, basestring), u'All text_values should be str or unicode.'\n        assert 2 &lt;= len(text_value), u'All text_values should be at least two characters long.'\n    return( frozenset( text_values ) )\n</code>\n</pre>\n", "senID": 2}, {"text": ["Another approach would be using a folding text editor that can hide/show the pre-conditions with the aid of some commenting conventions; this would also be useful for auto-generating documentation."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Take all the energy you're putting into argument checking and channel it instead into writing clear, concise doc-strings."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Unless you're writing code for nuclear reactors; in which case I would appreciate you doing both."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]