[[{"text": ["There aren't hard-and-fast rules, but I would say it's better to err on the side of more specialized applications.", "Ideally an application should handle just one functional concern: i.e.", "\"tagging\" or \"commenting\" or \"auth/auth\" or \"posts.", "\"  This type of design will also help you reuse available open source applications instead of reinventing the wheel (i.e.", "Django comes with auth and comments apps, django-tagging or django-taggable can almost certainly do what you need, etc).  "], "childNum": 4, "tag": "p", "senID": 0, "childList": [{"text": "auth", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://docs.djangoproject.com/en/dev/topics/auth/#topics-auth"}, {"text": "comments", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://docs.djangoproject.com/en/dev/ref/contrib/comments/#ref-contrib-comments-index"}, {"href": "http://code.google.com/p/django-tagging/", "text": "django-tagging", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://code.google.com/p/django-taggable/", "text": "django-taggable", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Generic foreign keys can help you decouple applications such as tagging or commenting that might be applied to models from several other applications."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Generic foreign keys", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.djangoproject.com/en/dev/ref/contrib/contenttypes/#id1"}]}], [{"text": ["You should try and separate the project in as much applications as possible.", "For most projects an application will not contain more than 5 models.", "For example a project like SO would have separate applications for UsersProfiles, Questions, Tags (there's a ready one in django for this), etc.", "If there was a system with static pages that'd be a separate application too (there are ready ones for this purpose).", "You should also try and make your applications as generic as possible, so you may reuse them in other projects.", "There's a good presentation on reusable apps."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "presentation", "tag": "a", "pos": 5, "childList": [], "childNum": 0, "href": "http://www.youtube.com/watch?v=A-S0tqpPga4&feature=PlayList&p=D415FAF806EC47A1&index=14"}]}], [{"text": ["Just like any set of dependencies... try to find the most useful stand-alone aspects of the project and make those stand-alone apps.", "Other Django Apps will have higher level functionality, and reuse the parts of the lowest level apps that you have set up."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In my project,  I have a calendar app with its own Event object in its models.", "I also have a carpool database set up, and for the departure time and the duration I use the calendar's Event object right in my RideShare tables.", "The carpooling database is calendar-aware, and gets all the nice .ics export and calendar views from the calendar app for 'free."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["There are some tricks to getting the Apps reusable, like naming the templates directory: project/app2/templates/app2/index.html.", "This lets you refer to app2/index.html from any other app, and get the right template.", "I picked that one up looking at the built-in reusable apps in Django itself.", "Pinax is a bit of a monster size-wise but it also demonstrates a nice reusable App structure."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If in doubt, forget about reusable apps for now.", "Put all your messages and polls in one app and get through one rev.", "You'll discover during the process what steps feel unnecessary, and could be broken out as something stand-alone in the future."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["A good question to ask yourself when deciding whether or not to write an app is \"could I use this in another project?\".", "If you think you could, then consider what it would take to make the application as independent as possible; How can you reduce the dependancies so that the app doesn't rely on anything specific to a particular project."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Some of the ways you can do this are:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "Giving each app its own urls.py", "tag": "none", "senID": 2}, {"text": "Allowing model types to be passed in as parameters rather than explicitly declaring what models are used in your views.  Generic views use this principle.", "tag": "none", "senID": 3}, {"text": "Make your templates easily overridden by having some sort of template_name parameter passed in your urls.py", "tag": "none", "senID": 4}, {"text": "Make sure you can do reverse url lookups with your objects and views.  This means naming your views in the urls.py and creating get_absolute_url methods on your models.", "tag": "none", "senID": 5}, {"text": "In some cases like Tagging, GenericForeignKeys can be used to associate a model in your app to any other model, regardless of whether it has ForeignKeys \"looking back\" at it.", "tag": "none", "senID": 6}]}], [{"text": ["I'll tell you how I am approaching such question: I usually sit with a sheet of paper and draw the boxes (functionalities) and arrows (interdependencies between functionalities).", "I am sure there are methodologies or other things that could help you, but my approach usually works for me (YMMV, of course)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Knowing what a site is supposed to be is basic, though.", ";)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think this post gives a lot of insight about django reusable apps: see the link below:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["reusable apps conventions on oebfare"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "reusable apps conventions on oebfare", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://oebfare.com/blog/2008/nov/04/reusable-app-conventions/"}]}], [{"text": ["I have an entry on my blog about how I manage and design re-usable apps.", "You can check it out here:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.philipotoole.com/reusable-django-applications"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.philipotoole.com/reusable-django-applications", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.philipotoole.com/reusable-django-applications"}]}, {"text": ["I have found keeping them very small to be great help -- particularly with testing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]