[[{"text": ["You can spend decades researching and learning and still never be finished.", "I've been learning on the job for over a decade."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Since you're learning without a lot of structure, I suggest you come up with a small task you'd like to perform and then learn a set of tools as a means to completing that task.", "Feel free to wander from language to language, where ever your interest takes you, but stay focused on that one task, whatever it might be."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Something like organizing or managing your mp3 or movie collection is probably a good place to start for someone your age."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["EDIT: also, get a mentor.", "This community is a good source of information, but is no substitute for someone genuinely interested in your progress, checking in and keeping you motivated.", "Find a willing teacher or older student and latch on.", "Good luck!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I feel compelled to link to Peter Norvig's Teach Yourself Programming in Ten Years which is a great article about learning the craft of programming.", "This quote seems relevant:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Teach Yourself Programming in Ten Years", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://norvig.com/21-days.html"}]}, {"tag": "ul", "num": 1, "lis": [{"text": ["Keep it simple"], "childNum": 0, "tag": "em", "senID": 1, "childList": []}]}, {"text": ["I've been programming for three decades and I'm still learning."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["When I work on learning a new language, rather than a set time, I consider myself to know the language reasonably well when I reach a certain comfort level with it.", "Usually this is when I can put together a small project using included libraries of the language without having to lookup syntax, and where I'm comfortable using the language tools.", "For example, working on Ruby now, building a small thing with parsing/templating and some database connections, getting comfortable with ri, irb, rake, maybe rails.", "When I'm done I won't feel like a Ruby expert, but I'll feel like I know the language well enough to get around in it and to get things done."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Better to know one language well ( or at least well enough to be able to accomplish some of the things you want to do) than know a bit about a few languages.", "As others have mentioned here, the best way I've found so far to get to that feeling of comfort with a language is to build a small project with it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Until you learn it and while you continue to use it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["While it may seem like a snarky answer there is no better way.", "If you're using a language, continue to use it and push further into it.", "If you're just learning a language, keep learning until you feel you can't learn anything more about the language itself.", "Don't forget, that not only will there be languages to learn but there will also be libraries to master."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For your first language I'd go back to Python and spend a good 6 months on it.", "In some ways learning your first language well will be the bedrock or foundation for you to explore other languages.", "You'll be able to see what advantages/disadvantages each offers without resorting to reading other people's opinions."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The zen answer: you'll know when you know."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Longer answer:\nJust keep working with whatever language(s) you feel like.", "It will all make sense after a while.", "Each person is different, there is no golden path that will work the same for everyone.", "And you are young, so don't worry about it too much, and keep playing baseball."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I never quite learn something until I have to actually use it on production code. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["No matter how interesting my own projects are, I always forget it. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So, keep going like that, you'll have a good grasp of the languages, when you really need to use it, the that will stick into your mind forever ( well, not forever but.. oh well ) "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You have a lifetime to learn languages if you want.", "You'll never know everything about a particular language.", "(Heck, even Jon Skeet doesn't know everything."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But there is advantage to knowing something about a lot of different languages.", "It makes you more flexible and helps you to learn new languages more easily in the future."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you have some web design under your belt, try to get your web sites to do some cool stuff with your new programming knowledge.", "Having something useful on the web in your late teens / early twenties is a fantastic start.", "You may never have to work as someone else's employee if you hit the next killer web app early enough."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["\"Working on learning a new language\" is kind of the wrong thing to do.", "Without a goal, it will seem pointless."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to pick up a new language, then pick a project you want to do, and do it in that language.", "You will have great motivation to learn what you need, because you'll have a goal in mind - to complete the project.", "As you do more projects, the language will become easier to use."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Also I don't recommend Dive Into Python if you haven't programmed before - it's a bit advanced.", "It's more like \"Learn The Good Parts of Python Quickly for Programmers\""], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Sounds to me like you should be focusing on learning programming best practices rather than getting hung up on which language to use."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'd spend a while (at least a semester, and at least 5 projects) on one language to really get the feel for the act of programming. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I look at learning to program as having 4 stages:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["1) Learn your first language: In this stage, you are learning the syntax of your first language.", "You are learning about the general CONCEPTS of programming, conditionals, loops, functions, etc, and how they are done in the language you have chosen."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["2) Learn some programming techniques: In this stage you are learning about programming in general.", "Look into various programming idioms, data structures, algorithms, etc."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["3) Learn 2-4th language: IMHO, these should be very different from the 1st.", "If the 1st was Java, make the 2nd Lisp or Haskell.", "The idea here is to learn a VARIETY of languages. "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Once you know 3 sufficiently different languages, the next 20 should be just about trivial."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["4) Learn more specific things depending on the type of programming you do.", "This can last a lifetime. "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["Actually, the latter bit of the question is kind of interesting.", "Maybe whenever we push our favourite language we should express it as a ratio with respect to the other languages we know.", "I would suggest that only languages we have been paid for usiing can count, in which case C++ would for me be about 1/30."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I can't remember for the life of me where I read this, but I believe there was a study done that produced a conclusion stating after 6 months of experience with a given programming language, your knowledge of the language is no longer the bottleneck in your performance.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Having that said, I believe the participants in that study were full-time developers.", "So, if you figure 40 hours/week @ 4.333 weeks per month for 6 months, you're talking 1040 hours on the job.", "Subtract 20% for overhead and non-programming tasks (random guess), and that leaves you with 832 hours."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So, you should spend 832 hours with a given language before moving on to the next.", ":)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'm not sure time is the right measure here.", "My experience varies by language, but as a rough rule of thumb, it takes me about 10,000 lines of code written to get proficient and productive.", "(If it's a similar language, the number is smaller; with a lot of ML experience under my belt, I started feeling really comfortable in Haskell in the range of 3,000&ndash;5,000 lines written."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "I'm not sure time is the right measure here.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "10,000 lines of code written", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["Learn python, build a complete working website using it.", "then learn Ruby and write same website from scratch.", "then learn haskell but do not think of building something in it ;)\ntill the time you may have already known the answer"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You focus on a programming language only as long as it serves your needs.", "(1)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you think that is too obvious, caution!", "Most programmers stick with the same thing too long, and for what begin to sound like religious reasons after a while.", "Programming languages are not carved in stone.", "They change, and adapt, and new ones come along that solve new kinds of problems, and the old ones improve based on modern considerations.", "The only language of which I am aware that can make any claim towards some kind of mathematical purity is probably Lisp/Scheme, but this is irrelevant, see (1)."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "carved in stone", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "modern", "childNum": 0, "tag": "em", "pos": 3, "childList": []}]}, {"text": ["Until your needs include something specific that Python doesn't provide, I would suggest that you stick with that.", "You can explore all the programming paradigms (OOP, procedural, functional) available save runtime macros (a la Lisp), and python covers a lot of ground otherwise.", "For example, the JVM and .NET are available via Jython and IronPython.", "Runtime speed is not nearly as big a deal as it is often made out because performance hotspots can be coded in C and trivially integrated.", "Python code is exceptionally portable.  "], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "Jython", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.jython.org/"}, {"text": "IronPython", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.codeplex.com/wikipage?ProjectName=IronPython"}]}, {"text": ["Regarding your other question, my primary language/implementation is Delphi, because as cool as Python is, rich client-side native Windows GUI apps are easier in Delphi.", "I use Python predominantly as a utility language, but recently also for the web (Django).", "My bedtime reading is The Little Schemer and The Seasoned Schemer, as electro-shock therapy against becoming too used to conventional industry paradigms."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "The Little Schemer", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0262560992"}, {"href": "http://rads.stackoverflow.com/amzn/click/026256100X", "text": "The Seasoned Schemer", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["The one other language that I would play with (if only I had the time) is Clojure, for no better reason than to satisfy a morbid curiosity regarding whether Lisp finally becomes practical in the presence of extensive libraries; I hope yes."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "Clojure", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://clojure.org/"}, {"text": "yes", "childNum": 0, "tag": "em", "childList": []}]}]]