[[{"text": ["My school (Georgia Tech), along with Bryn Mawr and Microsoft Research, are doing a project right now called Pyjama.", "Basically, it uses the Microsoft DLR to allow you to freely mix Python and Ruby.", "I haven't tried it, but it sounds pretty cool."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Pyjama", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.roboteducation.org/Pyjama"}]}, {"text": ["Here's an example from the website.", "You enter the class in \"Python mode\".", "Then it gets compiled, and you run the command in \"Ruby mode\"."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n class PythonClass:\n     def hello(self, value):\n         print \"Python says hello to\", value\n\npc = python_class().new\npc.hello \"Ruby\"\n</code>\n</pre>\n", "senID": 2}, {"text": ["Which produces \"Python says hello to Ruby\"."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["It might by possible, but not very practical.", "It would be significantly easier to port whatever modules you need from one to the other than it would be to embed one of the interpreters within the other."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you absolutely have to use both languages in a project, your best option would probably the combination of Jython and Jruby, or IronPython and IronRuby.", "I'm not sure if you could get them to talk to each other, but at the very least you could host them on the same virtual machine."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["For a research project I wanted to use the fabulous matplotlib that's available for Python.", "I also found that library that you referred to.", "However, it doesn't look like something popular and well tested.", "So I decided to write the script that generated graphs using pure Python and called it from Ruby via popen.", "That worked very well for me."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You can write extensions for Ruby in C. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So, if Python has a C API, you can write a C extension for Ruby which uses this API. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I know nothing about the Python API or how large of a piece you want to integrate with, but if it is not too big, this could (possibly) give you a way to run Python code from Ruby. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Integrating dynamic languages is one of the goals of the Parrot project.", "It's a virtual machine that dynamic language compilers target.", "Once compiled to the same virtual machine, you should be able to used the \"object\" form in any of the languages no matter the object's source."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Parrot", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.parrot.org/"}]}, {"text": ["The issue at the moment, however, is stabilizing the virtual machine and finishing off the mostly done compilers.", "However, that's been the state for a long time.", ":)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Another strategy, as used by Facebook, is to expose APIs via Thrift.", "You define lightweight service APIs and the RPCs are inter-process."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Thrift", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://incubator.apache.org/thrift/"}]}]]