[[{"text": ["There is frankly no way to mechanically and meaningfully translate C to Python without suffering an insane performance penalty.", "As we all know Python isn't anywhere near C speed (with current compilers and interpreters) but worse than that is that what C is good at (bit-fiddling, integer math, tricks with blocks of memory) Python is very slow at, and what Python is good at you can't express in C directly.", "A direct translation would therefore be extra inefficient, to the point of absurdity."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The much, much better approach in general is indeed to keep the C the C, and wrap it in a Python extension module (using SWIG, Pyrex, Cython or writing a wrapper manually) or call the C library directly using ctypes.", "All the benefits (and downsides) of C for what's already C or you add later, and all the convenience (and downsides) of Python for any code in Python."], "childNum": 5, "tag": "p", "senID": 1, "childList": [{"text": "SWIG", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.swig.org"}, {"text": "Pyrex", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.cosc.canterbury.ac.nz/greg.ewing/python/Pyrex/"}, {"text": "Cython", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://cython.org"}, {"text": "writing a wrapper manually", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://docs.python.org/ext"}, {"text": "ctypes", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://docs.python.org/lib/module-ctypes.html"}]}, {"text": ["That won't satisfy your 'sandboxing' needs, but you should realize that you cannot sandbox Python particularly well anyway; it takes a lot of effort and modification of CPython, and if you forget one little hole somewhere your jail is broken.", "If you want to sandbox Python you should start by sandboxing the entire process, and then C extensions can get sandboxed too."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The fastest way (in terms of programmer effort, not efficiency) would probably involve using an existing compiler to compile C to something simple (for example LLVM) and either:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "interpret that in Python (exorbitant performance penalty)", "tag": "none", "senID": 1}, {"text": "translate that to Python (huge performance penalty)", "tag": "none", "senID": 2}, {"text": "translate that to Python bytecode (big performance penalty)", "tag": "none", "senID": 3}]}, {"text": ["Translating C to Python directly is possible (and probably yields faster code than the above approaches), but you'd be essentially writing a C compiler backend, which is a huge task."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit, afterthought: A perhaps even more quick-and-dirty way of doing that is to take the parse tree for the C code, transform that to a Python data structure and interpret that in Python."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Write a C interpreter in pure Python?", ";-)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Why not keeping the C code and creating a Python C module which can be imported into a running Python environment?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "creating a Python C module", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/doc/ext/intro.html"}]}], [{"text": ["First, i'd consider wrapping the existing C library with Pythonic goodness to provide an API in the form of a python module.", "I'd look at  swig, ctypes, pyrex, and whatever else is out there these days.", "The C library itself would stay there unchanged.", "Saves work.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But if i really had to write original Python code based on the C, there's no tool i'd use, just my brain.", "C allows too many funny tricks with pointers, clever things with macros, etc that i'd never trust an automated tool even if someone pointed one out to me.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I mentioned Pyrex - this is a language similar to C but also Python oriented.", "I haven't done much with it, but it could be easier than writing pure python, given that you're starting with C as a guide."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Converting from more constrained, tamer languages such as IDL (the data languages scientists like to use, not the other IDL) is hard, requiring manual and mental effort.", "C?", "Forget it, not until the UFO people give us their fancy software tools that are a thousand years ahead of our state of the art!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Any automatic translation is going to suffer for not using the power of Python.", "C-type procedural code would run very slowly if translated directly into Python, you would need to profile and replace whole sections with more Python-optimized code."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'd personnaly use a tool to extract an uml sheme from the C code, then use it to generate python code."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["From this squeleton, I's start to get rid of the uncessary C-style structures and then I'd fill the methods with python code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think it would be the safer and yet most efficient way."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["use indent(1) and ctopy(1)... for extra credit test speeds on pypy... for bonus credit use pyastra to generate assembly code."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Regardless of language you will always have to sacrifice storing outputs of various constructs and functions between run-time space (CPU) or memory-space (RAM)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Check the great language shootout if you want to see what I'm talking about either way this is too much comp sci snobbery... "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Here is an example, want to use floating point math without using floating point numbers?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n x * 1,000,000 = a\ny * 1,000,000 = b\na {function} b = result\nresult / 1,000,000 = z\n</code>\n</pre>\n", "senID": 4}, {"text": ["Don't get bogged down, get primal, use caveman math if you have to."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["You can always compile the C code, and load in the libraries using ctypes in python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]