[[{"text": ["python is interpreted, so it won't run without python.", "However, that doesn't mean that python has to be installed, you can include a copy in your program directory or even bundle your program and the python runtime into a single file."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["C and C++ compilers toolchains generate machine code (in most cases, C interpreters do exist, as do C and C++ -> p-code and bytecode compilers).", "But most C and C++ programs use shared libraries, and will not run unless the shared library is present (again, doesn't have to be installed, can be placed in the program directory).", "There's also usually a build option (static linking) to include all necessary libraries in the main program file."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "compilers", "childNum": 0, "tag": "strike", "pos": 0, "childList": []}]}, {"text": ["But the result is still limited to a particular combination of OS and CPU architecture.", "Getting a program to run on more than a single platform always requires platform-specific runtime support."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Look at py2exe and py2app for Windows and Mac.", "Macs running OSX and most modern Linuces have Python installed, however. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["C/C++ apps are normally compiled to executables which work on one machine/OS architecture (e.g.", "32-bit Windows, or 64-bit OSX); such an executable can run on some but not all machines.", "For example, 64-bit Windows or OSX can run programs built either for the 32-bit or 64-bit flavor of their respective OSes. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You can use py2exe for distributing Python programs to Windows."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.py2exe.org/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.py2exe.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.py2exe.org/"}]}], [{"text": ["If a you have written a program in any language, and that program is not compiled to machine code, something on the user's computer must convert it to machine code before it can be run. "], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "any language", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "something", "childNum": 0, "tag": "em", "childList": []}, {"text": "must", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["In the case of JavaScript, that \"something\" is often a web browser.", "In the case of Python, that is often a stand-alone interpreter, though it is possible to compile it:"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "\"something\"", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Is it feasible to compile Python to machine code?"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Is it feasible to compile Python to machine code?", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/138521/is-it-feasible-to-compile-python-to-machine-code"}]}, {"text": ["However, to be clear: just because your program is not compiled to imachine code does not mean that it will be interpreted.", "Programs written in C# are usually compiled to MSIL, which is compiled to machine code the first time the program is run.", "Java programs are also compiled when they are first run."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "not", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "MSIL", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Common_Intermediate_Language"}]}], [{"text": ["I will give a practical application of sending code to a remote machine to run.", "This is typically done in the BOINC project, a community GRID computing initiative which has produced gems such as SETI@Home.", "The applications typically are compiled C++ versions with multi-platform binaries for x86-linux, AMD64-linux, win32, win64 and Mac OS Universal Binaries (with ppc,x86 and 64-bit).", "This is a lot of variety for distribution, but a modern make system can easily automate all that (e.g.", "CMake)."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "BOINC", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://boinc.berkeley.edu/"}, {"text": "CMake", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://www.cmake.org/"}]}, {"text": ["A lot of people prefer the WORA method (write once run anywhere) and stick with VM based language like Java or Python.", "In this case the boinc projects distribute a version of the VM as well as the code to run on it.", "Java VM's being encumbered with licensing issues, Python VM is much nicer.", "Boinc is attempting to embed the Python VM in various BOINC clients to make the distribution of Python based GRID applications easier."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "embed", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://boinc.berkeley.edu/trac/wiki/PythonAppDev"}]}, {"text": ["I hope this gives you an idea about application distribution and helps you make an informed decision."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["There is a py2exe that can produce an executable that will run on another computer without that user installing the normal Python package."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "py2exe", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Yes, C and C++ are (at least normally) implemented as compilers that can produce standalone executables."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Edit: In a typical case, a C or C++ implementation will link the functions from the standard library that are used in the program into the executable.", "This can (and often does) include quite a bit that's not used directly, but still doesn't normally include (anywhere close to) the entire standard library."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "that are used in the program", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["In most cases you can also produce an executable that depends on an implementation of the standard library already being present on the target machine in the form of a shared library, DLL, etc.", "(different OSes use different names).", "This reduces the size of the executable, but increases the headaches involved in distribution; I use it for code I'm compiling on my own machine, but generally avoid it when/if I'm distributing an executable to anybody else.", "Given current hard drive prices, the savings in disk space is rarely worth the headache."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]