[[{"text": ["\"We have begun working in Python and love the simplicity, the terseness, the rapid development."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Good points.", "Those were why I chose Python over Java.", "I also had Java folks lobbying for Java."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["However, while they were still lobbying and hand-wringing, I had prototypes of the site up and running in Django on my laptop."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Add to this the following:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["Direct interface to your legacy C code.", "You can -- with minimal work -- write Python to C glue code and invoke legacy C from Python, easing the transition.", "This requires refactoring the C to clean it up.", "It's not mandatory, but it's an option that's easier in Python than Java."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Unless you make use of some Python features (multiple inheritance, operator overloading for instance) you can trivially translate a clean, simple Python program to Java.", "I offered this to my management.", "At any time, we can pull the plug and rewrite as Java.", "Rewriting Django to Struts will be a lot of work, but it's technically feasible and can be done by n00bz or interns."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]}, {"text": ["My focus in justifying Python is"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Bottom Line  Build a demo of your middleware in Python.", "Trump the deciding and hand-wringing by offering a working solution."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "Bottom Line", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["If your C codebase is large, throwing that out for The Big Rewrite could end very badly."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["How about creating some hooks for Python to drive your C codebase, and using Python for new development?", "There are many options for this, in order of ease (IMO):"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If your C code isn't extensive, then maybe starting over would be an acceptable risk.", "In that case, it comes down to taste and availability of programmers, but if you go the Java route, I'd at least push to get Jython accepted."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you have no Java experience, you could use Jython to allow execution of Python via the JVM. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In terms of best for the business, does your management have a technical (or solid business) reason for wanting Java?", "If the answer is yes, then what's good for the business and you is developing in Java.", "If there are no reasons other than buzzword compliance you may want to lobby for Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I tried both worlds, but just occasionally in java, and I am strongly biased towards python.", "My experience is that Java is very time-consuming.", "You have to write a lot to achieve what you want, unless you use a memory hungry IDE (Eclipse) which basically codes for you (if you know how to use it, which also requires consistent learning time) and you hook into as many libraries as possible that do the task for you.", "On this regard, what you code is just glue code between libraries without the advantage of having a scripting, dynamic language like python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "and", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["On the plus side, in java you have a lot of libraries, while in python sometimes you don't have them.", "However, if you have to interface with C, python is the best choice."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Since you currently use XML and PostgreSQL, put together some sample code based on your existing codebase that works with each technology and use that as evidence with managment.", "My guess is that good Python will be more concise when dealing with XML and I have no idea about the PostgreSQL in Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If management suggests a given platform there is usually a good reason for it.", "One might be that there is more people capable of maintaining your code, which is usually a good thing.", "Setteling on one implementation platform actually makes sense :)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I have been in your shoes with Perl instead of Python some years back, and found:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "The wordyness of Java is a psycological issue, not a technical.  Modern IDE's are very helpful, and auto-completion allows you to just type some of the characters.   It helped a LOT when I simply decided \"I ", "tag": "none", "senID": 2}, {"text": "Java programs have proven to be very maintainable.  The rigidity in the language pays of in terms of robustness of the programs you create, even on a very large scale and the wordiness helps readers understand your code.", "tag": "none", "senID": 3}, {"text": "Java has a enourmous user base, and a gigantic set of user libraries \"out there\".  This helps when you do not want to write all the code yourself.", "tag": "none", "senID": 4}]}, {"text": ["But in your situation you can always settle on Jython, and just write all your stuff in Python and run it on the JVM :-D"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Disclaimer: I am seriously Python biased."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I suppose the question is why does management want to rewrite in Java.", "If its a reason like, we only use Java so that people can switch teams and be acclimated quicker that's one thing.", "If its for another reason you'll have to decide if its worth arguing against.", "Python integrates well with C so as you rewrite you can use the code you've already written.", "Jython gives you the option to bring in Java libraries, but you don't necessarily need them over standard Python's."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Honestly though, I don't know the situation as well as you do.", "You will have to make the decision.", "I guess because you are asking the question you really want to move to Python over Java."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I don't think you can have a clear cut answer, in terms of languages it would be very hard to come to a definite and objective conclusion based on hard evidence, part of this is in the eye of the beholder ..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["What the other guy is pushing for - unit tests, frameworks, etc - could probably be done in Python as well.", "I'd go for java because there are certainly more open source frameworks, code examples, forums, etc as it's been around longer than Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But this is a theoretical debate that doesn't mean much in your precise case, because for your precise problem you'll be solving, both languages might do, in a different area there could be 100 java frameworks and only one Python, but if you never go there ... it doesn't matter to you."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So you need to find out what works best for your team and your app, and I think you need to do some experimentation on your own in order to get more than just a feeling."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I suggest you try to allocate some time ( one-two weeks ) to a couple ( 2-4 ) developers from your team, and have two teams ( 2 guys per team will be better than one per team, but it depends on your resources/priorities/urgencies ) and have each team do a spike solution to one specific functionality from your current code, one team will investigate how they'll do it in Java, the other in Python.", "It sholdn't be fully implemented, just get their hands dirty enough to get a better feeling for each language.", "The teams should be equivalent in terms of knowledge, experience, etc."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["After the two weeks you'll be able to compare the experiences of those two teams and have a better idea what will work for you. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Java might be a better choice on paper, but if your team would be more confortable with Python, there's no point in trying to make your own life harder, if you ( as in your team ) don't like what you're doing ( the language ), you'll be less productive and have worse results on long term ..."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["You have to understand where they're coming from.", "Java developers are around a lot more.", "What you have to do is convince them that they'll get higher quality programmers by looking for Python guys.", "You should also show them examples of how clean and maintainable Python is."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also, to seem honest, mention one of Python's shortcomings and talk about how you can combat it (duck typing [arguably, folks] can be overcome with extensive unit testing) and one of the issues with Java (verbosity) and how it's un-combatable."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["IMO, the thing to know about programming in Java is that while you can do it in a very low-level-C-like fashion, and while there is also a lot of needlessly \"enterprisey\" code out there, you can equally write clean, sensible code.", "Unit tests are definitely well-supported through JUnit, and there are massive libraries available that make your life easier."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "can", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["This is not to say that you should absolutely choose Java over Python, as both have their merits.", "But Python is more fashionable than Java at the moment - and it's worth investigating what well-written Java is like rather than to take the fashions at face value."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The book to read here is Joshua Bloch's Effective Java, the de facto bible on writing sane Java code."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Joshua Bloch's Effective Java", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://java.sun.com/docs/books/effective/"}]}], [{"text": ["Well if management wants to limit the languages in use within the company, then you will have to argue for Python as being the scripting language that is used, and maybe argue that there should be a scripting language in use.", "This might be difficult if you have a lot of Perl used in house as well.", "There is a desire to avoid language explosions in most companies, as it's harder to hire skilled multilanguage programmers."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also don't discount how quick it is to write an object based web service in Java and not actually have to deal with XML at all, as the SOAP/REST layer will do that automatically.", "The Java front-end guys can then use that web service instead (you can provide them with the client library, indeed they could provide you with their data model to give you a head-start with your implementation, it shouldn't be about you and them, you should cooperate to get the best solution for the company).", "The main benefit is that with Java on both sides, you won't get implementation issues with the web service."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And then you can sneak in Jython for extensions that you write yourself.", "Adding this to Java is incredibly easy I've found, especially as an interpreter running Python scripts."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["To be clear up front, my experience with Python is very little while my Java experience is fairly robust."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The reason for choosing a language should ALWAYS be determined by the problem that is trying to be solved.", "It is hard sometimes, but for anything business related you MUST resist the urge to choose a language based on how sexy it is at the time.", "In this case your application seems to be screaming \"enterprise\" (loads of business logic, database backend, interfacing with outside sources).", "When I hear that word the two languages I think of are Java and C# (or other things .Net).", "To get more specific, these would be my reservations about using Python over Java:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["1) Type Safety\n     - I'm sure that others may feel differently, but for large business heavy applications (especially with an unexperienced team) it is dangerous to allow dynamic typing (Python).", "This will lead to RUN-TIME errors because casting isn't checked at compile time.", "Java is statically typed and, with some help from Generics, can eliminate most casting issues."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "1) Type Safety", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["2) Programming Paradigms\n    - I'm not trying to say OOP is better than any other paradigm, but I do want to note that Python allows many different paradigms to be used.", "This is really cool, but can be hard to manage among many programmers, especially if they are just starting out with the language.", "It is actually interesting that you called Java more C like, when it is Python that allows functional programing.", "Another note about this before moving on: if you try to program in Java like you do in C you are likely in for a bumpy road - I can not express in words the pain when trying to maintain a Java application that has been written to look like C."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "2) Programming Paradigms", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["3) Usage Scenerios - Again, my lack of experience with Python may be evident here, but it seems that where Python shines is in Web-based environments or for scripting-type tasks.", "This seems to be exactly what you are NOT doing.", "J2EE is expressly designed for these types of things."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "3) Usage Scenerios", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Those are just the first things that jump to mind (though points about libraries, IDEs, and community support/documentation could also be made - not to mention whitespace issues).", "Please note that I'm not trying to trash Python or any of its features - it seems really cool and powerful - but using it in this case will cause you MAJOR headaches down the road in this environment.", "Trust me."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["One last thing, do you and your team a favor and take some training (either web-based or classroom-based).", "It is worth your time to fully understand whichever language you choose before design and implementation or you may be creating more problems than you had with the C program."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["Last year I wrote a glue application for a customer that queries an Informix database and formatted the results into a text file for import into an AS400 system.", "No GUI required all controls in a properties file.", "I wrote the application in Java.", "The reasons for Java was mainly for the portability as the application had to run on both the Windows and Linux platforms.", "Also the JDBC connects to most relational databases easily.", "Some time later I had the opportunity to write a similar application and this time I chose Python.", "It was my first real Python application and I was impressed by how easy it was to write and how much shorter the application was in terms of lines of code.", "The performance was about the same. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This year as an intellectual exercise I rewrote the Java application in Scala http://scala-lang.org and I found that this really is an interesting language.", "I certainly falls behaves like a scripting language with the portability of applications that run on the JVM and with interesting features.", "I will certainly be writing more applications in Scala in the future."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://scala-lang.org", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://scala-lang.org"}]}]]