[[{"text": ["Are you the only one who's going to read the code? "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["No matter what language you're programming in, it's recommended practice to keep code line length down.", "There are typically 2 types of causes for long lines:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["That being said, that PEP is just a guideline.", "Feel free to break it when you feel you're justified to do so.", "If you break it most of the time you need to reconsider the way you write code."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I find it hard to read text that spans over 80 characters.", "My eye tends to lose the row while moving back to the left margin.", "So in a sense it is not a restriction due to having to view the code on a terminal (or a cmd window or xterm), but it is a readability mandate.", "I find myself breaking the rule by one or two characters at times, but overall I don't mind it.", "Also, I hardly ever have to use the \\ continuation character, as I take advantage of the implicit continuation in lists."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["As with all style guides, it's just that, a guide.", "It's up to you whether or not you follow it.", "The main objective is consistency."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "guide", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["That said, I would recommend adopting an ~80 character limit for the following reasons."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["PEP 8:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["As long as you don't have to scroll horizontally on your wide monitor (because I have seen that)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I set my editor to show me the 80-character limit line, and I use it as a warning, not a stop sign.", "If I can continue the line neatly to the next line before hitting the limit, I do so.", "However, if putting in a continuation makes it hard to read or makes it confusing, I have a long line.", "I won't make code harder to read just for the sake of a guide."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You can do whatever you want if it is your codebase.", "If it is someone else's then you have to play by their rules.", "Google for example has 2 character indents but PEP 8 says to use 4 spaces.", "I believe their is some quote from Guido about programming with 2 space indents by day and 4 spaces by night. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I like a character limit even with a widescreen monitor because then I can put frames of code side-by-side. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Code style is really all about personal preference.", "The important part is consistency.", "So write your python code anyway that makes you happy."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "your", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}], [{"text": ["PEP8 is for humans  but your program will run even if you do not follow it."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PEP8 is for humans", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["If you do not share your code and do not plan to do so, do whatever you want."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you plan to share some part of your code someday, then you should follow PEP8.", "I mean, probably nobody will care if a few lines are 85 characters.", "But the code will be hard to read if it consistently is more than 200 characters wide.", "If you ever read a newspaper the same issue is involved when the text is formatted using columns."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The solution to the line length problem is probably neither arbitrary line break with continuation characters, nor using implicit lines continuation by enclosing some expressions inside parenthesis.", "It's probably to introduce intermediate variables and functions to have a code that logically breaks at less than 79 chars."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["By the way you may want to stick to a still harder limit.", "I prefer 72 characters because I can allow one or two additional quoting levels inside 80 characters text mails.", "If not doing so the identiation will break at first quote."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]