[[{"text": ["I would try runnig the following command from the Django source code directory on the windows command line: "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n C:\\Python26\\python.exe setup.py install\n</code>\n</pre>\n", "senID": 1}, {"text": ["I do this all the time since I have several versions of Python installed on my system.", "Of course, replace Python26 with your Python installation dir.  "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Did you try this simple method (actually the easiest of them all when it comes to installing)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would guess that windows has associated all .py files with your text editor pype.", "So when a script tries to run another script by asking windows to \"open\" the .py file, it just pops up in your editor instead of executing."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": ".py", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Right click on a .py file in windows explorer, choose open-with, and tell it to always open .py files with your python interpreter, python.exe, instead of pype.", "See if that fixes it."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": ".py", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": ".py", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}], [{"text": ["You can try installing Django in a virtualenv.", "A virtualenv lets you decide where you want to install Python packages.", "You can install it in the directory you want (if you have the required permissions).", "A virtualenv can either be a clean room environment, excluding all system-wide modules, or use those modules as well as modules only available within the virtualenv."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "virtualenv", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Placing a clean room virtualenv in a location where you are absolutely sure that you will have the required permissions can help you understand whether it's an issue with file system permissions or something with old .py or .pyc files located somewhere you forgot about."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You can use the installed Python modules in a virtualenv in different environments if you add the appropriate directories within the virtualenv to PYTHONPATH, so you don't need to worry that if you use virtualenv, you will not be able to use Eclipse or any other IDE/editor anymore.", "You just need to configure it appropriately."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Django-admin.py is a file that comes with Django and is used to start django projects and do other administrative stuff.", "Read the following link for more information about it:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["https://docs.djangoproject.com/en/de"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "https://docs.djangoproject.com/en/de", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://docs.djangoproject.com/en/de"}]}, {"text": ["Check to see which directories it is trying to install the django module into.", "It should wind up in the site-packages folder someplace under C:/PythonXXXX/lib/...."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["You may need admin permissions to access that folder on your machine, especially if it is a work machine."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Your best bet would be to get rid of your current install and start from scratch.", "What's pype?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["https://docs.djangoproject.com/en/dev/topics/install/  &lt;--- this has proven very useful for me when installing on Windows 7 and Ubuntu"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "https://docs.djangoproject.com/en/dev/topics/install/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://docs.djangoproject.com/en/dev/topics/install/"}]}]]