[[{"text": ["I don't know anything about python, but in general you would want to break the task down into smaller chunks so that they can be run concurrently.", "You could break it down by file type, or alphabetical or something, and then run a separate script for each portion of the break down."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["In the case of python, as this is IO bound, multiple threads will use of the CPU, but it will probably use up only one core.", "If you have multiple cores, you might want to consider the new multiprocessor module.", "Even then you may want to have each process use multiple threads.", "You would have to do some tweaking of number of processors and threads."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "multiprocessor", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/dev/library/multiprocessing.html"}]}, {"text": ["If you do use multiple threads, this is a good candidate for the Queue class."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Queue", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/dev/library/queue.html"}]}], [{"text": ["You might consider using s3fs, and just running concurrent file system commands from Python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "s3fs", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/s3fs/wiki/FuseOverAmazon"}]}], [{"text": ["I've been using txaws with twisted for S3 work, though what you'd probably want is just to get the authenticated URL and use twisted.web.client.DownloadPage (by default will happily go from stream to file without much interaction)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Twisted makes it easy to run at whatever concurrency you want.", "For something on the order of 200,000, I'd probably make a generator and use a cooperator to set my concurrency and just let the generator generate every required download request."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you're not familiar with twisted, you'll find the model takes a bit of time to get used to, but it's oh so worth it.", "In this case, I'd expect it to take minimal CPU and memory overhead, but you'd have to worry about file descriptors.", "It's quite easy to mix in perspective broker and farm the work out to multiple machines should you find yourself needing more file descriptors or if you have multiple connections over which you'd like it to pull down."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["what about thread + queue, I love this article: Practical threaded programming with Python"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Practical threaded programming with Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.ibm.com/developerworks/aix/library/au-threadingpython/"}]}], [{"text": ["Each job can be done with appropriate tools :)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You want use python for stress testing S3 :), so I suggest find a large volume downloader program and pass link to it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["On Windows I have experience for installing ReGet program (shareware, from http://reget.com) and creating downloading tasks via COM interface."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://reget.com", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://reget.com"}]}, {"text": ["Of course there may other programs with usable interface exists."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Regards!"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]