[[{"text": ["I was in the same situation - a fluent Perl programmer, wondering about learning Python 'as another tool'.", "I actually abortively tried to learn Python several times.", "Each time I gave up because as you say, everything I wanted to do, I could already do in Perl."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It wasn't until my work required me to write in Python that I had enough of a requirement to do so.", "My opinion is that unless you have a strong requirement, such as work or career motives, a need for a key Python library (for example, Pygame), or you really want to use a Python-specific framework like Django, or extend an existing Python project (Civilization IV was a motivator for me), you will find it hard to stick with it, because the two languages cover a lot of similar ground."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Pygame", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.pygame.org"}]}, {"text": ["If you do go down the Python route, there is a related question which may be helpful to you: Python for a Perl programmer."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Python for a Perl programmer", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/2283034/python-for-a-perl-programmer/2283300"}]}, {"text": ["I personally think that the argument that Python is 'cleaner' than Perl, more extensible for large projects etc., is completely bogus.", "But then, as an ex-Perl programmer, I would say that, wouldn't I?", ";) Try them both, and make up your own mind."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Yes, it's worth learning Python, or at least giving it a try.", "Learning a new language is practically never a bad thing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And I say this as someone who loves Perl, has code on CPAN, and has written (and successfully maintained over multiple years) moderately-large applications in Perl.", "I also personally loathe working in Python, because the language just doesn't click for me."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But that's all just me.", "Maybe you'll try Python and love it.", "Maybe you'll try Python and hate it.", "But you'll never know until you try it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Lots of good answers, already.", "I'd just add that given the fact that you already know Perl, the C family, and Java, you may benefit more from learning something more different than Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The obvious next thing to learn is some sort of functional language.", "Take your pick of Scheme, Lisp, Haskell, O'Caml, and maybe Erlang or Scala."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["From a more practical standpoint, if you don't know Javascript, that's an obvious next target.", "If you want to build good modern webapps, you simply must know JS."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["It is definitely worth it. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Learning should take maximum few days if you focus."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I learned Python in second iteration, something lot of my colleagues and other people experienced.", "I went trough Python tutorial and Dive into Python like you said.", "Thinking how to accomplish those examples in other languages gives you clear answer why Python is so hot and popular these days."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Good luck."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You may want to check out ruby. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I can't give you an accurate comparison between python and ruby, as I last did serious python programming 9 years ago, and I only started using ruby in 2007."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I find Perl useful for small programs (up to a screenful) that munge data in more complex way than a simple pipeline.", "But when I get to bigger programs, with more people involved, Python 'scales' up better due to cleaner syntax for classes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would definitely say yes to Python.", "It's a lot more fun to code in than Perl, IMHO.", "Frameworks like Django are nice, and you can even move over to .NET with IronPython."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Plus, it was named after Monty Python...what more reason do you need?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But seriously, Python is a language that is only gaining in popularity, and would be a good one to know, I think."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]