[[{"text": ["Django!", "It's great.", "Look up Django vs Rails."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["\"Which framework will meet the needs of a large website (not just a simple blog) that might require caching in the future (memcached etc) and heavy db usage (mysql) so performance is important."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Yes, Django."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Plus...since you are new, Django will teach you how to separate your layers of logic.", "Database, processing, presentation, etc."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["If you have to learn a new language anyway, then go the Python route - its just so learnable."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "so", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["You might want to consider getting help on a project of this size, if you have never done something similar before: The biggest problem will not be your framework, but your unfamiliarity with the chosen framework and web development in general."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "unfamiliarity", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["I suppose either Python and/or PHP can be a good choice in your case."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I'm more a PHP guy myself, and like Zend Framework -- both PHP and ZF would answer your needs ; but that's something other guys will say for other languages/framework they like... And it'll be true for them too ^^"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "meet the needs of a large website (not just a simple blog) : PHP+ZF = OK", "tag": "none", "senID": 2}, {"text": "caching in the future (memcached etc) : PHP+ZF = OK", "tag": "none", "senID": 3}, {"text": "heavy db usage (mysql) so performance is important : PHP+ZF = OK -- depending on how you design your application, models, queries, ...", "tag": "none", "senID": 4}]}, {"text": ["\nAt the end of the days, both languages/frameworks are good choice -- as it'll end as a matter of what one prefer, you are the one who should choose, really ; not us."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}], [{"text": ["I'd suggest Django as well. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Keep in mind your not going to have to do much raw sql.", "Thats a bit 2004 for websites.", "django's orm is excellent, although multi db support might be a killer, there are alternatives."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Looks like someone may have solved your solr needs"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["http://www.screeley.com/entries/2009/feb/02/django-solr/"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://www.screeley.com/entries/2009/feb/02/django-solr/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.screeley.com/entries/2009/feb/02/django-solr/"}]}], [{"text": ["What hosting is available to you?", "A lot of cheaper shared hosting will not be capable of hosting the Python frameworks so you'd be stuck with PHP in that case anyway.", "But if you have the flexibility to go with Python, I would recommend that instead."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["There is more then one python framework and more then two php frameworks."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In my opinion you should first off decide on the language you want to use and the look at all of the framework options you have."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Most frameworks share the same goals, but try to reach them in different ways.", "You should should chose the one which seems most natural to you."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["When I had to chose python framework, I chose Pylons instead of Django.", "And as JavaScript framework I use Prototype instead of jQuery.", "Why?", "Because I like their coding style and approach better then some other, maybe more popular, framework way of doing things."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Most python frameworks are very modular therefore you will be able to \"plug in\" any kind of code or modules you want to use.", "Just make sure you like the framework it self, try them out, you will have to live with it for quite some time =)."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I would suggest PHP if you are in a hurry because the syntax is \"c-like\". "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Please check this SO thread : which-programming-language-is-the-best-for-my-needs."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "this SO thread : which-programming-language-is-the-best-for-my-needs.", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/1486935/which-programming-language-is-the-best-for-my-needs/1486972"}]}], [{"text": ["Definitely Django."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think that you need make more attention not to a framework, but to optimization and caching.", "If you will handle this, your application would be fast with any of these frameworks. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Personally I prefer Zend Framework, but this is  only my opinion, like I prefer Opera over Firefox and etc.", ":-)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["if you want to write your own queries and the app will be db intensive, CakePHP drops out of the boat imo"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'm currently playing around with Werkzeug, which, coupled with a template engine (e.g.", "GHRML) and a DB abstraction of one form or another can be whatever you want/need it to be."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But it really depends on what level of abstraction you can work with.", "If you're going to do a large-scale \"normal\" website (e.g.", "community, shopping), Django might be the better choice.", "If you're just slapping a few pages together, you might as well use pure PHP."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As others have said, it's like asking what's the best programming language -- it depends on your taste and experience, mostly.", "I've been using plain PHP for years before stumbling over Java Servlets and now finding Python.", "I use Python now because it gives me less headaches -- but YMMV, so stick with PHP if that's what you like to work with."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Find out what you're trying to do, write it all down and try to organise it.", "Then check out a few relevant frameworks and see which one suits your thinking best.", "Just because a framework works for someone, it doesn't necessarily work for you, even you're trying to use it for the same thing."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]