[[{"text": ["Honestly, don't worry about it.", "I spend very little of my time actually writing code that uses a large amount of symbols.", "After coding in a language for several projects your brain just rewires itself for the task at hand."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A good programmer is smart and clever but not always a fast typer. "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "A good programmer is smart and clever but not always a fast typer.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["[update] don't forget the power of the IDE that can auto-type a lot of those symbols for you"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "[update] don't forget the power of the IDE that can auto-type a lot of those symbols for you", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["You're a programmer, not a typist.", "You should be doing more than 2 finger hunt and peck, but you don't need above average typing speed.", "In fact, you have more reason to go slower and avoid typos, like missing a ) or typing x4 when you meant x5.", "These can cause bugs which take a longer to fix than is made up for by tpying fast."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Typing speed and accuracy for numbers and symbols comes from a few fundamental practices that are good for all typing, but essential to touch-type numbers and symbols."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Body position.", "Sit upright, directly in front of the keyboard.", "If your body is yawed to the right or left, or you are leaning to one side, it will be difficult to type accurately, especially the number/symbol keys: They are so far from the home row that any error in your body position can cause your fingers to land right or left of the key."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Body position", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Home row.", "Keep your fingers on the home row (ASDF for your left hand, JKL: for your right).", "When typing a key not on the home row, keep at least one finger on the home row so that you don't lose track of the home row and have to look to regain it."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Home row", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Using the right finger for each key"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Using the right finger for each key", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["For each number/symbol key, always use the same finger, as follows:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"code": "<pre>\n<code>\n `~   A finger\n  1!   A finger\n  2@   S finger\n  3#   D finger\n  4$   F finger\n  5%   F finger\n  6^   J finger\n  7&amp;   J finger\n  8*   K finger\n  9(   L finger\n  0)   ; finger\n  -_   ; finger\n  =+   ; finger\n</code>\n</pre>\n", "senID": 5}, {"text": ["Don't Look"], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "Don't Look", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["When you practice typing, don't look at the keyboard.", "Ever.", "Unless it's to regain the home row after having lost it."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Practice"], "childNum": 1, "tag": "p", "senID": 8, "childList": [{"text": "Practice", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["It will take some practice to be come proficient at touch typing the numbers and symbols--they are the farthest from the home row.", "Don't give up.", "Soon you will be touch-typing them, without looking at the keyboard, and hardly breaking your stride."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}], [{"text": ["I like http://www.typingweb.com .", "You can try it without making an account, just skip the registration screen. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.typingweb.com", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.typingweb.com"}]}], [{"text": ["I'd recommend typeracer.com as a good resource with typing lessons and competitions.", "It is a lot of fun :-)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "typeracer.com", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://typeracer.com"}]}], [{"text": ["You may try switching to programmers dvorak layout, in which keys are placed way more handy than in traditional one.", "For me it is quite an improvement, but requires a lot of exercising, though."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "programmers dvorak", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.kaufmann.no/roland/dvorak/"}]}], [{"text": ["http://programmers.stackexchange.com/questions/tagged/touch-typing"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://programmers.stackexchange.com/questions/tagged/touch-typing", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://programmers.stackexchange.com/questions/tagged/touch-typing"}]}], [{"text": ["That's part of learning to type.", "When you started, you needed to look at the keys, you had trouble stretching for certain letters (I'm talking to you, q) etc."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The more your practiced, the less you looked at the keys, the more your accuracy went up and the faster you became."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The situation is no different for the numbers and the symbols.", "The more you \"touch type\" them, the faster you will become."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Treat the numbers and symbols the same way you treated your letters back when you started touch-typing.", "Force yourself to look at the screen, not the keyboard, make the mistakes and over time you'll get to where the numbers and symbols are no big deal.", "It's has nothing to do with programming and everything to do with typing.", "It's part of the process."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I learned to type when I was a kid.", "My mom was a \"Secretarial Arts\" major, back when they had such degrees, and she'd fiendishly put a Gregg's typing book in front of me each summer for several years, and make me practice for several hours a week on a Royal manual typewriter.", "I hated it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I passed the typing course in high school easily, and people used to look over the cube walls to see what the heck I was doing when I'd be transcribing something from one of my programming manuals into some code because I made a lot of noise on the IBM AT keyboards."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Accuracy is a result of having your typing muscle memory be in good shape, plus having good eye-hand coordination, and being able to spell or at least remember variable and constants and the names of functions so you don't have to look them up as you're typing. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Probably the best thing to do for anyone that wants to get faster is to practice: Start slowly and concentrate on accuracy.", "As muscle memory improves your accuracy will improve.", "As accuracy improves your speed will go up.", "It's a feedback loop of sorts."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Also, our speed and accuracy change depending on stress, how tired we are, how familiar we are with the words/variables/language, etc., because they all affect our muscle memory or are affected by it.", "It's the same thing with playing a musical instrument or anything that requires good manual dexterity.", "\"Practice makes perfect\" so they say."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]]