[[{"text": ["Just use Python.", "You'll have access to the same low-level socket APIs as in C, without having to learn about indirection and memory management at the same time."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Later, if you find that Python is too slow for your purposes, you can rewrite some parts in C. But don't do it to begin with."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Depending on what level(s) of the networking stack you want to work, C may be indispensable, useful, or hardly relevant.", "But if trying to tackle C first is wearing down your motivation, by all means go back to Python and get some success and therefore incentive -- you can come back to C later.", "Learning an easier language first, a harder one later, is a perfectly natural progression!", "MIT, for example, uses Python for some \"programming 101\" courses -- and yet, most definitely, that doesn't turn students off harder languages such as C (or even C++, which is harder yet!", ") in later courses."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["it depends on what purposes for network programming you have.", "Do you want to have a very stable, secure but also slower high-level language or do you want to work with exhausting (my opinion) but fast low-level language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["When it not depends on speed, I would take python.", "You can do a lot of things with it.", "And anything you need is already there.", "Python is built on C, so you also have access to the same API. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In Python it's just easy but also powerful.", "Since you are new, I have some links, that may help you:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Python Recipes"], "childNum": 0, "tag": "a", "senID": 3, "childList": []}, {"text": ["Hidden Features"], "childNum": 0, "tag": "a", "senID": 4, "childList": []}, {"text": ["Code Like a Pythonista"], "childNum": 0, "tag": "a", "senID": 5, "childList": []}]}, {"text": ["There are a lot of books:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Dive Into Python"], "childNum": 0, "tag": "a", "senID": 7, "childList": []}, {"text": "Learning Python", "tag": "none", "senID": 8}, {"text": ["How to think like a Computer Scientist"], "childNum": 0, "tag": "a", "senID": 9, "childList": []}]}, {"text": ["And just for fun, some comics:"], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Fly with Python"], "childNum": 0, "tag": "a", "senID": 11, "childList": []}, {"text": ["From C to Python"], "childNum": 0, "tag": "a", "senID": 12, "childList": []}, {"text": ["New Pet (Hamster Ball)"], "childNum": 0, "tag": "a", "senID": 13, "childList": []}]}, {"text": ["I hope that this is helpful for you."], "childNum": 0, "tag": "p", "senID": 14, "childList": []}], [{"text": ["Twenty years ago, even ten, you couldn't live without it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Now many do."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It's possible (probable, actually) that more than half the programmers in the world don't know C.  It's completely unnecessary for Web work and for most app work.", "I'm being gracious with this--if you really were to include web, hobby, overseas consultants and the like, the percent who have used C is probably pretty low at this point."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Embedded often uses C, but I've worked on 2 embedded platforms (a waveform analyzer and cable box) where I've done nothing but Java work."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Honestly a basic understanding of C is nice for writing drivers and understanding pointers, but these days you can easily get through an entire career without ever needing C.  I personally would completely skip C++, although it's used quite a bit, I don't see any big advantages to learning it now."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "personally", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["I would recommend using Python.", "Because it is a higher level language than C, you can concentrate more on the \"what\" rather than the \"how\".", "This means that you can avoid the level of detail required by C in order to achieve what you need to get done right now."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This isn't to say that a low level of detail is never required.", "It certainly is, but at this time I'd recommend you ignore it and pick it up in the future, should you need to."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["As a python programmer, I would give you the opposite advice.", "Learn python first.", "At least until you learn the limitations and possibilities it has compared to what you can do in C. Then use C for those far out problems you can't fix in Python.", ":)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would recommend Python as the best choice for any complete beginner in programming.", "And I think for networking, Python will work out very well."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In networking, you have to wait quite a while (in computer terms) for messages to be sent and received.", "Even if your language is much slower than C, you may not notice any difference.", "And the low-level guts of the Python networking libraries are probably written in C anyway; Python isn't very slow when you are using it as a way to invoke C code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Also, as a beginner, you would be amazed at how much work it is in C to handle all the possible error conditions.", "In Python, you can use the exception handling to easily handle the errors.", "It really is better."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["And finally, in the unlikely event that your application works well but is too slow in Python, you can pretty easily write a C \"module\" that will replace the performance-critical part of your Python application.", "Get a working prototype, figure out the part that must be fast, and just replace that part with C.  A lot less work than doing the whole thing in C."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["At the moment I write C as my day job and I write Python for fun.", "I can get a lot done in a few lines of Python.", "You will find it easier to learn with Python, you will get more done, you will have fewer bugs, and you will enjoy it more."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I suggest starting with the book Learning Python."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Learning Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.rmi.net/~lutz/about-lp.html"}]}, {"text": ["Good luck, and have fun!"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["I would recommend starting with Python, unless you absolutely need the speed.", "It's often said that programming languages are just tools in your toolbox, and certain ones are going to be able to accomplish a given task better than others.", "If you don't need the speed, Python is going to accomplish the task you're looking to accomplish with less code and will be easier to learn."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I am entirely self-taught and went from Apple II BASIC to assembly language to scripting languages (Perl, PHP, Ruby) and now am using mostly C.  C is a relatively small language, but I believe that had I started out with C, I probably would've lost my motivation.", "Start out with Python - you'll learn the gist of programming, then if you have the need or the want to learn C later, it will be easier to pick up."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]