[[{"text": ["cron will absolutely  run the script again.", "You need to think this through a little more carefully than just \"sleep\" and \"email every 10 minutes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You need to write out your use cases."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["How does the user register that something was done?", "How will they cancel or stop this cycle of messages?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["What if something is found in the log, an email is sent and then (before the sleep finishes) the thing is found again in the log.", "Is that a second email?", "It is two incidents.", "Or is that one email with two incidents?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["When your scripts sends email, make it also create a txt file \"email_sent.txt\".", "Then make it check for existence of this txt file before sending email.", "If it exists, don't send email.", "If it does not exist, send email and create the text file."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The text files serves as an indicator that email has already been sent and it does not need to be sent again."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You are running it every five minutes.", "Why would you sleep it?", "Just exit.", "If you want to make sure it doesn't send email every five minutes, then make the program only send an email if there is anything to send. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you sleep it for an hour, and run it every five minutes, after an hour you'll have 12 copies running (and twelve emails sent) so that's clearly not the way to go forward.", ":-)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["@Lennart, @S. Lott: I think the question was somewhat the other way around - the script runs as a cron job every five minutes, but after sending an error-email it shouldn't send another for at least an hour (even if the error state persists)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The obvious answer, I think, is to save a self-log - for each problem detected, an id and a timestamp for the last time an email was sent.", "When a problem is detected, check the self-log; if the last email for this problem-id was less than an hour ago, don't send the email.", "Then your program can exit normally until called again by cron."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Another way to go about this might be to run your script as a daemon and, instead of having cron run it every five minutes, put your logic in a loop.", "Something like this..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n while True:\n  # The check_my_logfile() looks for what you want.\n  # If it finds what you're looking for, it sends\n  # an email and returns True.\n  if check_my_logfile():\n    # Then you can sleep for 10 minutes.\n    time.sleep(600)\n  # Otherwise, you can sleep for 5 minutes.\n  else:\n    time.sleep(300)\n</code>\n</pre>\n", "senID": 1}], [{"text": ["Since you are monitoring a log file, It might be worth checking into things that already do log file monitoring.", "Logwatch is one, but there are log analyzing tools, that handle all of these things for you: "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://chuvakin.blogspot.com/2010/09/on-free-log-management-tools.html"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://chuvakin.blogspot.com/2010/09/on-free-log-management-tools.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://chuvakin.blogspot.com/2010/09/on-free-log-management-tools.html"}]}, {"text": ["Is a good wrap-up of some options.", "They would handle yelling at people.", "Also there are system monitoring tools such as opennms or nagios, etc.", "They also do these things."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I agree with what other people have said above, basically cron ALWAYS runs the job at the specified time, there is a tool called at which lets you run jobs in the future, so you could batch a job for 5 minutes, and then at runtime decide, when do I need to run again, and submit a job to at for whatever time you need it to run again (be it 5 minutes, 10 minutes or an hour).", "You'd still need to keep state somewhere (like what @infrared said) that would figure out what got sent when, and if you should care some more."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I'd still suggest using a system monitoring tool, which would easily grow and scale and handles people being able to say 'I'm working on XX NOW stop yelling at me' for instance."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Good luck!"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]]