[[{"text": ["Not so long ago, I decided to explore away from the JVM.", "I set foot on python, and even though i'm nowhere near the expert/ guru level, I dont regret it.", "Didn't choose C# (considered it) because I consider it to be more of the same.", "I alredy know (and like a lot) C++, so python seemed like something new, which is what I was looking for."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It fullfils many of your requirements.", "Particularly, i'm decided not to learn PHP, so the web frameworks in python came in great."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Not to mention, Python has a large community (also see here), always eager to help and teach, which I consider to be very important."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "community", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/community/"}, {"href": "http://www.pycon.org/", "text": "here", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Just my two cents."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Might be worth loking at the other JVM languages - Clojure and Scala are the two I personally think are most promising."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Yes you are on the JVM, but you're pretty independent from Java the langauage and don't have to use any Sun/Oracle implementations if you don't want to."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Having said that - I think that you are worrying a little too much about Java, too many players (including Oracle!", ") have too much invested to let it go too far off course."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Try Scala.", "It looks extremely elegant and promising.", "Being object oriented and sharing a lot with java in a very concise manner."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Scala", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.scala-lang.org/"}]}], [{"text": ["Everything you said points to C#, except for the Open Source point."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To fix that, there's Mono."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Mono", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.mono-project.com/Main_Page"}]}], [{"text": ["You could try D.  My one-sentence description of why it's an awesome language is that its generic programming/compile-time introspection/template metaprogramming facilities are good enough to give you almost flexibility of a duck-typed language, while its execution speed and static type checking rival or exceed C++ and C#."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I think it meets your requirements quite well."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 7, "lis": [{"text": "Open source:  The frontend to the reference DMD implementation is open source (the back end isn't due to restrictions beyond the author's control).  Work is underway to glue the reference frontend to open source backends such as LLVM (LDC) and GCC (GDC).  In the case of D1 (the older version of the language) the LLVM port is fairly mature.", "tag": "none", "senID": 2}, {"text": "Compiled:  D is meant to be compiled to native machine code, i.e. raw, inscrutable hexadecimal numbers.", "tag": "none", "senID": 3}, {"text": "Cross-platform:  The reference DMD compiler supports x86 Windows, Linux, Mac OS X and FreeBSD.  GDC and LDC will likely support a lot more CPU architectures.", "tag": "none", "senID": 4}, {"text": "Object oriented:  D isn't a \"pure\" OO language in the Ruby sense of everything being an object, or in the Java sense of not supporting any other paradigm.  It does, however, fully support Java-style OO as a subset of the language, along with procedural and functional style programming.", "tag": "none", "senID": 5}, {"text": "Large standard library:  D1 has Tango, which qualifies.  D2 has Phobos, which is not \"large\" yet by modern standards but is larger than C or C++'s standard lib.  However, recently there has been a large interest in contributing and Andrei Alexandrescu (its main designer) has accepted several new contributors, including myself.", "tag": "none", "senID": 6}, {"text": "Extensive documentation:  The standard library and language are reasonably well documented at the Digital Mars website.  There's also Andrei Alexandrescu's book ", "tag": "none", "senID": 7}, {"text": "Web development:   This is an admitted weakness.  D doesn't (yet) have a good web framework, though its native unicode support and excellent generic programming support should make writing one relatively easy.", "tag": "none", "senID": 8}]}], [{"text": ["I too would like another Java-like technology to come along.", "Lately I've been doing Flex/Actionscript.", "While I really enjoy it, Actionscript technology seriously lacks the elegance that Java has.", "Adobe can write some good cross platform APIs, but they just don't have the head capital to build elegant languages and compilers.", "I've also tried Ruby, but the VM for Ruby is really bad.", "I've gone back to Java after my flirtation with other technologies and I think it's because the language is good enough, but the JVM is by far the best out there."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So do you want to stay with the JVM or do you really want to the leave the JVM altogether?", "Staying on the JVM there are lots of options: JRuby, Scala, Groovy, Javascript, Clojure are the big players.", "However, there are tons of great languages that can take advantage of the JVM's features."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Leaving the JVM there are still good options like python, ruby, and erlang.", "But you give up some of the nice features of the JVM like performance (big one), and the ability to drop down to a nice language like Java if you need speed.", "Those others mean using C or nothing at all."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I finally stopped worrying about Java's future.", "Sun did all it could to screw it up and it still turned out pretty darn good.", "I think Opensource has a lot more influence over Java's success than Oracle or Sun could ever have had."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I can't post comments yet, so I'm posting an answer related to the Python discussion.", "Though Python isn't compiled to machine code, there is a Python-to-C compiler called Cython, which can compile nearly all valid Python -- closures are finally (!", ") in the latest development release.", "It's have a big impact on some parts of the Python commmunity, e.g., I was at Euroscipy recently, and over half the talks mentioned Cython. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Cython", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://cython.org"}]}], [{"text": ["I personally don't like PHP, but it does meet all of your requirements.", "It doesn't officially support compilation but there is the Hip Hop project which compiles PHP to C code.", "Facebook is currently heading up this project."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Hip Hop", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://wiki.github.com/facebook/hiphop-php/"}]}, {"text": ["That said, I highly discourage you from using it :)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["C# is the only thing that will meet your needs and not feel hopelessly archaic, or frustrate with limited library.", "For open source/non-windows, use mono.", "It's a good, mature implementation of most of what's important in the CLR. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Some things (WPF, WCF, etc) are \"missing\" from mono, but these aren't so much part of the platform as they are windows-specific proprietary toolkits.", "Some of them are being implemented slowly in mono, some aren't.", "Coming from java you won't miss them because you're looking for a platform and good standard libraries to build upon, not a gui toolkit or whiz-bang communication framework."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As far as a platform to build stuff with that's \"like\" java and offers similar levels of functionality, C# + CLR is the clearest option."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Using also Cython you get the best of the two worlds , the ability to code in python , the ability to code in C and C++ and of course compile your code and the ability to use both python a c/c++ libraries out of the box.", "And if you dont like C++ syntax , cython syntax is python syntax and more. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["link text"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "link text", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cython.org/"}]}]]