[[{"text": ["Crytographic Libraries are mostly numeric calculations and I don't know why py3k versions are not available yet."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Please use them with caution as they just development programs implemented following the algorithm text.", "(That is, I am not sure of the rigor in the original python2 version).", "Also, all of them are pure python libraries, they would be slower than anything written using C-extensions ( and perhaps that is the reason, why py3k versions are getting delayed)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Although Python 3 itself is ready for primetime, the lack of libraries that support it is a hindrance.", "The best you can do is of course to help port PyCrypto to Python 3, although as it has a lot of C-extension modules that is probably not entirely trivial, and will be a couple of days work, I would think.", "Maybe the current maintainer is interested in porting or already half-way there, you should contact him and ask."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There is an rsa module written in Python which looks to have fairly clean and easily portable code, but for aes it seems like PyCrypto is the module to use.", "So it is probably easier to make your software run under Python 2 instead. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I'm not aware of any reasonable crypto library for python (regardless of the version).", "Everything I'm aware of (including pycrypto) is just a toy.", "If you want to implement a serious application then you should look for a wrapper to a real library such as m2crypto.", "Pycrypto itself does follow many standards.", "Especially, RSA needs a good padding scheme to be secure.", "Since pycrypto is at least currently not using\na padding, this makes its RSA implementation both rather insecure and incompatible with other crypto libraries."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Answer to Martins question: Obviously this question is open to a lot of opinions.", "One proposal would be to use Java instead of python.", "Java has a well defined cryptographic interface, and there are different providers that implement the interface.", "This has the rather big advantage, that one can implement a solution independent of the provider, so that one can easily switch between different providers.", "I personally like openssl, but I'm aware that it is rather difficult to use."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Here is a Python3 library for cryptography research from Johns Hopkins.", "It supports elliptic curve operations and pairing based crypto. "], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "library", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://code.google.com/p/charm-crypto/"}, {"text": "research", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://mdgreen98.github.com/charm/"}]}], [{"text": ["PyCrypto 2.4.1 and later now work on Python 3.x."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["pycrypto has Py3k branch (in https://github.com/dlitz/pycrypto/tree/py3k)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "https://github.com/dlitz/pycrypto/tree/py3k", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://github.com/dlitz/pycrypto/tree/py3k"}]}], [{"text": ["My Python wrapper around LibTomCrypt now supports Python 3, and it has both AES and RSA."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["See: https://github.com/mikeboers/PyTomCrypt#readme"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "https://github.com/mikeboers/PyTomCrypt#readme", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "https://github.com/mikeboers/PyTomCrypt#readme"}]}]]