[[{"text": ["The subprocess module is the preferred way of running other programs from Python -- much more flexible and nicer to use than os.system. "], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "subprocess", "tag": "a", "pos": 0, "childList": [{"text": "subprocess", "tag": "code"}], "childNum": 1, "href": "http://docs.python.org/library/subprocess.html"}, {"text": "subprocess", "childNum": 0, "tag": "code", "childList": []}, {"text": "os.system", "childNum": 0, "tag": "code", "childList": []}]}], [{"text": ["Perhaps you'll find this Python command-line tutorial useful."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python command-line tutorial", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.dalkescientific.com/writings/diary/archive/2005/04/12/wrapping_command_line_programs.html"}]}], [{"text": ["\"This whole setup seems a little unstable to me."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Talk to the ffmpegx folks about having a GUI front-end over a command-line backend.", "It doesn't seem to bother them.  "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "ffmpegx", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://homepage.mac.com/major4/"}]}, {"text": ["Indeed, I submit that a GUI (or web) front-end over a command-line backend is actually more stable, since you have a very, very clean interface between GUI and command.", "The command can evolve at a different pace from the web, as long as the command-line options are compatible, you have no possibility of breakage."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I am not familiar with sox, but instead of making repeated calls to the program as a command line, is it possible to set it up as a service and connect to it for requests?", "You can take a look at the connection interface such as sqlite for inspiration.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "sqlite", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/sqlite3.html#sqlite3.Connection"}]}], [{"text": ["To me this seems to mean that he fears that, if he opens up his webserver to the public, that there's not a lot he can do to prevent his server resources from being consumed if 15.000 people decide to click on that button that will launch sox in this way."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you're concerned about server performance then look at capping the number of running sox processes.", "If the cap has been hit you can always cache the request and inform the user when it's finished in whichever way suits your application."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Alternatively, have the n worker scripts on other machines that pull requests from the db and call sox, and then push the resulting output file to where it needs to be."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]