[[{"text": ["Not so much.", "Major, modern CMS systems are incredibly complex beasts.", "A typical page isn't merely body text and a title, but also dynamic category-based content queries that aggregate info across many site areas; not to mention security trimming and user-specific content zones.", "For example, loading http://www.volvogroup.com involves at least 7 of these queries, plus recursion through the site structure to generate navigation, and connecting to external systems to pull in news and investor relations data.", "Considering that, it shouldn't be such a surprise that it takes a beefy server farm to serve up several hundred hits per second."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.volvogroup.com", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.volvogroup.com"}]}], [{"text": ["Because it takes a alot of processing to do all of that.", "ITs not a matter of \"query, replace, render\".", "All of thes products are made to fit a wide range of use cases and to be extensible to some degree so really those 3 basic operations your are talking about are split up into many, many operations all of which consume time."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["All things being equal - the more flexible he system the slower it will be \"out of the box\"."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["They are relatively complex systems.", "They allow a lot of hooks for plugins, so there's a lot of steps in the workflow from request to response."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In the real world, however, caching (whether in-application or opcode caching) is a tremendous boost to performance."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I'm not familiar with Plone, but the PHP CMSs essentially have to load and interpret almost the entire system with every single request."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Please don't take offense to this, but to preface your question by explaining your unfamiliarity with web programming, and then criticize the performance of what appears to you to be a 'simple' operation is a bit short-sighted."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I would encourage you to learn a bit more about the common problems a CMS solves, and the general theory and practice of how dynamic web pages and HTTP work.", "It's far from a simple I/O operation. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Also, for practical use, I would highly encourage anyone running a CMS to find a caching solution.", "Caching is intended to solve a lot of the 'speed' problems that arise in web technology.", "It should be part of any common web stack."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["They are slow for a few reasons:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["1 - Most of them are very modular,that means more files, more code and more DB queries."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["2 - They largely (not wordpress so much) try to do everything, again designing a system for every possible situation makes it more complex and harder to tune."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["3 - Most of them (currently) support both PHP4 and PHP5, this is again just extra work."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["4 - They are allegedly made so non-technical users can use them, which means they often have to do things in a way that is not the most efficient, i.e.", "Drupals CCK / Views lets people that can't programme effectively create database tables and SQL  queries, the flaw being these tables / queries are very general in design and are rather inefficient in comparison to custom coded efforts."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["5 - They tend to use lots of DB queries, Drupal uses 40 or so for a very basic page and if you search their forums you will see reports of people claiming some pages make hundreds or even over a thousand queries."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["They do of course offer caching and Drupal can get quite good performance from things like its boost module, the flaw being one of Drupal's (and Joomla's) selling points is you can make a community site, forum, Digg like site in it, all sites where caching is of limited use..."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["In my opinion :"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Because CMS and frameworks think of all the things you need, that you can use:\nlike "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "Filter userinput", "tag": "none", "senID": 2}, {"text": "Create PDF,AJAX Output Template and alot more", "tag": "none", "senID": 3}]}, {"text": ["It Depends on your need, what you realy need"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Im not agree what you wrote"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["A CMS Does a lot more things alot more ... "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["And at last but not least dont compare Desktop Software Speed with Wep Aplication. "], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["There is a Big Difference"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["A CMS Does a lot more things alot more ..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And at last but not least dont compare Desktop Software Speed with Wep Aplication."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["There is a Big Difference"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]