[[{"text": ["I recently switched my mac mini to Linux because I couldn't stand developing in OS X.", "Not having the little things, like middle click to paste and focus follows mouse affected my productivity enough that I thought it was worth my while to spend a day installing Debian on the thing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["That said, I understand that many people can function quite well under OS X.", "In fact, some people dislike FFM and don't miss the middle click to paste or have my quirky window manager preferences.", "It's really all about the environment in which you work best.", "Think about how you work and what environment best facilitates that."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["With the advent of better Python packaging tools (pip, virtualenv, etc.", ") I think you'd be happy on the Mac.", "PyObjC, py2app and appscript provide nice integration with Mac specific services, and of course you've got the standard Unix stuff underneath.", "Apple has bundled current versions of Python for years (2.6.1 is in OS X 10.6) and some of their server software, e.g.", "Calendar Server, is written in Python.", "There are some pretty serious Mac apps written in Python, such as Checkout and EagleFiler."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Calendar Server", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://trac.calendarserver.org/"}, {"text": "Checkout", "tag": "a", "pos": 5, "childList": [], "childNum": 0, "href": "http://checkoutapp.com/"}, {"href": "http://c-command.com/eaglefiler/", "text": "EagleFiler", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Package management is not as mature on the Mac as Linux (particularly if you're used to Debian/Ubuntu) though it's more of a developer than a user issue.", "There's no standard system package manager as most Linux distributions use, but homebrew and MacPorts are pretty well-liked.", "Personally I am happy using the system Python and being a version behind, but you can get a current binary distribution from python.org which happily coexists with the system version, or use a package manager to install Python."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "homebrew", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://mxcl.github.com/homebrew/"}, {"text": "MacPorts", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.macports.org/"}]}, {"text": ["If you use complex Python packages with lots of dependencies, such as NumPy, pygame, etc., and don't want to compile all the dependencies from source, you generally have a choice between using a binary distribution with an existing Python (e.g.", "python.org) or a using a package manager, though at least with MacPorts that means installing a separate version of Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["And of course if you really need Linux for anything you can always run it in a VM or reboot into it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["This is a very subjective choice.", "Both Linux and Mac are fine platforms to develop on, be it Python or any other language with good POSIX support."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My choice is a Mac, with TextMate for my main editing environment.", "But my reasons have very little to do with Python; I like the It Just Works setup a Macbook gives me, and I can focus on my work instead of spending time tinkering with Linux, which I am very likely to do too much of."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I do almost all of my python development on a Mac (or rather several Macs) using Textmate.", "I have run into some difficulties installing various numerical/scientific packages (mostly due to dependency issues rather than something about python itself) and can attest to the fact that when I've tried to build the same modules/packages in Linux it was generally easier.", "If you can deal with some of Apple's quirky library setups, then in general the end-user experience is much better on the Mac IMHO."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The OS you use to develop on is just more of a \"conveinience\".", "I have developed software using python and many other languages for several different OSs.", "It really just depends on what features you want in the OS.", "As @nmicheals said, there are little features you might miss when you switch to a different OS.", "I use Windows as my primary, a Linux distro as my secondary and a port of Mac as my final option."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["At the end of the day what really matters is that you know the language.", "However knowing the language and being productive are two different things.", "In order to be productive, I need my environment, which consists of many factors.", "I want Vim with the syntax highlighting I prefer.", "I want my operating system with the shortcuts I have configured.", "I want my desk and my chair.", "I want the keyboard that I'm used to type with."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For me, yes everything matters.", "It's a matter of having a tool and being comfortable to use it to its maximum potential.", "Whether it's OSX or Linux, it doesn't really matter.", "Set it up as you like it, and get down to business."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You might like Wing, it's an IDE that works in both Mac and Linux.", "I use Wing on a Mac and have Parallels with Ubuntu on my Mac as well.", "I do like the fact that my projects 'look the same' and I have auto-completion on both Mac and Linux, though obviously that's an aesthetic choice. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Wing", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.wingware.com/"}]}, {"text": ["If you're just starting out the 'personal' version of Wing is more than adequate."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]