[[{"text": ["To enable code completion, go to Window > Preferences > Pydev > Editor > Code Completion, and check the 'Use Code Completion?", "' box, as well as the other boxes for what you want to complete on.", "It seems to take a second to load, the first time it has to complete something."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Syntax coloring should just work by default.", "Right-click on the file in the package explorer, go to 'Open With', and make sure you're opening it with the Python Editor, and not the regular Text Editor."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I don't know exactly what you mean by importing external modules.", "I have my source in a separate directory structure on disk; my PyDev projects contain folders linked to those.", "Code completion works for that, as well as other modules like 'os'.", "If you're having troubles, are the modules added to the PyDev's Python search path (not necessarily the same as the regular one)?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I took a brief look at Komodo and Wingware a while back, so I can't answer the second part of your question.", "But ended up going with PyDev.", "I'm not a big fan of Eclipse, but PyDev works reasonably well for me."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Well, I tried the Wing Professional and I think its really the best Py IDE out there."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Between komodo and wingide i would go for wing.", "The license is not that expensive and the fact that it is commercial gives you a bigger probability of more updates and bug fixes.", "If you, like me, prefer a free solution, then stick with pydev.", "At least until aptana closes the free door :)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["DNS, I have try:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python 3.1\nPydev 1.4.3\nEclipse 3.3.2"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The code completion doesn't work."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I use worong version or not?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Thanks."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Check to see if the 'P' icon is appearing for your items and in the top of your editor after opening it.", "If it's not appearing, it may be that there's a problem with the file association, so, go to window > preferences > general > editors > file associations and make sure that the .py files are associated with the Python Editor (note that because of an eclipse bug, if it seems correct, you may have to remove the association and add it again)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The typical reason that code completion doesn't work under PyDev is that the libraries aren't in the PYTHONPATH.", "If you go into the Preferences, and setup PyDev PYTHONPATH preferences to include the places where the code you are trying to complete lives, it will work just fine..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It sounds like you have to specify the location of the Python interpreter.", "Do this under Preferences > Pydev > Interpreter - Python.", "Create a new interpreter and point it to the Python interpreter executable."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]