[[{"text": ["Go For PyQt:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PyQt", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["http://www.riverbankcomputing.co.uk/software/pyqt/download"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.riverbankcomputing.co.uk/software/pyqt/download", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.riverbankcomputing.co.uk/software/pyqt/download"}]}, {"text": ["Download The Qt Developers tool to generate the gui automatically"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Qt Developers tool", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["www.qtsoftware.com/products/developer-tools"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["For schema validation try lxml"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "lxml", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["codespeak.net/lxml/validation.html"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["One solution could be to write an XSL transformation that converts the XML file into a XAML file."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If the GUI will be simple and you don't bother about the geometry of the components(widgets) in the dialogs, Qt will be a good option.", "Actually I'm working on a similar task for my project, and my goal was to validate the form data by using an XML file."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Using Qt, it is possible to access any widget on the dialog at run-time by using its object name.", "So that validation can be applied to the dialog contents."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Creating any dialogs will be even easier, since you will have the widget type and certain information and using layouts, fascinating results can be obtained."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Xopus offers an editor that will validate against your schema.", "EMC's Documentum xDB offers a client-side XForm engine."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It's worth taking a look at Jaxfront which is able to consume an XSD and generate a form (including HTML).", "You can also supply an instance XML document for it to load into the GUI, and save out instance XML documents too."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Jaxfront", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.jaxfront.org/"}]}, {"text": ["I tried it with one of our fairly complicated XSD's and it worked pretty well."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Sadly it's written in Java - I'm still looking for something which can generate .NET web forms or XAML/WPF!", "In fact even XFORMS would be good."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'm not exactly sure if I can be completely of help to you @Adrian, but I've been researching something very close to what you are discussing..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Using something like Linq to XML may assist you in the validation of the data being entered, as there are already methods that will validate the data for you."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As I recall, there are a few tools that allow you dynamically create the app... link"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "link", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.msdn.microsoft.com/dynamicWPF"}]}, {"text": ["Hope this helps."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Using XSL, like StackedCrooked said, where another target could be XForms, although that's more browser-oriented than desktop-oriented."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["There is an experimental tool, which does that, automatically create a desktop UI for handling data stored in XML.", "It's called KXForms.", "It comes as part of a suite of tools for handling XML data in various ways, like creating C++ code from an XML schema to represent the data natively in C++ and encapsulate parsing and writing."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "KXForms", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.lst.de/~cs/kode/kxforms.html"}]}, {"text": ["This might not be the production-ready solution you are looking for, but it's a start and a source for inspiration.", "It's open source, so contributions are certainly welcome."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["\"XAmple XML Editor project introduces a java Swing based XML editor that analyzes a given schema and then generates a document-specific graphical user interface.", "Unlike other XML editors, the XAmple XML editor GUI exposes not just a tree representation of the XML document but rather a logical combination of the XML document and respective XML Schema.", "The user interface of the XML editor is highly logical and intuitively comprehensible.", "To be able to prepare valid XML documents of significant complexity, a user is not required to be familiar with XML and XML Schema languages and to have any a-priori knowledge about the documents structural requirements."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "XAmple XML Editor", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.felixgolubov.com/XMLEditor/"}]}, {"text": ["I've tried it and even my non-technical boss likes it.", "You can use it as-is or use it as a library upon which to base your own Java-based UI."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]