[[{"text": ["First, this is all a lot to work with in a week.", "But here it goes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Tools for the backend:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Tools in building the frontend:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you already plan on using Django for the backend, I'd recommend using it for the frontend as well."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Things about which you are uncertain:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I'm guessing that you wouldn't be allowed to use an ORM, since you call this a \"MySQL project\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If this is an incorrect assumption, I'd agree with N Arnold's recommendation of using Django.", "Rather than using SQLAlchemy, I think you'd find that Django's ORM is good enough (especially if you use v1.1rc or trunk)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Like some of the comments to your initial question, this does seem like a large amount of work if you have to learn a framework as well as produce a project in it.", "On the other hand, someone who knew Django could crack out the base of such a project in a day or two."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Use the django Model to create the Object-Relational Mapping (ORM) that injects and retrieve your data. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For login/logout, django has an AuthenticationMiddleware feature you can probably use, although I am not sure if you can solve your problem with it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In any case, your project, with the given deadlines is totally unrealistic.", "Be prepared to miss the deadline, and hear the whooshing sound they do as they fly by."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You can build your database with MySQL, go read the official docs.", "It really doesn't matter what language you use to program a front-end whether it be a website, command line interface, gui interface, most languages handle this pretty well but it seems you're set on building a web application and this can be achieved very easily with Django, which is a Python web framework."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "official docs", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://dev.mysql.com/doc/"}, {"text": "Django", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}]}, {"text": ["Doing what I've told you, if you keep at it you'll be done in under 16 hours.", "Good luck.", "Btw.", "your project seems to focus on a lot of irrelevant things.", "You're creating a database application, unless you already know CSS and JQuery, why don't you just create it in simple unstyled XHTML; that way you have less work to do!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Django can use many different database backends one of which is MySQL, to help support this it provides an ORM (Object Relational Mapping) layer which abstracts away the SQL code and storage medium and allows you to write Models containing storage fields and logic as necessary without worrying about how they are stored in the persistence layer."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Django also contains basic authentication (login/logout) functionality and has the concept of users and admin-users built into it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As an example using the built in user models and the ORM would allow you to get all questions asked by a user with something like the following code:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"code": "<pre>\n<code>\n Question.objects.all.filter(asker=request.user)\n</code>\n</pre>\n", "senID": 3}, {"text": ["Where Questions is the model you have defined to hold your questions (with a field called 'asker' which is a foreign key to the user) and the request.user is the user logged into the website."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["I suggest you read up on the Django ORM."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Django ORM", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.djangoproject.com/en/dev/"}]}, {"text": ["As far as hosting it, you could use Ubuntu on a desktop computer, or if you need an external  host then would recommend Webfaction or Djangohosting.ch as two of the most 'Django Friendly' Hosts."], "childNum": 2, "tag": "p", "senID": 6, "childList": [{"text": "Webfaction", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://webfaction.com"}, {"href": "http://Djangohosting.ch", "text": "Djangohosting.ch", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["I think this can all be accomplished in django.", "See the official tutorial."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "official tutorial", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.djangoproject.com/en/dev/intro/tutorial01/"}]}], [{"text": ["Ehh, what is the purpose of this development?", "To build a real production-ready system, or to pass an exam by building a mini-project that will never see real use?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If your purpose is to pass an exam, then build what your teachers like to see.", "Take you cues from the material they have been using in classes, and also ask them outright what they think is good."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you want to build a production system, then Django would be a great choice.", "Respectfully however, given the limited understanding of Django you demonstrate, you will most likely not complete the project in time."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Django has pre-existing functionality for:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "Building the database schema. The DB tables will be buildt when you define your model classes in Django and run manage.py syncdb.", "tag": "none", "senID": 4}, {"text": "A login system. Django has a login system with cookies etc build into it; and several 3rd party Django addons extend this system.", "tag": "none", "senID": 5}, {"text": "Encrypting passwords in the database, Django uses SHA-1 with a salt if memory serves.", "tag": "none", "senID": 6}]}, {"text": ["Thus your teachers could legitimately say that you haven't demonstrated your own skills at modeling a DB schema, you have just used Djangos pre-existing functionality.", "Will they be OK with this, or will they fail you on this exam?"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["If you need to demonstrate understanding of the core concepts, perhaps you would be better off by staying with a system you know well already, instead of mixing in Django as another complexity, another thing you'll need to learn in very little time..."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["About Moderators and Users"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "About Moderators and Users", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["What is the difference between moderators and users?", "Moderators can modify text, but how?", "Are they planning you to practise permissions, fs or some open-source system to differentiate users from moderators? "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Very odd that they do not allow Google products, but they allow open-source.", "Interestingly, USFCA encourages Google products in similar projects.", "Perhaps, there are some users, who could help you with userspaces."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "USFCA", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.cs.usfca.edu/courses/cs682/assignments/lab-5.html"}]}, {"text": ["Good luck!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["They give us only this example of the web app.", "The code is not useful for me, since the code is in Finnish and it is written in PHP.", "It is also not open-source such that I cannot paste the code here."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "this example", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://db.cs.helsinki.fi/~laine/php/lahja2.txt"}, {"text": "web app", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://db.cs.helsinki.fi/~laine/php/lahjax.php"}]}, {"text": ["I would like to see similar examples in Python.", "Please, put links to the comments.   "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]