[[{"text": ["You probably do need a full relational DBMS, if not right now, very soon.", "If you start now while your problems and data are simple and straightforward then when they become complex and difficult you will have plenty of experience with at least one DBMS to help you.", "You probably don't need MySQL on all desktops, you might install it on a server for example and feed data out over your network, but you perhaps need to provide more information about your requirements, toolset and equipment to get better suggestions."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And, while the other DBMSes have their strengths and weaknesses too, there's nothing wrong with MySQL for large and complex databases.", "I don't know enough about SQLite to comment knowledgeably about it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["EDIT: @Eric from your comments to my answer and the other answers I form even more strongly the view that it is time you moved to a database.", "I'm not surprised that trying to do database operations on a 900MB Python dictionary is slow.", "I think you have to first convince yourself, then your management, that you have reached the limits of what your current toolset can cope with, and that future developments are threatened unless you rethink matters."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If your network really can't support a server-based database than (a) you really need to make your network robust, reliable and performant enough for such a purpose, but (b) if that is not an option, or not an early option, you should be thinking along the lines of a central database server passing out digests/extracts/reports to other users, rather than simultaneous, full RDBMS working in a client-server configuration."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The problems you are currently experiencing are problems of not having the right tools for the job.", "They are only going to get worse.", "I wish I could suggest a magic way in which this is not the case, but I can't and I don't think anyone else will."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Quick Summary"], "childNum": 0, "tag": "h2", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "You need enough memory(RAM) to solve your problem efficiently. I think you should upgrade memory?? When reading the excellent ", "tag": "none", "senID": 1}, {"text": "You do need a central database solution. I don't think hand doing this with python dictionary's only will get the job done.", "tag": "none", "senID": 2}, {"text": "How to solve \"your problem\" depends on your \"query's\". What I would try to do first is put your data in elastic-search(see below) and query the database(see how it performs). I think this is the easiest way to tackle your problem. But as you can read below there are a lot of ways to tackle your problem.", "tag": "none", "senID": 3}]}, {"text": ["We know:"], "childNum": 0, "tag": "h2", "senID": 4, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "You used python as your program language.", "tag": "none", "senID": 5}, {"text": "Your database is ~900MB (I think that's pretty large, but absolute manageable).", "tag": "none", "senID": 6}, {"text": "You have loaded all the data in a python dictionary. Here I am assume the problem lays. Python tries to store the dictionary(also python dictionary's aren't the most memory friendly) in your memory, but you don't have enough memory(", "tag": "none", "senID": 7}]}, {"text": ["Missing information"], "childNum": 0, "tag": "h2", "senID": 8, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "Do you have a central server. You should use/have a server.", "tag": "none", "senID": 9}, {"text": "What kind of architecture does your server have? Linux/Unix/Windows/Mac OSX? In my opinion your server should have linux/Unix/Mac OSX architecture.", "tag": "none", "senID": 10}, {"text": "How much memory does your server have?", "tag": "none", "senID": 11}, {"text": "Could you specify your data set(CSV) a little better.", "tag": "none", "senID": 12}, {"text": "What kind of data mining are you doing? Do you need full-text-search capabilities? I am not assuming you are doing any complicated (SQL) query's. Performing that task with only python dictionary's will be a complicated problem. Could you formalize the query's that you would like to perform? For example:\n", "tag": "none", "senID": 13}]}, {"text": ["Database needed"], "childNum": 0, "tag": "h2", "senID": 14, "childList": []}, {"text": ["You are sure right that you need a database to solve your problem.", "Doing that yourself only using python dictionary's is difficult.", "Especially when your problem set can't fit in memory."], "childNum": 0, "tag": "p", "senID": 15, "childList": []}, {"text": ["MySQL"], "childNum": 0, "tag": "h2", "senID": 16, "childList": []}, {"text": ["A centralized(Client-server architecture) database is exactly what you need to solve your problem.", "Let all the users access the database from 1 PC which you manage.", "You can use MySQL to solve your problem."], "childNum": 1, "tag": "p", "senID": 17, "childList": [{"text": "You can use MySQL to solve your problem", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}, {"text": ["Tokyo Tyrant"], "childNum": 0, "tag": "h2", "senID": 18, "childList": []}, {"text": ["You could also use Tokyo Tyrant to store all your data.", "Tokyo Tyrant is pretty fast and it does not have to be stored in RAM.", "It handles getting data a more efficient(instead of using python dictionary's).", "However if your problem can completely fit in Memory I think you should have look at Redis(below)."], "childNum": 1, "tag": "p", "senID": 19, "childList": [{"text": "Tokyo Tyrant", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://petewarden.typepad.com/searchbrowser/2009/03/tokyo-tyrant-tutorial.html"}]}, {"text": ["Redis:"], "childNum": 0, "tag": "h2", "senID": 20, "childList": []}, {"text": ["You could for example use Redis(quick start in 5 minutes)(Redis is extremely fast) to store all sales in memory.", "Redis is extremely powerful and can do this kind of queries insanely fast.", "The only problem with Redis is that it has to fit completely in RAM, but I believe he is working on that(nightly build already supports it).", "Also like I already said previously solving your problem set completely from memory is how big sites solve there problem in a timely manner."], "childNum": 2, "tag": "p", "senID": 21, "childList": [{"text": "Redis(quick start in 5 minutes)", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/redis/wiki/QuickStart"}, {"text": "RAM", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://antirez.com/m/p.php?i=203"}]}, {"text": ["Document stores"], "childNum": 0, "tag": "h2", "senID": 22, "childList": []}, {"text": ["This article tries to evaluate kv-stores with document stores like couchdb/riak/mongodb.", "These stores are better capable of searching(a little slower then KV stores), but aren't good at full-text-search."], "childNum": 1, "tag": "p", "senID": 23, "childList": [{"text": "article", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://bcbio.wordpress.com/2009/05/10/evaluating-key-value-and-document-stores-for-short-read-data/"}]}, {"text": ["Full-text-search"], "childNum": 0, "tag": "h2", "senID": 24, "childList": []}, {"text": ["If you want to do full-text-search queries you could like at: "], "childNum": 0, "tag": "p", "senID": 25, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["elasticsearch(videos)"], "childNum": 0, "tag": "a", "senID": 26, "childList": []}, {"text": ["solr(tutorial)"], "childNum": 0, "tag": "a", "senID": 27, "childList": []}]}], [{"text": ["Here is a performance benchmark of different database suits ->\nDatabase Speed Comparison"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Database Speed Comparison", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.sqlite.org/cvstrac/wiki?p=SpeedComparison"}]}, {"text": ["I'm not sure how objective the above comparison is though, seeing as it's hosted on sqlite.org.", "Sqlite only seems to be a bit slower when dropping tables, otherwise you shouldn't have any problems using it.", "Both sqlite and mysql seem to have their own strengths and weaknesses, in some tests the one is faster then the other, in other tests, the reverse is true."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "sqlite.org", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.sqlite.org"}, {"text": "Sqlite only seems to be a bit slower when dropping tables, otherwise you shouldn't have any problems using it.", "childNum": 0, "tag": "strike", "pos": 1, "childList": []}]}, {"text": ["If you've been experiencing lower then expected performance, perhaps it is not sqlite that is the causing this, have you done any profiling or otherwise to make sure nothing else is causing your program to misbehave?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["EDIT: Updated with a link to a slightly more recent speed comparison."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Have you done any bench marking to confirm that it is the text files that are slowing you down?", "If you haven't, there's a good chance that tweaking some other part of the code will speed things up so that it's fast enough."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It sounds like each department has their own feudal database, and this implies a lot of unnecessary redundancy and inefficiency."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Instead of transferring hundreds of megabytes to everyone across your network, why not keep your data in MySQL and have the departments upload their data to the database, where it can be normalized and accessible by everyone?"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "their", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["As your organization grows, having completely different departmental databases that are unaware of each other, and contain potentially redundant or conflicting data, is going to become very painful."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Does the machine this process runs on have sufficient memory and bandwidth to handle this efficiently?", "Putting MySQL on a slow machine and recoding the tool to use MySQL rather than text files could potentially be far more costly than simply adding memory or upgrading the machine."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you have that problem with a CSV file, maybe you can just pickle the dictionary and generate a pickle \"binary\" file with pickle.HIGHEST_PROTOCOL option.", "It can be faster to read and you get a smaller file.", "You can load the CSV file once and then generate the pickled file, allowing faster load in next accesses."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pickle.HIGHEST_PROTOCOL", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["Anyway, with 900 Mb of information, you're going to deal with some time loading it in memory.", "Another approach is not loading it on one step on memory, but load only the information when needed, maybe making different files by date, or any other category (company, type, etc..)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Take a look at mongodb."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It has been a couple of months since I posted this question and I wanted to let you all know how I solved this problem.", "I am using Berkeley DB with the module bsddb instead loading all the data in a Python dictionary.", "I am not fully happy, but my users are.", "My next step is trying to get a shared server with redis, but unless users starts complaining about speed, I doubt I will get it.", "Many thanks everybody who helped here, and I hope this question and answers are useful to somebody else."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]