[[{"text": ["No, SICP wouldn't be the right place.", "It may mention them, but the best reference on this is Introduction to Algorithms which you may hear referred to as \"CLR\", though I guess now it's CLRS.", "No working code in this, just a pascal-like pseudocode."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Introduction to Algorithms", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0262032937"}]}], [{"text": ["If you want a crash course in Dynamic Programming, try Project Euler...", "Problems 208 and 215 spring to mind as requiring DP.", "If you get hooked to it as most of us do, you'll find yourself learning more mathematics, algorithms and advanced programming than any formal course could provide you, and even better, having fun along the way.", "The best part is, once you solve a problem, you have access to other people solutions, and reading through them is extremly instructive."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Project Euler", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://projecteuler.net/"}, {"text": "208", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://projecteuler.net/index.php?section=problems&id=208"}, {"text": "215", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://projecteuler.net/index.php?section=problems&id=215"}]}, {"text": ["And then of course you have wikipedia..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Another resource you can look at is Algorithms by S. Dasgupta, C.H.", "Papadimitriou, and U.V.", "Vazirani."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Algorithms", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["It is a relatively recent book, and hence not one of the 'classics', but it is a good job of teaching algorithms from the ground up.", "The last few chapters look at \"Dynamic Programming\", \"Linear programming and reductions\", \"NP-complete Search Problems\" and \"Coping with NP-completeness\" - so exactly what you want.", "The code annotations are in pseudo-code, and are all cleanly reimplemented."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The primary advantage of this book is the authors distribute it's penultimate draft free on their site.", "I'm a new user and can't post hyperlinks, but google \"algorithms vazirani\" and it's the first and second link."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["In regards to looking for working code \"preferably in Python\", I think that's the wrong approach, especially in algorithms.", "Implementing the algorithms yourself is a vital step in both learning the algorithm and feeling comfortable with the language.", "If you haven't yet worked out how the algorithm works, it's far better to actually look at the algorithm's steps rather than trying to find the algorithm's steps in the program's implementations."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["After you learn these algorithms and techniques a great deal of the TopCoder problems can be sorted into a few sets, each expanding off of one idea or another.", "Once you're done with a more theoretical approach, you could move on to something like Programming Challenges by Steven S. Skiena and Miguel Revilla.", "It has a far briefer look at the algorithms themselves, instead focusing more on what sorts of competition problems can be solved by which of the standard algorithms.", "Almost always the solution to competition problems are re-imaginings or extensions of the original algorithms."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Programming Challenges", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}], [{"text": ["If you don't restrict yourself to code only, the primary reference for NP is Garey and Johnson's Computers and Intractability: A Guide to the Theory of NP-Completeness"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.amazon.com/Computers-Intractability-NP-Completeness-Mathematical-Sciences/dp/0716710455"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.amazon.com/Computers-Intractability-NP-Completeness-Mathematical-Sciences/dp/0716710455", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0716710455"}]}], [{"text": ["Theoretical Side (P=NP?", ") : Introduction to the Theory of Computation, Sipser"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Introduction to the Theory of Computation, Sipser", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www-math.mit.edu/~sipser/book.html"}]}, {"text": ["Algorithmic Side (Dynamic Programming et al.", "): Introduction to Algrithms, Corment\nThis is not python specific, but you can't ignore this. "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Introduction to Algrithms, Corment", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://mitpress.mit.edu/catalog/item/default.asp?tid=8570&ttype=2"}]}], [{"text": ["Well, you've binded together some different topics:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So, if you want a decent coverage of those things, you have to invest your time in three different (and vast) topics."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Algorithm Design by Kleinberg and Tardos is a very well written book, but uses pseudo code."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Algorithm Design", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0321295358"}]}], [{"text": ["Take an algorithm first.", "Skim what is it it about, and try to understand how it works (your own implementation might help).", "To check if you understood the matter you can solve a problem related to the topic. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For example, given the dynamic programming approach you can easily find the description of the  dynamic programming for the longest common subsequence problem or some other dynamic programming algorithms."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "dynamic programming for the longest common subsequence problem", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Longest_common_subsequence_problem#Code_for_the_dynamic_programming_solution"}, {"href": "http://en.wikipedia.org/wiki/Dynamic_programming#Algorithms_that_use_dynamic_programming", "text": "dynamic programming algorithms", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Later on you can try some of problems (see at the problems classifier with dp keyword)\navailable to be solved and check by the online judge service (like Sphere Online Judge)."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "problems classifier", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://spoj.pl"}, {"href": "http://spoj.pl", "text": "Sphere Online Judge", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["I guess that if you are intrested in Dynamic Programming, you should look at Introduction to Algorithms."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But generally speaking, it is a technique in Optimization Theory/Operation Research areas.", "There are more techniques such as Linear Programming, Interger Linear Programming etc.", "If you are intrested in them, look for Introduction to Operation Research by H.Taha"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["If you're not afraid of C/C++/Pascal, Solve every USACO problem in a row.", "It is designed to prepare students for Informatics Olympiads, what should give you great understanding of the most popular algorithms, data structures.", "The solutions are secret until you solve the problem, however you can easily google them if you want."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "USACO", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://ace.delos.com/usacogate"}]}, {"text": ["An alternative for USACO is UVa Online Judge.", "It accepts java as well as C/C++/Pascal and has a larger and newer set of problems.", "The disadvantage of it that the material is structured worse than in USACO.", "Also, last time I checked, it was slower and did not give helpful responses if the submission was incorrect."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you like reading books instead solving stuff, you can try \"Algorithm Design Manual\", by S.Skiena, though examples there are basically in C. I like this book, because it also contains \"War stories\" - how algorithms are applied in real life, and a bunch of interview questions as well as basic maths required to understand the algorithms."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]