[[{"text": ["You can't stop the user from touching data.", "If they're running a program on their system, they can do whatever they want with the bits after you write them to disk.", "You can obfuscate the data in various ways, possibly even encrypting it, but they can still, eventually get to it if they're determined.", "If you want proof, look at the absolute failure of every copy protection/DRM system ever invented.", "There are solutions that are 'good enough' but, without knowing what problem you're actually trying to solve there's no good way to start providing realistic options."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["...and Pickle's great if you can trust your data.", "If you can be reasonably certain that your program wrote a file to disk and that malicious programs aren't actively targeting your application, it's safe.", "I'd never trust a pickle sent across the network, however - a pickle can potentially execute arbitrary commands during deserialization."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You can try to stop the program from running if it's been tampered with, for example by comparing its (md5) hash to a known good value.", "Check out the Chrome OS project for an example of a system which does roughly this."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "can", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["You can try to stop the user from understanding your program and data written to the disk, for example by encrypting it and hiding the decryption subroutine, or by obfuscating the source code."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "can", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["But you can't stop a determined user from destroying your program and its data or from interrupting it.", "Once your program is in the air, I think its memory segment is protected from access by other processes.", "This doesn't stop a user from decompiling and trying to make sense of your program before running it, though."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Security which aims to protect software from its owner is bound to rely on clever hacks.", "Remeber that your clever hacks are subject to circumvention by other clever hacks.", "Python was designed as an open language, so you might have better luck with other languages if you intend to design \"sneaky\" programs."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["If the user will be running your program on his machine you just can't hide the data."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The user running the program can access everything the program can, is just a matter of knowing where to look."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you are dealing with end-users then just encrypt the data and decrypt it at the last point before using it.", "Just keep in mind that, at some point, the data has to be decrypted on memory and then the user could see it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Maybe you should look at CouchDB?", "You basically store data in JSON as document.", "It works perfectly. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://code.google.com/p/couchdb-python/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://code.google.com/p/couchdb-python/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/couchdb-python/"}]}], [{"text": ["Do you mean within as in within memory, and not on disk?", "A really simple solution to storing data in memory and making it easily accessible throughout the program would be to make a python file containing a dictionary in your program's root directory."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["for example, py/storage.py would contain:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n data = {}\n</code>\n</pre>\n", "senID": 2}, {"text": ["Then you could write to it like so:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n import storage\nstorage.data['foo'] = 'bar'\n</code>\n</pre>\n", "senID": 4}, {"text": ["and then read the same value in another file like this:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n import storage\nfoo = storage.data['foo']\n</code>\n</pre>\n", "senID": 6}, {"text": ["The data in the storage module will be accessible to all other modules within the program, but will be erased when the program exits.", "The user will not be able to touch it without modifying the program.", "If you need something more database related, sqlite allows you to create databases in memory that only stay in memory as long as the program is running"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Have a quick look at this, and this.", "Those libraries may be of some help.", "I feel compelled to note that an experienced computer software engineer will probably find a way to circumnavigate whatever implemented method of data concealing by simply reading your source file, deconstruction of your compiled code, or even possibly a feasible brute-force decryption (I could be wrong)."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "this", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/zipfile.html"}, {"text": "this", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/crypto.html"}]}]]