[[{"text": ["VNC"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "VNC", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.tightvnc.com/"}]}, {"text": ["SSH"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "SSH", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.openssh.com/"}]}, {"text": ["Remote Desktop (Windows)"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Remote Desktop (Windows)", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.microsoft.com/windowsxp/using/mobility/getstarted/remoteintro.mspx"}]}], [{"text": ["You can write a WEB APPLICATION.", "The encryption part is solved by simple HTTPS usage.", "On the server side (your home computer with USB devices attached to it) you should use Python (since you're quite experienced with it) and a Python Web Framework you want (I.E.", "Django)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python", "childNum": 0, "tag": "strong", "pos": 2, "childList": []}]}], [{"text": ["While it is an interesting programming question, perhaps you should ask it on ServerFault instead?", "There you can probably get a lot of nice input on web-based administration / control tools."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "ServerFault", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://serverfault.com/"}]}], [{"text": ["Unless this is a \"for fun\" project for you, there are about a jillion things out there that already do this.", "And if you want to control a computer from a web browser, be prepared to require installing some kind of custom plugin - since browsers can't touch arbitrary files on the local filesystem, execute local applications, or do other things that are flagrant security risks."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I've been using VNC for over a decade - free and easy."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["http://en.wikipedia.org/wiki/Virtual_Network_Computing"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://en.wikipedia.org/wiki/Virtual_Network_Computing", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Virtual_Network_Computing"}]}], [{"text": ["Well, I think that java can work well, in fact you have to deal with system calls to manage usb devices and things like that (and as far as I know, PHP is not the best language to do this).", "Also shouldn't be so hard to create a basic server/client program, just use good encryption mechanism to not show commands around web."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I you are looking for solution you could use from any computer anywhere in the worls without the need to install any software on client pc, try logmein.com (http://secure.logmein.com)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It is free, reliable, works in any modern browser, you don't have to remmeber IPs and hope they won't change, ..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Or if this is a \"for fun project\" why not write a php script, open port 80 in your router so you can access you script from outside, possibly dynamically link some domain to your IP (http://www.dyndns.com/).", "In the script you would just login and then for example type the orders in textfield in some form in your script.", "Lets just say you want to do some command prompt stuf, so you will basically remotely construst a *.bat file for example.", "Then the script stores this a fromtheinternets.bat to a folder on your desktop that is being constantly monitored for changes.", "And when such a change is found you just activate the bat file.", "Insecure?", "Yes (It could be made secureER)\nFun to write?", "Definitely"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["PS: I am new here, hope it's not \"illegal\" to post link to actual services, instead of wiki lists.", "This is by no means and advertisement, I am just a happy user.", ":)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]