[[{"text": ["Nope, that is the only formula for the centroid of a collection of points.", "See Wikipedia: http://en.wikipedia.org/wiki/Centroid"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://en.wikipedia.org/wiki/Centroid", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Centroid"}]}], [{"text": ["You vaguely mention \"a way to get a more accurate centroid\".", "Maybe you're talking about a centroid that isn't affected by outliers.", "For example, the average household income in the USA is probably very high, because a small number of very rich people skew the average; they are the \"outliers\".", "For that reason, statisticians use the median instead.", "One way to obtain the median is to sort the values, then pick the value halfway down the list.\n"], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "average", "childNum": 0, "tag": "i", "pos": 2, "childList": []}, {"text": "very", "childNum": 0, "tag": "i", "pos": -1, "childList": []}, {"text": "median", "childNum": 0, "tag": "i", "pos": 3, "childList": []}]}, {"text": ["\nMaybe you're looking for something like this, but for 2D or 3D points.", "The problem is, in 2D and higher, you can't sort.", "There's no natural order.", "Nevertheless, there are ways to get rid of outliers.\n"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["\nOne way is to find the convex hull of the points.", "The convex hull has all the points on the \"outside\" of the set of points.", "If you do this, and throw out the points that are on the hull, you'll be throwing out the outliers, and the points that remain will give a more \"representative\" centroid.", "You can even repeat this process several times, and the result is kind like peeling an onion.", "In fact, it's called \"convex hull peeling\".\n"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "convex hull", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Convex_hull"}]}, {"senID": 3}], [{"text": ["you can use increase accuracy summation - Kahan summation - was that what you had in mind? "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Yes that is the correct formula."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you have a large number of points you can exploit the symmetry of the problem (be it cylindrical, spherical, mirror).", "Otherwise, you can borrow from statistics and average a random number of the points and just have a bit of error."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Potentially more efficient: if you're calculating this multiple times, you can speed this up quite a bit by keeping two standing variables  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n N  # number of points\nsums = dict(x=0,y=0,z=0)  # sums of the locations for each point\n</code>\n</pre>\n", "senID": 1}, {"text": ["then changing N and sums whenever points are created or destroyed.", "This changes things from O(N) to O(1) for calculations at the cost of more work every time a point is created, moves, or is destroyed.   "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You got it.", "What you are calculating is the centroid, or the mean vector."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["A \"more accurate centroid\" I believe centroid is defined the way you calculated it hence there can be no \"more accurate centroid\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]