[[{"text": ["I'd say definitely Python - you can use it in place of bash scripts to automate a lot of what you'll be doing daily.", "Java's too heavyweight for that kind of thing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Python has -- via the os module -- numerous direct Linux OS API's implemented.", "Java doesn't have as direct access to OS API's."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "os", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}], [{"text": ["Though this might be good to ask on http://superuser.com/ or http://serverfault.com/"], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "http://superuser.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://superuser.com/"}, {"href": "http://serverfault.com/", "text": "http://serverfault.com/", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["My own 2 cents are \"python\" and \"perl\", for use specifically as a sysadmin or networks person."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you are maintaining lots of legacy things, several scripts (bash, ksh, csh, tcsh) and \"awk\" and \"sed\" may come in handy, too."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["For system-administration, I'd definitely learn Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Java executes faster in general and I think it uses less memory, but for the most part a system administrator shouldn't be writing anything where those differences matter (most of the time your programs will be waiting for the hard drive)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python has the huge advantage that programs are really easy to write, and the more time you spend with Python, the more crazy things you learn about it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Here's an interesting comparision of the languages (fairly old, but I didn't see anything horrible in it)."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "an interesting comparision", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://twistedmatrix.com/users/glyph/rant/python-vs-java.html"}]}, {"text": ["Note that the Python code is much shorter and (once you learn Python) easier to read too."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["On the administrative side, you're likely to find Python (or perl) much more useful.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Most administrative tools and scripts that you'll want to be able to poke at will be written in it.", "Especially on Linux you have closer system access and many of its existing administrative tools are written in Python.", "Because of this, you're significantly more likely to run into a machine with just Python rather than one with Java installed."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I would choose Python but if you really need to use Java libraries for some reason I would suggest Groovy instead of Java.", "It looks a lot like Python, has all the benefits of Java ( and the drawbacks of deployment and .jar dependencies ).", "I use Python almost exclusively for system automation work, but if I need to do something that interacts with some Java library and a simple script is appropriate, I reach for Groovy."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Groovy", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://groovy.codehaus.org/"}, {"text": "It looks a lot like Python", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://groovy.codehaus.org/Differences+from+Python"}, {"text": "I reach for Groovy", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.vertigrated.com/blog/?s=groovy"}]}], [{"text": ["As a sysadmin, you probably won't have any reason to write Java apps.", "But you should definitely learn about Java containers, like Tomcat."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I don't know Python, but I've heard good things about it.", "Ruby is another scripting language that's worth considering.", "But before you get into those, you should make sure you know Bash, since there's already a huge number of existing Bash scripts on most Unix installations."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Definitely Python.", "Have a look at iterpipes to go out of the hell of bash exception handling."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "iterpipes", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://lateral.netmanagers.com.ar/weblog/posts/BB860.html"}]}], [{"text": ["Why not both?", "For me Python is the most useful, but knowing Java comes in handy a lot."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Definitely Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["From Java all you'll likely need is the ability to make some sense of Java stack traces, and then only to figure out why things are blowing up (e.g.", "what file or process is dead and needs restoring)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Unfortunately you'll also want to get comfortable the the ugly world of shell scripting (e.g.", "bash).", "Your job will involve various scripts written by others, needing diagnosis or adjustment, especially on Linux.", "And there's no reason not to be Linux/Mac ready, even if your world revolves around Windows."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]