[[{"text": ["Yes.", "No.", "Maybe.", "See also: Java and \"write once, run anywhere\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Filesystem layout, external utilities, anything you might do with things like dock icons, character encoding behaviors, these and more are areas you might run into some trouble."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Using Qt and Python, and strenuously avoiding anything that seems tied to Windows-specific libraries or behaviors whenever possible will make running the application on Mac and Linux much easier, but for any non-trivial application, the first time someone tries it, it will blow up in their face."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "will", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["But through careful choice of frameworks and libraries, making the application work cross-platform will be much more like bug fixing than traditional \"porting\"."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["As other posters mentioned, the key issue is making sure you never touch a different non-Qt non-cross-platform API.", "Or really even a different non-Qt crossplatform API, if you use Qt you kind of need to commit to it, it's a comprehensive framework and for the most part sticking with Qt is easier than going to anything else.", "There's some nice advantages as the basic primitives in your program will work the same way all over the place.", "(i.e.", "a QString in your networking code will be the same as a QString in your interface code.", ")  Portability-wise, if you stay within the API Qt provides you, it should work on multiple platforms."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There will be areas where you may need to call some Qt functions which provide specific cross-platform tweaks more important to some platforms than others (e.g.", "dock icons) and you won't immediately have a polished application on all three platforms.", "But in general, you should remain very close to an application that compiles and runs on all three.", "(Try to use qmake or a similar build system too, as the build process for Qt applications varies depending on the platform.", "Different flags, etc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["There's some odd issues that come up when you mix Qt with other APIs like OpenGL, in particular the way windows locks GL contexts differs from the way OS X and Linux does, so if you intend to use OpenGL with multiple threads, try to periodically compile on the other platforms to make sure nothing is completely busted.", "This will also quickly point out areas where you might have inadvertently used a non-cross-platform system API."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I've used Qt with a team to build a multi-threaded 3-d multiplayer real-time networked game (read: non-trivial application that fully utilized many many areas of Qt) and we were nothing but blown away by the effectiveness of Qt's ability to support multiple platforms.", "(We developed on OS X while targeting Windows and I regularly made sure it still ran on Linux as well.", ")  We encountered only a few platform specific bugs, almost all of which arose from the use of non-Qt APIs such as OpenGL.", "(Which should really tell you something, that OpenGL was more of a struggle to use cross platform than Qt was."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["At the end of the experience we were pleased at how little time we needed to spend dealing with platform-specific bugs.", "It was surprising how well we could make a GUI app for windows given almost none of the team actually used it as a primary development platform through the project."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["But do test early and often.", "I don't think your approach of writing an entire application and then testing is a good idea.", "It's possible with Qt, but unlikely if you don't have experience writing portable code and/or are new to Qt."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Yes.", "The code that you write using Qt will work on Windows, Mac, Linux/X11, embedded Linux, Windows CE and Symbian without any change.", "You can take a look here."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "look here", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://qt.nokia.com/products/platform/platforms"}]}], [{"text": ["Generally - as long as you don't use code that is not covered by Qt classes - yes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I have several time just recompiled applications I wrote in Linux(64bit) under Windows, and the other way arround.", "It works for me every time."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Depends on your needs, you might also find compiler problems, but I am sure you will know how to work around them.", "Other people mentioned some issues you should look for, just read the other posts in the question."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["It might run well, but it will take some testing, and of course Qt only handles the GUI portability, not the myriad of other things that might cause portability problems."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Qt apps generally don't fit in very well on MacOS because they don't have Applescript support by default and don't necessarily have the right keybindings.", "But if you do the work to fix those issues, they work, but not nicely.", "On the Mac, it's far better to build a native UI.", "If this is an in-house app, Qt is probably OK, but if it's for sale, you won't make many sales and will create yourself some support hassles."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["As the others said, everything which is done using Qt-Functionality will most likely run quite flawlessly, WHEN you dont use platform specific functionality of qt."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There isnt that much (most of it has to do with window-manager stuff) , but some things might not work on other systems.", "But such things are surely mentiond in the documentation of Qt."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Still there are things which cant be done using Qt, so you will have to do that yourself using plain Python...\nYeah \"Python\" itself is platform-independent (well it should), but there are lots of other things involved ... well mainly the OS.", "And how the OS reacts you will plainly have to findout yourself by testing the application on all target OS."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Recently i wrote an quite simple GUI-application, while it ran flawlessy on Windows, it didnt run on Linux, because on Linux Python interpreted files encoded in unicode differently than on Windows.", "Additionally a small script which should return the hostname of the machine, which it did on Windows, only returned \"localhost\" on Linux, which was obviously not what i wanted."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]