[[{"text": ["Do the getting started guide to scipy?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.scipy.org/Getting_Started"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.scipy.org/Getting_Started", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.scipy.org/Getting%5FStarted"}]}], [{"text": ["Sage: http://www.sagemath.org/"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.sagemath.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.sagemath.org/"}]}], [{"text": ["Assuming that these students are new to programming (which is quite likely for math students), you'll want to give them a basic introduction to programming (what a function is, what a variable is, how each of these differ from functions and variables in math, etc)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Show them some example programs, with a view to things that will be helpful for math: numerical methods, matrix multiplication, etc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Wherever possible, wow them so that they'll get excited about using computers for their own projects.", "Some Python/Math resources"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Some Python/Math resources", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.math.okstate.edu/~ullrich/PyPlug/"}]}], [{"text": ["You are going to have to decide what you want to show them.", "If you want to show them how to using a computer can be a useful tool in mathematics show them sage and how you can perform numerical methods with it to get answers to hard questions.", "Then manipulate some algebraic formulas with it.", "Maybe show how it can whip through hard integrals and derivatives without sweating.", "They will be nearing the end of some of their first calulus courses after all."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["None of this displays why they need to know how to program of course.", "This just shows how useful other people's programming is for them to use.", "While you do have the full power of python in sage the reality is the odd \"for loop\" and some \"if statements\" is really all of the programming most mathematicians will do with sage most of the time (though there is a significant minority who will do a lot more).", "If you want to go down this road I would suggest you try to get your hands on one of the Experimental mathematics books(http://www.experimentalmath.info/).", "These are the guys who (amongst many other interesting results) came up with BBP numbers: which is the way to find arbitrary digits of pi.", "They mostly use maple and mathematica but most of this work translates to sage."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.experimentalmath.info/", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.experimentalmath.info/"}]}, {"text": ["I would strongly suggest you don't show them how to actually implement numerical methods themselves.", "Very few mathematicians are writing programs to solve numerical problems.", "Most just plug their programs into other people's programs.", "So I don't think showing how they could implement these methods themselves, if only they knew how to program, will excite anyone."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If this were me I think I would probably give a seminar building a simple game plugin for cgsuite (http://cgsuite.sourceforge.net/).", "I recognize that this is java and not python but their are a lot of advantages to this approach.", "First young mathematicians always get excited by combinatorial game theory.", "You are fundamentally showing them how they can use math to always win at certain games.", "It's like you are giving them a super power."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://cgsuite.sourceforge.net/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://cgsuite.sourceforge.net/"}]}, {"text": ["Second, you are implementing the rules of a game in a program.", "Game rules are great ways to learn programming idioms because they translate so directly into programming concepts."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["And finally, you end up with a tool that can play your game perfectly.", "90 minutes is a long time for a seminar as far as I'm concerned.", "If you can end on a bang, like with 10 minutes of playing a game against a computer, they will leave excited instead of bored and drained."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I would recommend solving a few different kinds of problems from Project Euler in Python and having a discussion about the solutions, how they could have been done differently to be more efficient, etc.", "as part of the seminar.", "Python is a very elegant language for solving mathematical problems and should be one of those easier understood than most by mathematics students, so I think you made a good choice there. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would bring up using Python as a free &amp; open source option to replace/augment expensive packages like Matlab, IDL, etc via:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "scipy - fft's, ", "tag": "none", "senID": 1}, {"text": "ipython - \"shell\"/debugger", "tag": "none", "senID": 2}, {"text": "matplotlib - 2d graphing", "tag": "none", "senID": 3}, {"text": "MayaVi - 3d graphing/visualization", "tag": "none", "senID": 4}]}, {"text": ["This video may be helpful."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "This video", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.archive.org/details/Perez%5FPython%5FWorkshop%5F2008%5F10%5F09c"}]}], [{"text": ["I'm assuming this is for Freshmen (only because most higher level Math students will likely know how to program)?", "If so, do something that is fun and relevant.", "Go through the basics, but maybe walk them through the logic / basic framework for a Game (which are heavily math oriented) or Python-Based Graphing Calculator.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to get them real geeked though, show them Mathematica.", "I know, it's not what you selected ... but when I was a Sophomore Math major and first saw what you could do with it, I was in love."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Python will work well, but GNU Octave may be better."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["What should be content of my presentation ?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["What are good resources available ?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["What is necessity of programming for maths students?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["How will knowledge of programming will help them?"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["http://www.sagemath.org"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.sagemath.org", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.sagemath.org"}]}, {"text": ["In our wiki is a collection of talks, they may help you!", "http://wiki.sagemath.org/Talks"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://wiki.sagemath.org/Talks", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://wiki.sagemath.org/Talks"}]}, {"text": ["Also be aware, that Sage contains NumPy, SciPy and SymPy.", "Therefore all information about these three python libraries hold for Sage. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]