[[{"text": ["It's easier to ask forgiveness than permission."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["First, build the initial release in Django.", "Quickly.", "Build the model well (really well!).", "But use as much default admin functionality as you can."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Spend time only only reporting and display pages where the HTML might actually matter to the presentation."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Show this and they'll only want more.", "Once they've gotten addicted to fast turnaround and correct out-of-the box operation, you can discuss technology with them.", "By then it won't matter any more."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You need to speak the language of business: money. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["\"If we do it Rails, it will cost you 50% less than the same functionality in Java.", "\" "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "\"If we do it Rails, it will cost you 50% less than the same functionality in Java.\"", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Your percentage may vary, and you might need to also include hosting and upkeep costs, to show how it balances out.  "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["When you're convincing other programmers, sure, talk about development speed and automation of repetitive tasks.", "But talk bottom-line cost to a business person. "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Before you begin making the case for Django or Rails, you have to be convinced it's the right stack first in the context of the business person's needs.", "If the business person is an entrepreneur, he may have other factors that go beyond how quickly can the solution be developed.", "For example:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you've cross this chasm and are convinced you have the client's best interest in mind, then I would look for examples on the Internet where the same application has been authored in both Java and Rails/Django.", "Here's an example of the Pet Store implemented in Rails.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["http://www.anassina.com/projects/railspetstore/"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://www.anassina.com/projects/railspetstore/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.anassina.com/projects/railspetstore/"}]}, {"text": ["You can download the source code and demonstrate to your client how much less code is needed to achieve the same result."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Explain to the client why less code is valuable:  the less code you write, the fewer bugs you will have."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["The first 2 arguments from the top of my mind:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["While many of you made some good suggestions, WRT the talks/resources for using these frameworks, you may also note to have a look at talk on redesigning yellow pages in ROR:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "talk on redesigning yellow pages in ROR", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.infoq.com/presentations/straw-yellowpages"}]}, {"text": ["Summary from the site:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["The best case to be made for either of these frameworks is their ability to automate repetitive and time-consuming tasks.", "This allows developers to be faster and more productive which in turn means projects are delivered faster."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The problem with a \"brochure\" approach is that it doesn't address the clients needs.", "Putting the language/platform of choice into a presentation that addresses the clients goals is much more likely to sell them - both on the tools you want to use, as well as you as a provider.", "As long as you can show that your approach will solve the problem (preferably with the least amount of expense), you'll have fewer objections and less of the \"but I've heard that xxx is the best\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]