[[{"text": ["Django has a few notable 'rapid' items including automatically generated administrative interface, bundled ORM (lowers dev time by not having to write SQL and some other code), and a large community with several re-usable apps."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Django", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}, {"href": "http://images.google.com/images?hl=en&client=firefox-a&rls=org.mozilla%3Aen-US%3Aofficial&hs=0Ku&q=django%20admin&um=1&ie=UTF-8&sa=N&tab=wi", "text": "automatically generated administrative interface", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://djangoplugables.com/", "text": "several re-usable apps", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Where Django (or Ruby on Rails or any other MVC framework for that matter) isn't going to be rapid is the learning curve when you first come to developing on them.", "Django (and RoR) have quite a bit of seperation-of-concerns and if you're not used to that sort of environment, it takes a while to learn the framework.", "If you're using an ORM that's something to get used to as well, and then of course for any framework you go with there's the API to learn as well."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["PHP on the other hand is a little more intuitive in terms of where you put the code and how pages make up your web app.", "It'll basically let you slap code wherever you want so in the beginning it will probably be faster.", "In the end it will be quicker but your final product will be sloppier and probably require re-factoring later on."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["This comes down to a question of what's the use of the framework.", "If it's for a hobby site, just go with what's easy (php), otherwise you might want to consider a well-supported MVC framework."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["As others have pointed out, jquery is probably the pick for pre-made GUI widgets."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Edit -- And apparently now Django (as of 1.1) has a very awesome set of unit testing tools it comes bundled with.", "Things like an extended TestCase specifically for Django, a test client (you can do test page request w/o an actual client or server), a tool to give you a % of test coverage you have of the project, and a bunch of other neat stuff."], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "Edit", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "a very awesome set of unit testing tools", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.slideshare.net/ericholscher/token-testing-slides"}]}], [{"text": ["There is no single \"right\" answer to this question.", "As a Java programmer of some 10+ years when asked this question my usual answer is... PHP.", "There are several reasons for this:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 10, "lis": [{"text": "Low resource usage (Apache, nginx);", "tag": "none", "senID": 1}, {"text": "Cheaper hosting;", "tag": "none", "senID": 2}, {"text": "Really low barrier to entry;", "tag": "none", "senID": 3}, {"text": "It's really Web-oriented rather than being general purpose that can be used for Web (like Java);", "tag": "none", "senID": 4}, {"text": "The fact that PHP scripts aren't persistent (like Java servlets are) between requests makes them much more forgiving and less likely to cause memory leaks and other problems;", "tag": "none", "senID": 5}, {"text": "No deployment step (like Python, Perl, etc). I'd say this is about the best thing about dynamic scripted languages. Just save the file and click reload on your browser;", "tag": "none", "senID": 6}, {"text": "PHP might be inconsistent in syntax and several other things but it's also mature and used by some really large sites on the Web (eg Facebook, Yahoo, Flickr, Wikipedia);", "tag": "none", "senID": 7}, {"text": "PHP is by far the most popular Web development language.", "tag": "none", "senID": 8}, {"text": "Widgets can be done by any manner of Javascript frameworks like ", "tag": "none", "senID": 9}, {"text": "PHP fits well with MySQL.", "tag": "none", "senID": 10}]}, {"text": ["That being said, a lot of these apply to other languages too (eg Python/Django)."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["I don't think you necessarily need a framework for PHP but if you do I'd look at one or more of:"], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Kohana"], "childNum": 0, "tag": "a", "senID": 13, "childList": []}, {"text": ["Zend Framework"], "childNum": 0, "tag": "a", "senID": 14, "childList": []}, {"text": ["Smarty"], "childNum": 0, "tag": "a", "senID": 15, "childList": []}]}], [{"text": ["You've already tagged your question with \"java\", \"php\", \"python\", and \"ruby-on-rails\", so researching and learning more about those tools would probably help to answer your question."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, I believe that rapidly building an application is almost never actually the correct goal.", "Normally, what you want to do is build an application that can be rapidly maintained -- that is, maintained with the lowest possible overall development cost over time."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "rapidly building", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "rapidly maintained", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["I would say part of the learning curve will go into understanding concepts.", "I have been learning about web-apps for some months now, and with my improved understanding of concepts right now, most frameworks show very much similarities.", "Here are my results so far:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "PHP:  Great to learn about concepts for doing forms, http-post-requests, http-get-requests. easy interaction with database layer, and it is possible to obtain a working basic application in couple of hours. Almost no hassle with build-systems and web-server configuration.", "tag": "none", "senID": 1}, {"text": "Ruby-on-Rails:  Great to learn about REST and more complicated CRUD applications. Great to learn about the complexity behind MVC and especially simple and powerful interaction with the database layer by using ActiveRecord. Introduction of meta-programming (code-that-writes-code, code-scaffolding) is great. Nice opportunities for free cloud-deployment, e.g. heroku.com and there is a very active community", "tag": "none", "senID": 2}, {"text": "Java: Powerful interaction with web-server possible (Tomcat, JBoss, ...) MVC is rather complicated here, and in general many configuration-steps necessary (build systems, ORM layer, ...) Grails is a great simplifaction and introduces meta-programming for Java. Jboss Seam introduces REST for Java (but have not looked into this yet)", "tag": "none", "senID": 3}]}], [{"text": ["There are tons, which ones are \"good\" depend on what you need."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There's Ruby on Rails, which is pretty handy."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For python there's django."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For PHP (I spend a lot of time dealing with PHP), you can look at:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "symfony", "tag": "none", "senID": 4}, {"text": "cakePHP", "tag": "none", "senID": 5}, {"text": "Solar", "tag": "none", "senID": 6}, {"text": "Zend Framework", "tag": "none", "senID": 7}]}, {"text": ["Which are all good in certain situations, and annoying in others."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["Speaking only in terms of speed of development, Ruby on Rails is the fastest one out there."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would vote for Grails."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Grails", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://grails.org/"}]}]]