[[{"text": ["Using PyPy you can create a python sandbox.", "The sandbox is a separate and supposedly secure python environment where you can execute their scripts.", "More info here"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://codespeak.net/pypy/dist/pypy/doc/sandbox.html"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://codespeak.net/pypy/dist/pypy/doc/sandbox.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://codespeak.net/pypy/dist/pypy/doc/sandbox.html"}]}, {"text": ["\"In theory it's impossible to do anything bad or read a random file on the machine from this prompt."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["\"This is safe to do even if script.py comes from some random untrusted source, e.g.", "if it is done by an HTTP server."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I am in no way associated with this site and I'm only linking it because it tries to achieve what you are getting after: jailing of python.", "The site is code pad."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "code pad", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://codepad.org/about"}]}, {"text": ["According to the about page it is ran under geordi and traps all sys calls with ptrace.", "In addition to be chroot'ed they are on a virtual machine with firewalls in place to disallow outbound connections."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "geordi", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.xs4all.nl/~weegen/eelis/geordi/"}]}, {"text": ["Consider it a starting point but I do have to chime in on the whole danger thing.", "Gotta CYA myself.", ":)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Along with other safeguards, you can also incorporate human review of the code.", "Assuming part of the experience is reviewing other members' solutions, and everyone is a python developer, don't allow new code to be activated until a certain number of members vote for it.", "Your users aren't going to approve malicious code. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Yes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Allow them to script their client, not your server."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["PyPy is probably a decent bet on the server side as suggested, but I'd look into having your python backend provide well defined APIs and data formats and have the users implement the AI and logic in Javascript so it can run in their browser.", "So the interaction would look like: For each match/turn/etc, pass data to the browser in a well defined format, provide a javascript template that receives the data and can implement logic, and provide web APIs that can be invoked by the client (browser) to take the desired actions.", "That way you don't have to worry about security or server power."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Have an extensive API for the users and strip all other calls upon upload (such as import statements).", "Also, strip everything that has anything to do with file i/o."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["(You might want to do multiple passes to ensure that you didn't miss anything."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]