[[{"text": ["I agree that it is pretty subjective which programming language you use - essentially I would rather get the job done as quickly and efficiently as possible which making it supportable - so that depends on your infrastructure..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Can I suggest that you look at Nagios rather than re-inventing the wheel yourself? "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Nagios", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.nagios.org/"}]}, {"text": ["While Nagios might require a greater learning curve in terms of configuration, it will be worth it in the long run, and if you can't find a plugin to suit your requirements, then it is easy to write your own.", "Joel Spolsky has written an interesting article on this."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Joel Spolsky", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.joelonsoftware.com/items/2008/01/22.html"}]}], [{"text": ["Go with Perl."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You'll have access to a nice Ping object, Net::Ping and storing the results in a database is pretty easy."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Net::Ping", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://search.cpan.org/perldoc?Net::Ping"}]}], [{"text": ["Well, I work in both Perl and Python, and my day job is supporting a network monitoring software.", "Most of the import points have already been covered, but I'll consolidate/reiterate here: "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Either one should work just fine.", "If you don't have experience with either, flip a coin.", "No language is inherently productive; languages allow people to be productive.", "Different people will benefit differently from different languages. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In general, though, when you know your specific task and need to choose a tool, look for the  libraries that would make your life easy.", "For Perl, check out the Comprehensive Perl Archive Network.", "There are modules for just every networking thing you might need."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Comprehensive Perl Archive Network", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://search.cpan.org"}]}, {"text": ["Python probably has very similar tools and libraries; I just don't know what they are."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I know Perl better than Python, so my choice would fall on Perl.", "That said, I'd argue that on low level tasks (like pinging computers on a network and things like that) they are rather equivalent.", "Python may have a better object-oriented support but for scripting (that happens to be what you need) the power of Perl is quite obvious.", "The large pool of tested modules (some of them are even object oriented) that you find on CPAN usually can do everything you need and they can even scale well if you use them appropriately."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "CPAN", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://www.cpan.org"}]}], [{"text": ["I don't know Python, so I can't comment on what it offers, and I agree with those who suggest Nagios or other existing systems."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, if you decide to roll your own system with Perl, Consider using POE.", "POE is a cooperative multitasking and networking framework.  "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "POE", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://search.cpan.org/~rcaputo/POE-1.003/lib/POE.pm"}]}, {"text": ["POE has a steep learning curve.", "But you will be repaid for you effort very quickly.", "POE will provide a solid foundation to build from.", "Much of the client code you will need is already available on CPAN."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "client code", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://search.cpan.org/search?query=POE+Component&mode=all"}]}], [{"text": ["Whichever you know better or are more comfortable using.", "They both can do the job and do it well, so it is your preference.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Right now I've experimented the approach of creating some simple unit test for network services using various TAP libraries (mainly bash+netcat+curl and perl).", "The advantage is that you wrote a single script that you can use for both unit and network testing.", "The display is dove via TAP::Harness::HTML."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'd say that if you need something quick and dirty that's up and running by this afternoon, then perl is probably the better language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However for developing solid application that's easy to maintain and extend and that you can build on over time, I'd go with python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This is of course assuming you know both languages more or less equally well.  "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]