[[{"text": ["With that range of skills, why don't you learn something more outside your comfort zone, like carpentry or painting, or any of hundreds of other skills that have little to do with your field."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["At some point, all languages are the same and you'll get scant benefit from learning another. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Whereas, with something totally different, you will become a much more well-rounded individual.", "I, for one, like painting and golf, even though I'm not that good at either of them - when I asked my golf instructor what my handicap was, he said it was an inability to hit the ball straight :-)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I find that I enjoy doing stuff I'm not accustomed to since it's a genuinely new experience.", "Learning another computer skill is a easy thing to do after a while and hence the pleasure from doing it is reduced."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "enjoy", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Don't get me wrong, I like to keep up with developments in the field but, for the most part, the brand new technologies give nothing to my career since most work I do is on stable technologies.", "You may be in a different situation."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Haskell is pretty popular these days as a mind-bender, though it may not hurt as much for you if you already know Lisp and Scheme.", "It's purely functional, so there are no side effects to anything.", "You have to use monads to print text and do other things that require a certain order.", "It's also completely lazily evaluated, so you can make infinite lists in Haskell and not have to worry about memory consumption."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Haskell", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.haskell.org/"}]}, {"text": ["The Haskell Platform may not be fully complete, but is intended to be a portable set of libraries for Haskell.", "It's list of packages includes some for CGI handling and (X)HTML generation."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Haskell Platform", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://hackage.haskell.org/platform/"}, {"text": "list of packages", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://hackage.haskell.org/platform/contents.html"}]}], [{"text": ["I do suggest Java.", "When I was looking for a job, I noticed lots of openings for Java developers, so there's a lot of it out there, and you might someday have a chance to use your Java skills."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And then you should try out Scala.", "Scala is a sort of Python-ish language that uses functional programming to make very scalable programs.", "Unlike Python, in Scala you do need to declare types of things.", "Scala runs on the Java Virtual Machine so it can be used in Java shops."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["http://www.scala-lang.org/"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://www.scala-lang.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.scala-lang.org/"}]}, {"text": ["It's possible I'm just giving you this answer because these are the next two languages I intend to learn, myself."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["You probably should also spend a little time playing around with Javascript.", "Javascript was sort of intended to be a \"stealth Lisp\" and I imagine you would pick it right up."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["http://www.crockford.com/javascript/javascript.html"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "http://www.crockford.com/javascript/javascript.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.crockford.com/javascript/javascript.html"}]}, {"text": ["http://bc.tech.coop/blog/030920.html"], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "http://bc.tech.coop/blog/030920.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://bc.tech.coop/blog/030920.html"}]}, {"text": ["And heck, have some fun with it.", "Write a game or something!"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Sounds like you're into web programming, so smalltalk/seaside is a great one.", "IMO everyone should learn smalltalk even if they never use it, and seaside is a really different web framework than what you are used to.", "Django, fer instance, is all about REST, while the seaside philosophy basically says \"to hell with REST.", "\" "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And if you've never coded in an image based environment there's just something about it that seems... natural, magical even.", "Lots of IDE functionality that originated in smalltalk have been implemented in file based language IDE's, but it always feels like an unnatural grafting, where those same features feel as if they simply belong there in smalltalk. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Check out Pharo.", "Give it enough time to get used to the fact that there's no menu bar and see if it doesn't grab you.  "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["From your list I'd say you are due for a completely object oriented language. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You could check out Ruby, but I'd recommend JavaScript since it offers a lot of interesting things you probably wouldn't expect, like support for closures, higher-order functions and prototypical inheritance - plus it's kinda fun and becoming very popular."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["If all your programming is based on web frameworks and SQL databases, you will only be solving the same problems with different syntax if you switch languages."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Build something using a different data model - Prolog, Conceptual Graphs, RDF, Linda/JavaSpaces, XQuery, HDF5, ASN.1, or a different network model - XMPP pub-sub, SNMP, a zero-config mesh or a swarm of ZigBee enabled Arduinos."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Maybe look at languages like Oz, Io or Erlang/OTP, which are distributed rather than primarily monolithic like the ones you mention."], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "Oz", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.mozart-oz.org/"}, {"href": "http://iolanguage.com/", "text": "Io", "childNum": 0, "tag": "a", "childList": []}, {"href": "http://www.erlang.org/doc/", "text": "Erlang/OTP", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["What about the Java Spring framework?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.springsource.org/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.springsource.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.springsource.org/"}]}, {"text": ["Or maybe NHibernate?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["http://en.wikipedia.org/wiki/NHibernate"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://en.wikipedia.org/wiki/NHibernate", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/NHibernate"}]}, {"text": ["At the end of the day its up to you.", "As I only listed two out of many.", "When I am programming a static language professonally...", "I try to learn a dynamic or scripting language.", "And vice versa."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Also, I try to learn something totally different or outside my realm... maybe even Powershell or Korn shell or ActionScript."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["There is no single web framework more respected than others.", "Struts2, Spring MVC, Stripes or Wicket (which is event based) are all good candidates (I personally like Stripes).", "But you'll need a bit more for the persistence (Hibernate or JPA) and for the glue (Spring). "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Grails (Groovy on Rails) is another good option."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Well, I guess that learning Smalltalk can't hurt but I don't see a good reason to choose Smalltalk over a moderner language like Java.", "Regarding tooling, I don't know anything in this field except VisualAge for Smalltalk but, personally, I'd really stay far away from it."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "VisualAge for Smalltalk", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www-01.ibm.com/software/awdtools/smalltalk/"}]}, {"text": ["Looks like I'm not the right guy for that."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Same as above."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I would have suggested mastering Lisp (in some relevant dialect) so even if you have Lisp and Scheme on your resume, it might be worthwhile to REALLY learn deeply.", "See http://www.paulgraham.com/avg.html for reasons why."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.paulgraham.com/avg.html", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.paulgraham.com/avg.html"}]}, {"text": ["Otherwise Prolog might interest you.", "It is related to SQL but for programming instead of communicating with an organised set of data tables."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you want to target web technologies I only have experience with Java.", "Here the newest Java Server Faces (JSF) allow for using Ajax to update pages, and Google Web Toolkit allow for very rich component based web pages.", "These might be juicy enough to interest you enough to learn enough Java to find them fun :)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I don’t see C# and the .NET platform on your list.", "And I am surprised no one mentioned it yet.   "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I have worked in C# for 5 years.", "I have looked at some Java code but I have never coded in it.", "I believe that Java is somewhat similar to C# enough so that if you become proficient in one I think you could pick up the other is a matter of a few days. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["One idea might be to create your own language / compiler.", "The one I would like to create (or see created) would be an Assembly Language level compiler with an object oriented syntax that would be very much like Python…  but make it typed language.", "You could start with the basic raw binary types db, dw, dd, and then add on to these … The functions and methods could have assembly language freely mixed in the high-level code.", "Now, that would be a fun project, I think ?"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Definitely try Haskell or Smalltalk or Forth."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I would say Smalltalk would be most useful while Forth would get you away from the x86 asm and C bullshit.", "There's more than one way to code close-to-the-hardware stuff."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Why don't you try OCaml?", "And if you ever happen (sadly) to return to .NET world - you will have knowledge of F# in your baggage."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]