[[{"text": ["What a coincidence, I created SERF (Search Engine Rank Finder) for this very purpose.", "Works with Google and MSN/Live; but I lost interest before I implemented Yahoo support.", "Link comes with source; exe in the bin folder."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Search Engine Rank Finder", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://channel9.msdn.com/playground/Sandbox/424525-Search-Engine-Rank-Finder-SERF/"}]}, {"text": ["It works by downloading the actual search pages in question and finding any URL with your domain in it.", "It won't pass Google your cookies, but it will probably connect to the same Google server you do."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I use a Python script to check the number of results for a set of searches each day and log the results.", "Then I run another script that builds a spreadsheet from the log files.", "Checking your position in the results page would be only a little more complex."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'm not sure how often it updates, but Google Webmaster Tools shows your rank for the top 20 queries in which your site appeared."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Google Webmaster Tools", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.google.com/webmasters/tools/"}]}, {"text": ["Otherwise, writing a script or a small program in your favorite programming language should do the trick, as was already suggested."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Don't forget rankings vary data center to data center, and are trending more towards being tweaked towards your specific search and browsing history. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Not to sell you anything, but what you should be looking for is more a suite of site quality metrics and less simple ranking metrics, the outputs of which are increasingly questionable.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If I were you, I would look into getting some professional help from an SEM firm with a strong development team, as they usually have some pretty advanced metrics working under the hood.", "Otherwise, just remember that content is king: the W3C is pretty clear about which markup has semantic value, and Google capitalizes on this."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I think it is probably ALOT easier to let the student do it the old fashioned way :p"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It's not a PHP script or something but a nice tool to check your rank at google for some keywords (and it's free software): Google Monitor"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Google Monitor", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cleverstat.com/en/google-monitor-query.htm"}]}], [{"text": ["thanx for share.", "but the W3C is pretty clear about which markup has semantic value, and Google capitalizes on this."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["have the student come up with an automatic way of doing this.", "Sounds like a good exercise for them."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]