[[{"text": ["Have you had a look at Head-First Javascript?", "It seems to me to be a programming tutorial that's not inferior to the best ones available for, say, Python -- sure, it deals with web programming too (while a Python-based book might not), but, why's that extra info a bad thing?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Head-First Javascript", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0596527748"}]}], [{"text": ["Javascript isn't so much a \"joy\" as it is a \"necessary evil\".", "jQuery just makes it less evil.", "Actually that's not entirely fair: part of the \"evilness\" of Javascript is just all the cross-browser difference, not the language itself (which is actually quite modern)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But like learning anything, I don't think it's all that fun if you're just learning for learning's sake.", "Even a good book, tutorial or other resource won't do that (at least for me).", "I find it far more rewarding (and successful) if I have something in particular I'm trying to achieve or do."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you know basic control structures and syntax then you know enough to pick something and try and implement it.", "You'll get stuck along the way (a lot early on) as you try and figure out actually how to do things.", "You'll probably do some of them really badly but that's OK. All that experience gives you a useful context when you do more reading and can appreciate the actual problems that something is discussing or solving."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you are really looking for the joy of GUI programming, then I suggest you C#.", "Get yourself VS 2008 or above. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Just imagine, you have a great GUI designers that allow you to script you layout through drag and drop, and all you have to do, is to fill in the proper event and the program will just run like magic.", "Hand coding is kept to the minimum"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Any programming language popular enough to have books written about it that you've seen in stores will be professionally useful to you.", "I think you have a good approach in looking for something that excites you.", "If those Python books make your heart race, pick one up and dive in.", "If you find something else that you love, go for it.", "You're gonna need that love to get you through all the hard work and frustration of learning to program."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You might want to take a look at Tcl/Tk.", "Although the language is sort of arcane, and the library is at least in principle available in other languages, notably python and perl, the toolkit in its native language is really very clear and concise.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think you want to work on web interface programming not GUI (windows forms)..\nJquery is the best way to go and when it comes to web dev there is no escaping from Javascript..", "I try and comiple some good sites .. give me some time"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I suggest finding the joy in JavaScript.", "It sounds to me like your market may be in the browser, in other words, downloaded applications aren't what you're looking for.", "If this is the case, you don't have much of a choice:  JavaScript or Flash."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you had trouble with OOP, I suggest you find the joy in that first.", "As the joy of both JavaScript and AS3 (as you already know) can only be found once you find the joy in OOP, which will server you far better as a programmer in general."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As far as books, I recommend, JavaScript The Good Parts by Douglas Crockford, who is widely considered one of the top authorities on the subject."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "JavaScript The Good Parts", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9780596517748"}]}]]