[[{"text": ["Forget about mod_python, there is WSGI. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "WSGI", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/dev/peps/pep-0333/"}]}, {"text": ["I'd recommend Django.", "It runs on any WSGI server, there are a lot to choose from.", "There is mod_wsgi for Apache, wsgiref - reference implementation included in Python and many more.", "Also Google App Engine is WSGI, and includes Django."], "childNum": 6, "tag": "p", "senID": 1, "childList": [{"text": "Django", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}, {"text": "WSGI", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.python.org/dev/peps/pep-0333/"}, {"text": "mod_wsgi", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://code.google.com/p/modwsgi/"}, {"text": "wsgiref", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/wsgiref.html"}, {"text": "many more", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://wsgi.org/wsgi/Servers"}, {"text": "Google App Engine", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://code.google.com/appengine/"}]}, {"text": ["Django is very popular and it's community is rapidly growing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Disclaimer: I really don't like PHP, Python is nice, but doesn't come close to Smalltalk in my book.", "But I am a biased Smalltalker.", "Some answers about Seaside/Squeak:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Q: Which I guess runs on a squeak app server?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Seaside runs in several different Smalltalks (VW, Gemstone, Squeak etc).", "The term \"app server\" is not really used in Smalltalk country.", ":)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Q: From what I've heard it would permit good compartmentalization of users as each would have their own little private VM independent of all the systems other users which sounds wonderful from a security, scaling and redundancy standpoint."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Yes, each user has its own WASession and all UI components the user sees are instances living on the server side in that session.", "So sharing of state between sessions is something you must do explicitly, typically through a db."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Q: I've not done any Smalltalk since Uni 15 years back and I never dug too deep into it then.", "I don't see much entry level help for seaside or that many projects using it."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Smalltalk is easy to get going with and there is a whole free online book on Seaside."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Q: I suspect setting a server up to run it is hard for the same reason i.e.", "not because it's inherently hard but just cause there will be less help online and a presumption you are already rather au fait with Sqeak/Smalltalk."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["No, not hard.", ":) In fact, quite trivial.", "Tons of help - Seaside ml, IRC on freenode, etc."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Q: Is Seaside as good as I think in terms of insulating users from each other?"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["I would say so."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["Q: Might I be better off, security wise, sticking to the languages I'm most familiar with so I don't make any n00b mistakes or will Seaside be worth worth scaling the learning curve and prove more secure, comprehensible and maintainable in the long run?"], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["The killer argument in favor of Seaside IMHO is the true component model.", "It really, really makes it wonderful for complex UIs and maintenance.", "If you are afraid of learning \"something different\" (but then you wouldn't even consider it in the first place I guess) then I would warn you.", "But if you are not afraid then you will probably love it."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["Also - Squeak (or VW) is a truly awesome development environment - debugging live Seaside sessions, changing code in the debugger and resuming etc etc.", "It rocks."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}], [{"text": ["I'd say take a look at Django.", "It's a Python framework with a ready-made authentication system that's independent of the hosting OS, which means that compromises are limited to the app that was compromised (barring some exploit against the web server hosting the Python process). "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Django", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com"}]}], [{"text": ["I've been getting into seaside myself but in many ways it is very hard to get started, which has nothing to do with the smalltalk which can be picked up extremely quickly.", "The challenge is that you are really protected from writing html directly.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I find in most frameworks when you get stuck on how to do something there is always a work around of solving it by using the template.", "You may later discover that this solution causes problems with clarity down the road and there is in fact a better solutions built into the framework but you were able to move on from that problem until you learned the right way to do it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Seaside doesn't have templates so you don't get that crutch.", "No problems have permanently stumped me but some have taken me longer to solve than I would have liked.", "The flip side of this is you end up learning the seaside methodology much quicker because you can't cheat."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you decide to go the seaside route don't be afraid to post to the seaside mailing list at squeakfoundation.org.", "I found it intimidating at first because you don't see a lot of beginner questions there due to the low traffic but people are willing to help beginners there."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Also there are a handful of seaside developers who monitor stackoverflow regularly.", "Good luck."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Have you taken a look at www.nagare.org ?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "www.nagare.org", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["A framework particularly for web apps rather than web sites."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["It is based around the Seaside concepts but you program in Python (nagare deploys a distribution of python called Stackless Python to get the continuations working)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Like Seaside it will auto generate HTML, but additionally can use templates as required."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["It has been recently open sourced by http://www.net-ng.com/ who themselves have many years experience in delivering web apps/sites in quality web frameworks like zope and plone."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://www.net-ng.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.net-ng.com/"}]}, {"text": ["I am researching it myself at the moment to see if it fits my needs, so can't tell you what I think of it in the wild.", "If you take a look, please give your feedback. "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["While considering a Smalltalk web framework, look at Aida/Web as well.", "Aida has built-in security with user/group/role management and strong access control, which can help you a lot in your case.", "That way you can achieve safe enough separation of users at the user level in one image.", "But if you really want, you can separate them with running many images as well.", "But this brings increased maintenance and I'd think twice if it is worth."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Aida/Web", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.aidaweb.si"}]}], [{"text": ["I'm toying with Seaside myself and found this tutorial to be invaluable in gaining insight into the capabilities of the framework."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "this tutorial", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://seaside.gemstone.com/tutorial.html"}]}], [{"text": ["I think you've pretty much summed up the pros and cons.", "Seaside isn't that hard to set up (I've installed it twice for various projects) but using it will definitely affect how you work--in addition to re-learning the language you'll probably have to adjust lots of assumptions about your work flow.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "that", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["It also depends on two other factors"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "If other people will eventually be maintaining it, you'll have better luck finding python programmers", "tag": "none", "senID": 2}, {"text": "If you are doing a highly stateful site, Seaside is going to beat the pants off any other framework I've seen.", "tag": "none", "senID": 3}]}], [{"text": ["There is now an online book on Seaside to complete the tutorial pointed out earlier."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "online book on Seaside", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://book.seaside.st/book"}, {"href": "http://seaside.gemstone.com/tutorial.html", "text": "tutorial pointed out earlier", "childNum": 0, "tag": "a", "childList": []}]}]]