[[{"text": ["Most of the performance issues with string concatenation are ones of asymptotic performance, so the differences become most significant when you are concatenating many long strings.", "In your sample, you are performing the same concatenation many times.", "You aren't building up any long string, and it may be that the python interpreter is optimizing your loops.", "This would explain why the time increases when you move to str.join and path.join - they are more complex functions that are not as easily reduced.", "(os.path.join does a lot of checking on the strings to see if they need to be rewritten in any way before they are concatenated.", "This sacrifices some performance for the sake of portability."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["By the way, since file paths are not usually very long, you almost certainly want to use os.path.join for the sake of the portability.", "If the performance of the concatenation is a problem, you're doing something very odd with your filesystem."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Not necessarily.", "I don't know the internals of Python well enough to comment specifically but some common observations are that your first loop uses a simple operator + which is probly implemented as a primitive by the runtime.", "In contrast, the other loops first have to resolve a module name, resolve the variable/class found there and then call a member function on that."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "+", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["Another note is that your loop might simply be too small to yield significant numbers.", "Considering your low overall running time, this probably makes your tests useless."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Also, your test case is highly specialized on two short strings.", "Such cases never give a clear picture of edge case performance."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The advice is about concatenating a lot of strings."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To compute s = s1 + s2 + ... + sn,"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["1) using +.", "A new string s1+s2 is created, then a new string s1+s2+s3 is created,..., etc, so a lot of memory allocation and copy operations is involved.", "In fact, s1 is copied n-1 times, s2 is copied n-2 time, ..., etc."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["2) using \"\".joing([s1,s2,...,sn]).", "The concatenation is done in one pass, and each char in the strings is copied only once."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["In your code, join is called on each iteration, so it's just like using +.", "The correct way is collect the items in an array, then call join on it."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["It is true you should not use '+'.", "Your example is quite special, try the same code with:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n s1='*'*100000\ns2='+'*100000\n</code>\n</pre>\n", "senID": 1}, {"text": ["Then the second version (str.join) is much faster."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["String concatenation (+) has an optimized implementation on CPython.", "But this may not be the case on other architectures like Jython or IronPython.", "So when you want your code to performe well on these interpreters you should use the .join() method on strings.", "os.path.join() is specifically meant to join filesystem paths.", "It takes care of different path separators, too.", "This would be the right way to build a file name."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "+", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": ".join()", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "os.path.join()", "childNum": 0, "tag": "code", "pos": 3, "childList": []}]}], [{"text": ["I would like to add a link to the python wiki, where there are notes regarding string concatenation and also that \"this section is somewhat wrong with python2.5.", "Python 2.5 string concatenation is fairly fast\"."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "this section is somewhat wrong with python2.5. Python 2.5 string concatenation is fairly fast", "childNum": 0, "tag": "em", "pos": -1, "childList": []}]}, {"text": ["I believe that string concatenation had a big improvement since 2.5, and that although str.join is still faster (specially for big strings), you will not see as much improvement as in older Python versions."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["http://wiki.python.org/moin/PythonSpeed/PerformanceTips#StringConcatenation"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://wiki.python.org/moin/PythonSpeed/PerformanceTips#StringConcatenation", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/PythonSpeed/PerformanceTips#StringConcatenation"}]}]]