[[{"text": ["Presuming your goal is to delete for the cheapest cost, rather than face migration, I would launch a self-scheduling task, that would clean up several hundred/thousand keys in each run, then re-schedules itself.", "I would purposefully throttle this task on a separate queue so that the task ran only often enough to avoid hitting my daily free quotas if possible."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you have some \"acceptable\" CPU cost per day that you'd be willing to live with, you could throttle the queue less, either way it would be better if each delete doesn't take too long to complete so it doesn't impact instance latency too heavily."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["kevpie's comment on vacuuming may also be relevant if you have composite indexes."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Removing indexes first will substantially reduce the cost of deleting records.", "You could also limit your deletion rate to keep under the 6.5 CPU hours per day you're allocated for free, to avoid paying."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Regarding doing the deletion yourself, it's unlikely you can do it more efficiently than the datastore admin tool, which already does keys-only queries and uses cursors."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You mean you used GQL in the datastore admin?", "Like, delete from x...?", "And that was too expensive?", "Hmmm..."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "delete from x...", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["Well, you might save some money if you integrate deleting into your runtime code.", "ie, if a user is logged in, you're already accessing the db, presumably with the same indicies, so why not delete it then?", "You would end up with fewer overall transactions if you do it right."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Questions.", "- Are your Event entities grouped in entity groups?", "- How many indexes do you have?", "Any composite ones?", "- How many properties that are not indexed=False?  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Just trying to determine the cost of a delete.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You may be able have some of your indexes vacuumed before you start deleting the entities."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I've run into this problem while developing a new app that didn't always clean up after itself.", "After running several experiments, what I learned was"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Try deleting via the remote_api.", "It will reduce the consumption of CPU hours by a large extent\nhttp://code.google.com/appengine/articles/remote_api.html"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://code.google.com/appengine/articles/remote_api.html", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://code.google.com/appengine/articles/remote_api.html"}]}]]