[[{"text": ["Actually the blog tutorial is getting old - all the frameworks have one already.", "The photo album is great.", "There is (as usual) a rails tutorial for this, but sure, django could use one as well.", "You could go just as the rails original goes:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "a rails tutorial for this", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0596101325"}]}, {"text": ["perhaps the next cast could base on the work you do in the first part and go on for the AJAXy stuff (like actual slideshow or sorting slides through drag and drop)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I'd say go for it all.", "I mean it's great to have a gallery application, but what about how you'd create an API for that application in Django.", "What about creating custom template functions for display, incorporate the JavaScript library for viewing, etc.", "The key though, is instead of speed of development, showing \"best practices\".", "I hate the \"we can do this with 5 lines of code, but no sane person would\" stuff."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Covering the different ways you can set up Django would be good.", "mod_python, FastCGI etc.", "- I think that's probably one of the toughest things when you're starting out."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "mod_python", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Mod%5Fpython"}, {"text": "FastCGI", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/FastCGI"}]}, {"text": ["Personally I'm struggling with getting comments and an authentication system integrated with the rest of the site I'm working on.", "There's not a lot of information on how to use those systems and navigate back to whatever page you were looking at."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Anything on doing Ajaxy interactions would be useful too."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Getting started would be great.", "Not perhaps installing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I really like the 15 minute blog system that DHH did in his Rails screencast, also cakephp has one, although without doing comments."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So a \"Do a 15 minute blog system\" would be fantastic, or a simple photo album."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["It will be great If you could cover the same topics as the one in peepcode for rails.", "It will be great if the quality is similar. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Python fundamentals.", "Something similar to Dive into Python (http://diveintopython.org/).", "I got interested in Python as a result of Django but I found, in the course of writing Django apps, there are some gaps in my Python knowledge."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["\"build your own cms\" series would be great"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]