[[{"text": ["Not everyone has 25\" monitors.", "We use a dual 21\" monitor setup here, but that is by no means the standard.", "Also there are many people who are not professional coders writing python with the latest and greatest setup, but poor college students (me!", ") with 19\" or less (laptops, netbooks) monitors.", "Hobby programmers and \"other\" professionals who may not have as nice setups, and schools, public and otherwise are also limited in their desktop real-estate.", "But 80 character terminals more or less exist everywhere."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "many", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "everywhere", "childNum": 0, "tag": "em", "pos": 5, "childList": []}]}, {"text": ["Limited width (really, any good standard) is A Good Thing™ because it gives a nice standard look across the board.", "I know that if I look at modules included in Python, or Pygame, or PyPy, or MyPaint, each one of those will have a pretty standard feel.", "This helps me with the time I need to comprehend the code."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For another look at code width, read what these people have to say."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "these", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/3151599/how-wide-should-vb-code-get/3151630#3151630"}, {"href": "http://stackoverflow.com/questions/3151599/how-wide-should-vb-code-get/3151638#3151638", "text": "people", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["I try and use it, because I like to have some convention to keep me in place, but I know with dynamic line wrapping and suchlike, it is becoming less common.", "For example, the linux kernel for many years would take the convention as a solid rule, but recently, they have been accepting contributions with over 80 char long lines."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Another thing to keep in mind is that many editors offer split views.", "I often have two documents open in columns, and with a wide screen monitor, these columns (for me) come to about roughly 83 chars width.", "So the convention can still be useful, in some specific situations."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I always follow the 80-character limit, in any language, for a few reasons:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Consistency, consistency, consistency.", "tag": "none", "senID": 1}, {"text": "Possibility of multiple views in multiple windows or columns.", "tag": "none", "senID": 2}, {"text": "Seamless switching between old and new editors.", "tag": "none", "senID": 3}, {"text": "Encourages keeping nesting shallow, arguments few, and expressions succinct.", "tag": "none", "senID": 4}]}, {"text": ["The last is the most important, and integrates comfortably with verbose naming conventions.", "If it doesn't fit on one line or neatly break into two, then regardless of your naming, the code probably needs to be adjusted anyway."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Though I refer to it as the 80-character limit, in practice it's a good idea to keep to 79 or even 78 columns, for those console editors that insist on a scrollbar and a border."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "and", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["On a related note, I use tabs for indentation and spaces for alignment.", "This way, formatting is not disturbed if the tab size is changed.", "With regard to the 80-column rule, though, I minimally ensure that the code does not hit the margin when using 4-column tabs, since tab sizes higher than that are less common."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["79 or 80 character line limits are perfectly sensible today.", "Several others have pointed out that not everyone has a monitor as wide as yours.", "Moreover, your GUI editor is not the only place where code is read or written.", "Here are a few more places where long lines are a real pain:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "Side-by-side diffs.", "tag": "none", "senID": 1}, {"text": "Code snippets in email.", "tag": "none", "senID": 2}, {"text": "Text-mode consoles. (For example, during production server debugging.)", "tag": "none", "senID": 3}, {"text": "Printouts.", "tag": "none", "senID": 4}, {"text": "GUI editors used by people who don't maximize every application to fill the desktop.  (I personally like to keep API docs on one side of my screen and my editor on the other side.)", "tag": "none", "senID": 5}]}], [{"text": ["I think the 80 character limit is great, and works beautifully in Python (maybe not so much in Java or JavaScript, but is very doable in Python).", "I always try to honor it.", "I work on 2 24\" monitors, 1 portrait, the other landscape, and its invaluable to allow me to have 2 windows side by side on the portrait display, or ~3.5 on the landscape."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["While editors will wrap long lines, it wraps them in an ugly way which disrupts the flow of code, making it harder to read."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Trying to keep code within a reasonable line length for readability is a good idea."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Rigidly limiting code to a specific number of characters, adding extra line wraps (that impair readability) just to comply with such an arbitrary stricture is not sensible."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["(It could be worse.", "You could be in a Java project with those insaneLongJavaNames combined with 80 column limits and 8-column tabs.", "Unreadable over-wrapped madness."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Short lines are easier to read - this is why most books have line lengths in the 60-80 character range, and newspapers break their text up into multiple columns to keep the line length down.", "If the lines are too long then I think the eyes become strained from moving that distance left-to-right, and has more trouble staying on the same line."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]