[[{"text": ["OpenCV is probably your best bet for a library; you have your choice of wrappers for them.", "I looked at the SWIG wrapper that comes with the standard OpenCV install, but ended up using ctypes-opencv because the memory management seemed cleaner."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "ctypes-opencv", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://code.google.com/p/ctypes-opencv/"}]}, {"text": ["They are both very thin wrappers around the C code, so any C references you can find will be applicable to the Python. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["OpenCV is huge and not especially well documented, but there are some decent samples included in the samples directory that you can use to get started.", "A searchable OpenCV API reference is here."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cs.indiana.edu/cgi-pub/oleykin/website/OpenCVHelp/"}]}, {"text": ["You didn't mention if you were looking for online or print sources, but I have the O'Reilly book and it's quite good (examples in C, but easily translatable)."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "O'Reilly", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9780596516130/"}]}, {"text": ["The FindContours function is a bit similar to regionprops; it will get you a list of the connected components, which you can then inspect to get their info."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "FindContours", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cs.indiana.edu/cgi-pub/oleykin/website/OpenCVHelp/ref/OpenCVRef%5FCv.htm#decl%5FcvFindContours"}]}, {"text": ["For thresholding you can try Threshold.", "I was sure you could pass a flag to it to use Otsu's method, but it doesn't seem to be listed in the docs there."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Threshold", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cs.indiana.edu/cgi-pub/oleykin/website/OpenCVHelp/ref/OpenCVRef%5FCv.htm#decl%5FcvThreshold"}]}, {"text": ["I haven't come across specific functions corresponding to gray2ind, but they may be in there."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["documentation: A few years ago I used OpenCV wrapped for Python quite a lot.", "OpenCV is extensively documented, ships with many examples, and there's even a book.", "The Python wrappers I was using were thin enough so that very little wrapper specific documentation was required (and this is typical for many other wrapped libraries).", "I imagine that a few minutes looking at an example, like the PyCV unit tests would be all you need, and then you could focus on the OpenCV documentation that suited your needs."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "book", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9780596516130/"}]}, {"text": ["analysis: As for whether there's a better library than OpenCV, my somewhat outdated opinion is that OpenCV is great if you want to do fairly advanced stuff (e.g.", "object tracking), but it is possibly overkill for your needs.", "It sounds like scipy ndimage combined with some basic numpy array manipulation might be enough."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "ndimage", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://docs.scipy.org/doc/scipy-0.7.x/reference/tutorial/ndimage.html"}]}, {"text": ["acquisition: The options I know of for acquisition are OpenCV, Motmot, or using ctypes to directly interface to the drivers.", "Of these, I've never used Motmot because I had trouble installing it.", "The other methods I found fairly straightforward, though I don't remember the details (which is a good thing, since it means it was easy)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I've started a website on this subject: pythonvision.org.", "It has some tutorials, &amp;c and some links to software.", "There are more links and tutorials there."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pythonvision.org", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pythonvision.org"}]}], [{"text": ["You probably would be well served by SciPy.", "Here is the introductory tutorial for SciPy.", "It has a lot of similarities to Matlab.", "Especially the included matplotlib package, which is explicitly made to emulate the Matlab plotting functions.", "I don't believe SciPy has equivalents for the functions you mentioned.", "There are some things which are similar.", "For example, threshold is a very simple version of graythresh.", "It doesn't implement \"Otsu's\" method, it just does a simple threshold, but that might be close enough."], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "SciPy", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.scipy.org/"}, {"text": "introductory tutorial", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.scipy.org/Getting%5FStarted"}, {"text": "threshold", "tag": "a", "pos": 6, "childList": [], "childNum": 0, "href": "http://docs.scipy.org/doc/scipy-0.7.x/reference/generated/scipy.stsci.image.threshhold.html#scipy.stsci.image.threshhold"}]}, {"text": ["I'm sorry that I don't know of any tutorials which are closer to the task you described.", "But if you are accustomed to Matlab, and you want to do this in Python, SciPy is a good starting point."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "SciPy", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.scipy.org/"}]}], [{"text": ["I don't know much about this package Motmot or how it compares to OpenCV, but I have imported and used a class or two from it.", "Much of the image processing is done via numpy arrays and might be similar enough to how you've used Matlab to meet your needs."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Motmot", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.astraw.com/projects/motmot/"}]}], [{"text": ["I've acquired image from FW camera using .NET and  IronPython.", "On CPython I would checkout ctypes library, unless you find any library support for grabbing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]