[[{"text": ["There's actually a handy set of libraries and modules for Python, pygame, that is extremely useful, well documented and has a ton of community support and a lot of fun games have been built with it.", "And the best part, to answer part of your question, is that OpenGL is not required."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "pygame", "tag": "a", "pos": 0, "childList": [{"text": "pygame", "tag": "code"}], "childNum": 1, "href": "http://www.pygame.org/wiki/about"}, {"text": "pygame", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"text": ["And, because it's based on Python, it's highly portable.", "Of course there are lots of challenges that come with that sort of project, but be patient and stick with it and you can learn a lot and have a lot of fun too."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["C++ is a really powerful language and there are lots of things you can do with it, and people who are experienced with C++ will say that you should learn it, and they are right because it's not going away any time soon, but you're correct in holding off a little.", "If you end up really enjoying developing with Python then there's nothing stopping you from picking up C++ later on and enjoying them together."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Above all read, practice and enjoy what you do."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I agree with newlymintedcocoaguy something such as Pygame is the way to go in your situation.", "But to awnser your second question, you can make 2D games in C++ without the use of OpenGL/DirectX.", "I have done this in the past using the Windows libraries for bitmaps, RECTS etc.", "I assume Linux will have similiar functionality.", "Though if you want your game to be cross platform then OpenGL is probably the way to go."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I have written several small propgrams and games with C++ and Python, and for starters I can recommend using Python until you have learned how a game is built."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Of course, I don't know what type of games you want to create, but fory many small 2D games the efficiency of Python is enough, so you don't have to deal with the complexity of C++."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The libraries I can recomend for Python are either Pygame (as we have already heard) and (even better, in my opinion) pyglet, which is a more sophisticated tool for 2D graphics (it uses OpenGL in the background)."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "pyglet", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pyglet.org/"}]}, {"text": ["For 2D games written in C++,  I can highly recommend ClanLib, an Open Source game engine with a large and active community, giant codebase and many examples.", "I supports both Software and OpenGL rendering, and is compilable for Windows/Linux/MacOSX.", "You should definitely give it a try!"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "ClanLib", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://clanlib.org/wiki/Main_Page"}]}, {"text": ["Good luck :)"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["As someone whose familiar with the \"I'm new, I want to do X, what should I learn?", "\" thing, having done it quite recently, I'd say stick with Python for now.", "As others have mentioned, there are some decent libraries like PyGame out there, and C++ is well, a little complex."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you're learning both how to put the parts together to make a game and tangling with the language, it starts getting difficult to untangle which one is actually causing your particular problem.", "And its always possible, once you have a good feel for what you are doing to learn a new way to do it by picking up C++."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "and", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["For portable C++ games for beginners, I'd go with the SDL.", "It gives access to OpenGL, check the tutorials!", "You may probably even use it from python with the aforementioned Python-to-C binding libraries."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "SDL", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.libsdl.org/"}, {"text": "tutorials", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.libsdl.org/opengl/index.php"}]}], [{"text": ["i will recommend c++.", "Many people say that its difficult, true to some extent, but you can make a good 2d game in c++, without getting into the 'difficult' part.", "And for this you will need a library like SDL , SFML etc.", "Its worth your time, if you learn C++, at least you will never run in performance problem."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]