[[{"text": ["If all you want is a GUI, wxPython should do the trick."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you're looking to add sound, controller input, and take it beyond a simple card game, then you may want to use pygame."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I haven't used wxPython, but Pygame by itself is rather low-level.", "It allows you to catch key presses, mouse events and draw stuff on the screen, but doesn't offer any pre-made GUI controls.", "If you use Pygame, you will either have to write your own GUI classes or use existing GUI extensions for Pygame, like Phil's Pygame Utilities."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Phil's Pygame Utilities", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.imitationpickles.org/pgu/wiki/index"}]}], [{"text": ["The answers to this related question may be very useful for you:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["What can Pygame do in terms of graphics that wxPython can't?"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "What can Pygame do in terms of graphics that wxPython can't?", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/343505/what-can-pygame-do-in-terms-of-graphics-that-wxpython-cant"}]}], [{"text": ["Generally, PyGame is the better option for coding games.", "But that's for the more common type of games - where things move on the screen and you must have a good \"frame-rate\" performance. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For something like a card game, however, I'd go with wxPython (or rather, PyQt).", "This is because a card game hasn't much in terms of graphics (drawing 2D card shapes on the screen is no harder in wx / PyQt than in PyGame).", "And on the other hand, you get lots of benefits from wx - like a ready-made GUI for interaction. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In Pygame you have to create a GUI yourself or wade through several half-baked libraries that do it for you.", "This actually makes sense for Pygame because when you create a game you usually want a GUI of your own, that fits the game's style.", "But for card games, most chances are that wx's standard GUI widgets will do the trick and will save you hours of coding."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'd say pygame -- I've heard it's lots of fun, easy and happy.", "Also, all of my experiences with wxPython have been sad an painful."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But I'm not bias or anything."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["pygame is the typical choice, but pyglet has been getting a lot of attention at PyCon.", "Here's a wiki entry on Python Game libraries: http://wiki.python.org/moin/PythonGameLibraries"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://wiki.python.org/moin/PythonGameLibraries", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/PythonGameLibraries"}]}]]