[[{"text": ["Help wanted on Sourceforge has some projects looking for python developers."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Help wanted on Sourceforge", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://sourceforge.net/people/?category_id=1"}]}], [{"text": ["Oh, I think I misinterpreted your question earlier."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["How about looking through bitbucket or github, and forking anything that catches your interest?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["When I am starting a new language, I often tackle the same sort of problems I'm familiar with in the languages I know.", "You might port the utility functions or libraries you use on other projects.", "For instance, I make websites that display info from the APIs of other sites, so when starting with Python, I ported over code that makes HTTP calls and builds query strings.", "Next I familiarized myself with how people produce output for the browser in Python (Django, in my case).", "Now that I've done a few projects in Python, I'm approaching Scala in the same way."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I don't think you'll find that many projects that need small pieces of code written, because that is easy to do and so it is usually done by the project members early on.", "Actually contributing to a project usually requires more reading than writing, and the same is true for learning a new language.", "In a project that is new and has few members you could find opportunity to help, but new projects don't always have good code to learn from, so I wouldn't recommend them."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Personally, I would try to find a project that has elements that you believe will be useful when you'll start your own.", "Things to consider:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "Desktop app or for web", "tag": "none", "senID": 2}, {"text": "Specific libraries", "tag": "none", "senID": 3}, {"text": "Database connections", "tag": "none", "senID": 4}, {"text": "Graphics handling", "tag": "none", "senID": 5}, {"text": "Specific algorithms", "tag": "none", "senID": 6}]}, {"text": ["All these points can help you find an opensource project that could be helpful for you to get started on the language and learn useful things that you can leverage for your own work."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["If you know more about your future project, we could help you find relevant opensource python code."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["Since you're already skilled in other programming languages, it might be fun to contribute to Rosetta Code."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Rosetta Code", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rosettacode.org/wiki/Main_Page"}]}, {"text": ["Rosetta Code is an open Wiki where individuals contribute solutions to same set of tasks in as many different languages as possible.", "It allows people to compare languages very effectively."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Here's the list of Tasks not yet implemented in Python.", "Your efforts here could significantly advance other people's learnings."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Tasks not yet implemented in Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rosettacode.org/wiki/Reports:Tasks_not_implemented_in_Python"}]}], [{"text": ["Take a program you've already written, and rewrite it in Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["This is the first site I always go to.", "Its a ton of fun and gets you thinking quickly."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://projecteuler.net/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://projecteuler.net/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://projecteuler.net/"}]}, {"text": ["From the site:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I would still suggest you look through the whole Python doc site.", "Take the tutorial, read the library references etc.", "Even though your project has not started, but once it starts, you will have ample knowledge of Python to start designing and coding."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python doc site", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/doc/"}]}]]