[[{"text": ["Django has not moved over to 3.0.", "That is all I need to know."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Most of the answers in these questions echo the same sentiments.", "Aside from Django, too many frameworks/libraries - WxPython, PyGame, Django, etc - have still not adopted it.", "I'm sure as hell not making the move until they do."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Because major libraries that my codebase depends upon have not released a 3.x version.", "(wxPython, matplotlib, numpy, etc."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So the responsibility goes upstream from my point of view."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If all my dependencies were 3.x compatible, I'd probably have switched by now."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [], [{"text": ["3rd party tools and libraries.", "I'm having trouble making some things work under 2.6 (not a LOT of trouble, mind you, but some."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As I see it, the ecosystem is one of Python's biggest strengths, and going to 3.0 at this point chucks a lot of that out the window.", "(In a year, I'm sure the story will be totally different."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["(Obviously, there's a chicken and egg problem here, but fortunately it's not my problem to solve, so I'll stay with 2.6 for a while."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I think you answered your own question here.", "The lack of backwards compatibility makes 3.0 a much harder sell than a seamless upgrade because you have to adjust your thinking and discard some programming techniques to use the new version.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Call me back when they have an upgrade script for my brain."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Because the default installation of 2.5 on Mac OSX Leopard works just fine.", "I have no need to upgrade and I see no advantage to upgrading except an end to the woes of unicode."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you are interested to move to Py3k one interesting way would be to write code in Py3k and use a 3to2 script which is being written now as a part of Google Summer of code project, on the lines of 2to3 script."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The operating system I use the most, Debian, does not have a Python 3 package, not even in the \"unstable\" (brand new) branch.", "Unless I compile it myself (which is quite 20th century), it means no Python3 to me."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I bet it is the same issue with many operating systems."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Unfortunately, for the same reason as most others have said - 3rd party libraries still not having been made 3.0 compatible.", "For this reason, as well as that some GNU/Linux distributions (Ubuntu in my case) still comes with Python 2.6, I can't completely throw 2.x out the window yet."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, the change to 3.0 is not a major one IMO.", "Except for \"print\" being a function and the new string formatting system, it's really more or less the same as before."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["In fact, I find that most of my old scripts (those that do not depend on 3.0 incompatible 3rd party libraries) will work flawlessly in 3.0 after I update all the prints and string formatting.", "In some cases I've also had to change some module names (specifically stuff from the \"email\" module), but other than that nothing major."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Also, all the scripts I have updated for 3.x compatibility so far still seem to work flawlessly in 2.6 (but not older 2.x of course, as they lack the new 3.x syntax)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The main reason I am not switching is that so many books and coding challenge websites are still 2.x.", "I installed 3.x and realized very quickly that I had to uninstall and go to 2.x."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Because of the lack of backward compatibility, switching is hard, especially if there is C code involved.", "And although I understand the unicode/string thing may be very useful to some people, I certainly don't care about it myself. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Basically, Py3k did not solve many problem that I care about (distribution issues, versioning of modules, simplified import model)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Python 3+ does not support numpy.", "Correction: it now does.", "As it now supports mathplotlib."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Correction:", "childNum": 0, "tag": "b", "pos": 1, "childList": []}]}]]