[[{"text": ["You're not using timeit correctly: the argument to -s (setup) is a statement to be executed once initially, so you're really just testing an empty statement.", "You want to do"], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "timeit", "tag": "a", "pos": 0, "childList": [{"text": "timeit", "tag": "code"}], "childNum": 1, "href": "http://docs.python.org/library/timeit.html"}, {"text": "timeit", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "-s", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}, {"code": "<pre>\n<code>\n $ python -m timeit -s \"jokes=range(1000000)\" \"domain=[(0,(len(jokes)*2)-i-1) for i in range(0, len(jokes)*2)]\"\n10 loops, best of 3: 1.08 sec per loop\n$ python -m timeit -s \"jokes=range(1000000)\" \"l=len(jokes);domain=[(0,(l*2)-i-1) for i in range(0, l*2)]\"\n10 loops, best of 3: 908 msec per loop\n$ python -m timeit -s \"jokes=range(1000000)\" \"l=len(jokes*2);domain=[(0,l-i-1) for i in range(0, l)]\"\n10 loops, best of 3: 813 msec per loop\n</code>\n</pre>\n", "senID": 1}, {"text": ["While the speedup is still not dramatic, it's more significant (16% and 25% respectively).", "So since it doesn't make the code any more complicated, this simple optimization is probably worth it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["To address the actual question... the usual rule of thumb in Python is to "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["One thing to watch out for: compared to many other languages, function calls are relatively expensive in Python which is why the optimization in your example made a difference even though len is O(1) for lists."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "len", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}], [{"text": ["Read this: Python Speed / Performance Tips"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python Speed / Performance Tips", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/PythonSpeed/PerformanceTips"}]}, {"text": ["Also, in your example, the total time is so short that the margin of error will outweigh any actual difference in speed."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["This applies to all programming, not just Python:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And I would even add not to bother doing any of that unless you have a slowness issue that is causing you pain."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And perhaps most important is that Unit tests will help you during the actual process."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["On a tangentially related note, chaining together generators is much more efficient than chaining together list comprehensions, and often more intuitive."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As for the developer's rules of thumb for optimization in Python, they're the same as they are in all languages."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["len for lists is O(1).", "It doesn't need to scan the whole list to find the length, because the size of the list is stored for lookup.", "But apparently, it is still slightly faster to extract it into a local variable.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To answer your question though, I would never care about performance variations on the order of 5%, unless I was doing some crazy tight inner loop optimizations in some simulation or something.", "And in that case, you could speed this up much more by not using range at all."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["The most important thing to do is to write idiomatic, clear, and beautiful Python code.", "Many common tasks are already found in the stdlib, so you don't have to rewrite a slower version.", "(I'm thinking of string methods and itertools specifically here.", ") Make liberal use of Python's builtin containers, too.", "dict for example has had \"the snot optimized\" out of it, and it's said that Python code using dicts will be faster than plain C!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If that's not already fast enough, there are some hacks you can use, but it's also signal that you probably should be offloading some work to C extension modules."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Regarding list comprehensions: CPython is able to do a few optimizations over regular accumulator loops.", "Namely the LIST_APPEND opcode makes appending to a list native operation."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I have a program that parses log files and generates a data warehouse.", "A typical run involves around 200M log file lines, and runs for the better part of a day.", "Well worth optimizing!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Since it's a parser, and parsing some rather variable and idiosyncratic and untrustworthy text at that, there are around 100 regular expressions, dutifully re.compiled() in advance, and applied to each of the 200M log file lines.", "I was pretty sure they were my bottleneck, and had been pondering how to improve that situation.", "Had some ideas: on the one hand, make fewer, fancier REs; on the other, more and simpler; stuff like that."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I profiled with CProfile, and looked at the result in \"runsnake\"."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["RE processing was only about 10% of code execution time.", "That's not it!"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["In fact, a large square blob in the runsnake display instantly told me that about 60% of my time was spent in one of those infamous \"one line changes\" I'd added one day, eliminating non-printing characters (which appear occasionally, but always represent something so bogus I really don't care about it).", "These were confusing my parse and throwing exceptions, which I did care about because it halted my day of log file analysis."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "did", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["There you go: that line touches every byte of every one of those 200M lines (and the lines average a couple hundred bytes long).", "No wonder it's 60% of my execution time!"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "byte", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["There are better ways to handle this, I now know, such as str.translate().", "But such lines are rare, and I don't care about them anyway, and they end up throwing an exception: now I just catch the exception at the right spot and skip the line.", "Voila!", "the program's around 3X faster, instantly!"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["So the profiling"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["The problem was slow data retrieval in a GUI app.", "I gained a 50x speedup by adding an index to the table, and was widely hailed as a hero and savior."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]