[[{"text": ["As I said in comment, you must start by finding what part of your code is slow."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Nobody can help you without this information."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You can profile your code with the Python profilers then go back to us with the result."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Python profilers", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/profile.html"}]}, {"text": ["If it's a Web app, the first suspect is generally the database.", "If it's a calculus intensive GUI app, then look first at the calculations algo first."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["But remember that perf issues car be highly unintuitive and therefor, an objective assessment is the only way to go."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["ok, not entirely to the point, but before you go and start fixing it, make sure everyone understands the situation.", "it seems to me that they're putting some pressure on you to fix the \"problem\"."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["well first of all, when you wrote the application, have they specified the performance requirements?", "did they tell you that they need operation X to take less than Y secs to complete?", "Did they specify how many concurrent users must be supported without penalty to the performance?", "If not, then tell them to back off and that it is iteration (phase, stage, whatever) one of the deployment, and the main goal was the functionality and testing.", "phase two is performance improvements.", "let them (with your help obviously) come up with some non functional requirements for the performance of your system."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["by doing all this, a) you'll remove the pressure applied by the finance team (and i know they can be a real pain in the bum) b) both you and your clients will have a clear idea of what you mean by \"performance\" c) you'll have a base that you can measure your progress and most importantly d) you'll have some agreed time to implement/fix the performance issues."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["PS.", "that aside, look at the indexing... :)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["A surprising feature of Python is that the pythonic code is quite efficient...", "So a few general hints:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "Use built-ins and standard functions whenever possible, they're already quite well optimized.", "tag": "none", "senID": 1}, {"text": "Try to use lazy generators instead one-off temporary lists.", "tag": "none", "senID": 2}, {"text": "Use numpy for vector arithmetic.", "tag": "none", "senID": 3}, {"text": "Use psyco if running on x86 32bit.", "tag": "none", "senID": 4}, {"text": "Write performance critical loops in a lower level language (C, Pyrex, Cython, etc.).", "tag": "none", "senID": 5}, {"text": "When calling the same method of a collection of objects, get a reference to the class function and use it, it will save lookups in the objects dictionaries (this one is a micro-optimization, not sure it's worth)", "tag": "none", "senID": 6}]}, {"text": ["And of course, if scalability is what matters:"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "Use ", "tag": "none", "senID": 8}, {"text": "Write multiprocessor aware code. At some point you'll need to throw more computing power at it, and your software must be ready to use it!", "tag": "none", "senID": 9}]}], [{"text": ["before you can \"fix\" something you need to know what is \"broken\".", "In software development that means profiling, profiling, profiling.", "Did I mention profiling.", "Without profiling you don't know where CPU cycles and wall clock time is going.", "Like others have said to get any more useful information you need to post the details of your entire stack.", "Python version, what you are using to store the data in (mysql, postgres, flat files, etc), what web server interface cgi, fcgi, wsgi, passenger, etc.", "how you are generating the HTML, CSS and assuming Javascript.", "Then you can get more specific answers to those tiers."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You may be interested in this document I've found some time ago.", "As personal advice, be as more pythonic as you can: lazy evaluation is the keyword, so learn to use iterators and generators."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "this document", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/PythonSpeed/PerformanceTips"}, {"text": "lazy evaluation", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}], [{"text": ["For the type of application you are describing (a web application probably backed by a database) your performance problems are unlikely to be language specific.", "They are far more likely to stem from design or architecture issues, though they could be simple coding problems too."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "unlikely to be language specific", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "stem from design or architecture issues", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}, {"text": ["To sort this out you need to figure out where the bottlenecks are in your application and for that you need some sort of profiler."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "profiler", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/profile.html"}]}, {"text": ["Once you have found your bottlenecks you will be in a much better position.", "You can evaluate then problem areas for common issues including:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Design and Architecture issues", "tag": "none", "senID": 3}, {"text": ["SQL anti-patterns"], "childNum": 0, "tag": "a", "senID": 4, "childList": []}, {"text": "Incorrect usage of your framework (perhaps relying on inappropriate defaults)", "tag": "none", "senID": 5}, {"text": ["Badly structured algorithms"], "childNum": 0, "tag": "a", "senID": 6, "childList": []}]}, {"text": ["The specifics of any solution are going to depend on the specifics of the bottlenecks your find."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "The specifics of any solution are going to depend on the specifics of the bottlenecks your find.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["http://wiki.python.org/moin/PythonSpeed/PerformanceTips"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://wiki.python.org/moin/PythonSpeed/PerformanceTips", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/PythonSpeed/PerformanceTips"}]}, {"text": ["I optimized some python code a while back, the most surprising thing to me was how much each function call costs.", "If you minimize function calls or replace loops with builtins you'll be running much faster."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["There are some great suggestions here… So let me suggest an implementation detail.", "I have found the runprofileserver command found in django-command-extensions very convenient for profiling my Django code."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "runprofileserver", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"href": "http://code.google.com/p/django-command-extensions/", "text": "django-command-extensions", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["I am not sure if this would solve the problem but you should have a look at psyco"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "psyco", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://psyco.sourceforge.net/"}]}]]