[[{"text": ["Is this what you're looking for?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://code.djangoproject.com/wiki/DjangoSuccessStories"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://code.djangoproject.com/wiki/DjangoSuccessStories", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.djangoproject.com/wiki/DjangoSuccessStories"}]}, {"text": ["Or are you looking for this list?", "http://www.djangosites.org/ "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://www.djangosites.org/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.djangosites.org/"}]}, {"text": ["Here are Django powered sites in rating order: http://www.djangosites.org/highest-rated/"], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "http://www.djangosites.org/highest-rated/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangosites.org/highest-rated/"}]}, {"text": ["How about Django sites focused on \"business\": http://www.djangosites.org/tag/business/ is that \"Enterprise\" enough?"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "http://www.djangosites.org/tag/business/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangosites.org/tag/business/"}]}, {"text": ["We do econometric data processing with Django.", "High volume transactions.", "Is that \"enterprise\" enough?"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["http://grono.net/ is a polish equivalent of Facebook and is used by a quite a few people (at some point it was a few million, now it's less, due to FB popularity).", "It works on distributed Django."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://grono.net/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://grono.net/"}]}], [{"text": ["Yes, Django is used in the \"enterprise world\".", "The good description of pros, cons and the related development efforts can be found here:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://groups.google.com/group/django-developers/browse_thread/thread/c89e028a536514d3"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://groups.google.com/group/django-developers/browse_thread/thread/c89e028a536514d3", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://groups.google.com/group/django-developers/browse_thread/thread/c89e028a536514d3"}]}], [{"text": ["For the systems you want to replace, you may find that it is desirable to use something more powerful than Django's ORM like SQLAlchemy.", "It's not a question of scaling, but the fact is that Django's ORM makes it hard to build complex queries and often pushes you to do in Python what should be done by your RDBMS — when you don't have to resort to raw SQL.", "Although SQLAlchemy has a steeper learning curve, it has more features and is better suited to complex database operations.", "It's certainly worth your time to have a look at it before deciding on a web stack to build on."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This is probably less relevant to your questions but all the functionality in Django is also provided by other libraries that I find to be superior : Jinja2 for templating (it has the same syntax as Django templates without the mess that is the template tags system and better performance), WTForms for forms and modelforms, Babel for i18n (with many features not present in Django's own i18n library) and Werkzeug to provide a complete WSGI interface with URL routing."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["My company uses Python/Django as a base for our Intramas Platform.", "An entreprise grade web application platform that is deployed to about a dozen large clients. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Built in features include central contact management, document generator, extra security layers, default GUI for rapid application design (no messing with Django admin interface!", "). "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Overall we are very pleased with Django as a base for our development, it is very extensible and the release cycle produces solid code (we upgrade often)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["While our site (http://www.sinax.be) is in Dutch and not very extensive at the moment you can always contact me for more information."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["One of the biggest drawbacks in django is that although in theory the concept of applications being self-contained sounds nice, in practice it really doesn't work that well; even if you find some app that provides functionality that you need - it is not always easy to plug it in and go - you will always need to edit/hack at it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Evaluating django as a central platform at my work for developing pluggable apps led to a few roadblocks:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["All these things have led me to look at Java portal servers as my \"platform\" and specifically Liferay as it has Python support."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I suggest you look at the big picture first before you commit yourself to django.", "I really love the framework, and I use it all the time on one-off projects, but as a central platform for developing all that we may need - django is not the answer for us."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I have now delegated django for self contained projects - like some specific mini-site for a department.", "If we need to use Python for something else, I now evaluate Pyramid as its more pluggable.", "For anything that needs integration beyond our department, I look at Java."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["If all that fails - only then do we go to .NET."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}]]