[[{"text": ["Think in terms of a \"logical unit of packaging\" -- which may be a single class, but more often will be a set of classes that closely cooperate.", "Classes (or module-level functions -- don't \"do Java in Python\" by always using static methods when module-level functions are also available as a choice!-) can be grouped based on this criterion.", "Basically, if most users of A also need B and vice versa, A and B should probably be in the same module; but if many users will only need one of them and not the other, then they should probably be in distinct modules (perhaps in the same package, i.e., directory with an __init__.py file in it)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "__init__.py", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}, {"text": ["The standard Python library, while far from perfect, tends to reflect (mostly) reasonably good practices -- so you can mostly learn from it by example.", "E.g., the threading module of course defines a Thread class... but it also holds the synchronization-primitive classes such as locks, events, conditions, and semaphores, and an exception-class that can be raised by threading operations (and a few more things).", "It's at the upper bound of reasonable size (800 lines including whitespace and docstrings), and some crucial thread-related functionality such as Queue has been placed in a separate module, nevertheless it's a good example of what maximum amount of functionality it still makes sense to pack into a single module."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "threading", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "Thread", "childNum": 0, "tag": "code", "pos": -1, "childList": []}]}], [{"text": ["If you want to stick to your one-class-per-file system (which is logical, don't get me wrong), you might do something like this to avoid having to refer to automobile.Automobile:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "automobile.Automobile", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"code": "<pre>\n<code>\n from automobile import Automobile\ncar = Automobile()\n</code>\n</pre>\n", "senID": 1}, {"text": ["However, as mentioned by cobbal, more than one class per file is pretty common in Python.", "Either way, as long as you pick a sensible system and use it consistently, I don't think any Python users are going to get mad at you :)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["In a mid-sized project, I found myself with several sets of closely related classes.", "Several of those sets are now grouped into files; for example, the low-level network classes are all in a single network module.", "However, a few of the largest classes have been split out into their own file."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "network", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["Perhaps the best way to start down that path from a one-class-per-file history is to take the classes that you would normally place in the same directory, and instead keep them in the same file.", "If that file starts looking too large, split it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["If you are coming from a c++ point of view, you could view python modules akin to a .so or .dll.", "Yeah they look like source files, because python is scripted, but they are actually loadable libraries of specific functionality. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Another metaphor that may help is you might look python modules as namespaces."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["As a vague guideline: more than 1 class per file is the norm for python"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["also, see http://stackoverflow.com/questions/106896/how-many-python-classes-should-i-put-in-one-file"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://stackoverflow.com/questions/106896/how-many-python-classes-should-i-put-in-one-file", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/106896/how-many-python-classes-should-i-put-in-one-file"}]}], [{"text": ["\"class\" is a logical concept; while \"file\" is a physical one.", "Should there be a one-to-one correspondence between a logical and a physical construct (i.e., one class per one file)?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For instance, the integer ONE is a logical concept.", "But it can be represented in many ways (decimal, binary, roman, etc).", "So it is simply up to usability, convention, intuition to determine the \"right\" way of \"making a logical construct a physical one.", "\" The \"right\" way being not purely logical."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And yet I can't think of a logical reason for NOT forcing humanity to subscribe to only one representation when thinking/using the concept of the integer ONE. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]