[[{"text": ["Find a local charitable orgainzation with a lousy web presence.", "Solve their problem.", "Help other people.", "Learn more Python.", "Everyone wins. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You can also invent a game and code it with pygame.", "They're always fun to code and you still learn a lot when you code a game."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["What are you interested in doing?", "You could write a whole host of database programs, for keeping track of recipes, cd's, contacts, self tests, etc...."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Basically make code to load/save to a database and enforce some business rules, then expose it by a web service.", "Then make both a web front end and an application graphical front end (using TK/WxWidgets/Qt (4.5 will be LGPL YAY)) that talk with the web service."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["That should give you practice with creating/talking with web services (something more and more companies are doing) along with both main ways of creating a GUI."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You could try to replicate an application that is impressive to you just for the sake of guessing how it works behind the scene. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If I had to do that, I'd probably try to clone the following webapps using Django:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["BaseCamp"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}, {"text": ["dPaste"], "childNum": 0, "tag": "a", "senID": 3, "childList": []}, {"text": ["Reddit"], "childNum": 0, "tag": "a", "senID": 4, "childList": []}, {"text": ["Mint.com"], "childNum": 0, "tag": "a", "senID": 5, "childList": []}]}], [{"text": ["Anything that hasn't been done to death... no need for yet another clone of popular app x"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["What I like to do is(with my ti 83) instead of doing all my math by hand I like to program my calculator ti di the problem then do the rest of the problems with the new program.", "It's fun and you get your homework done so you could do this in python for a fun project(s)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Here at stackoverflow there are already people asking for solutions to their problems:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["e.g.", ": If you are interested in GUI programming: thumbnailctrl"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "thumbnailctrl", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/215052/efficient-image-thumbnail-control-for-python#455191"}]}], [{"text": ["Consider something that does the following:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "is multi threaded and preferably include need for synchronization", "tag": "none", "senID": 1}, {"text": "reads/writes data to a remote database (or even local database)", "tag": "none", "senID": 2}, {"text": "reads from a web service and includes xml parsing", "tag": "none", "senID": 3}, {"text": "outputs xml/ html", "tag": "none", "senID": 4}]}, {"text": ["There are a number of example projects you could do, but if you accomplish all the above, then it will surely give sufficient exposure."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["If I had the time to code something just for the fun and the experience, I would personally start an open source project for something that people need and which does not already exist."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You can search the Web for a list of missing opensource projects, or you can base it on your own experience (for example, I would personally love to have some way to synchronize my iPhone with thunderbird+lightning : I hear there's a solution through Google Calendars, but I would like a solution without external servers)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think the best thing you can do now is spend time learning a new technology, preferably including a new programming language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]