[[{"text": ["This.", "Keep it the way you have it. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Personally I find it easier to keep things like this in a single file, just for the practicality of editing a smaller number of files in my editor."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The important thing to do is treat the different pieces of code as though they were in separate files, so you ensure that you can trivially separate them later, for the reasons you cite.", "So for instance, don't introduce dependencies between the different pieces that will make it hard to disentangle them later."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "treat", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Off course you can have as many modules as you like."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But now let as think a little, what happens when we put every small code snippet into one single file."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["We will end up in hundreds of import statements in any less trivial module.", "And off course you could also save a little by having all explicit in seperated files.", "But guess what: Nobody can remember so many module names and you might end up in searching for the right file anyway ..."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I try to put things that belong together in one single file (unless it becomes to big!).", "But when I have small functions or classes that do not belong to other components in my system, I have \"util\" modules or the like.", "I also try to group these for example according to my application layering or seperate them by other means.", "One seperation criteria could be: Utilities that are used for UI and those that are not."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["As a user of modules, I greatly prefer when I can include the entire module via a single import.", "Don't make a user of your package do multiple imports unless there's some reason to allow for importing different alternates."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["BTW, there's no reason a single modules can't consist of multiple source files.", "The simplest case is to use an __init__.py file to simply load all the other code into the module's namespace."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "__init__.py", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/tutorial/modules.html#packages"}]}], [{"text": ["For command line scripts there most likely will not be much difference unless each invocation invokes all files in the module, in which case there will be a slight performance cost as n files need to be opened vs one."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For mod_python there most likely will be no difference as byte-compiled modules stay alive for the duration of the apache process."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For google app engine though there will be a performance hit unless the service is constantly used and is \"hot\" as each cold start would require opening all files."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Small.              "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]