[[{"text": ["Before learning either of these, spend some real time and learn HTML and CSS in depth.", "Also learn Javascript and JQuery (or your favorite client side library).", "The O'Reilly books on the topic are pretty much all good IMO."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I say that because I think that you'll find that for most modern web sites, a lot of richness is moving to the client side, and away from the server side.", "Under this model, your code in PHP or JSP is probably going to look pretty similar (ie, fetch data from the database and serve it to your view or into JSON for the client to consume)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Considering you're used to c++, should look at aspx and c# - probably closer to your current experience."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["That said, PHP is a doddle, so it shouldn't present any challenges.", "Bear in mind that if you want to get the most from the language, you absolutely have to learn a little bit about configuring apache, and frameworks (cake, codeigniter, zend etc)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["All the server-side technologies you list are \"sufficient\" for the volume of traffic you expect, if you design the site well from a performance and scaling viewpoint -- and so do many others you haven't mentioned, such as other Java-based approaches, C# ones, and (last but not least) Ruby (probably with Rails, though, like the other languages, it has several frameworks for you to choose from)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As most everybody said, the client-side considerations are sharper -- unless you want to try a \"server-side generator of client-side code\" like gwt (I'm told the latter works well, but personally I'm always wary of code generators, esp.", "using a code generator w/o understanding of the \"code\" it makes for you, which in this case is HTML, CSS, and Javascript with its own framework).", "Except for GWT and similar approaches (if that's your chosen poison), really learning HTML, CSS and Javascript is really a must -- and then you get to choose among many, many frameworks again (jQuery, Dojo, closure, etc, etc)."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "gwt", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/webtoolkit/"}, {"text": "closure", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://code.google.com/closure/"}]}, {"text": ["For performance issues, you really want to study Steve Souders' site (and books, etc) -- Steve was a server-side guru until measurement showed him the bottleneck was really client-side, and then he turned himself into the client-side performance wizard;-).", "But to get the most out of the books you'll need understanding of HTTP, HTML, etc, etc, to start with;-)."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "site", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stevesouders.com/"}, {"text": "the", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}], [{"text": ["Hit's per day isn't a really useful metric for estimating performance.", "You really need to be concerned with the peak load and the acceptable response time."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["80-100k hits per day is an average of about 1 hit per second.", "The hits are not going to be evenly spread out, so for normal traffic you might expect a peak load of 10 hits per second."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you are going to promote the site with newsletters or commercials, expect to peack at 100's of hits per second."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you selling $1 air tickets, expect to peak at 1000's of hits per second."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Now the language you choose for the site isn't nearly as important as your choice of database (not necessarily relational) and the way you store the data in the database."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Scaling up frontends is relatively easy, so having really fast efficient HTML generation shouldn't be a primary concern.", "Pick a platform that is going to be efficient for development time."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I expect this question to be closed as being subjective.", "But, I'll put in my 2 cents."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["JSP would likely dovetail well with J2EE.", "(I've heard that it can be a bit rigid, but I have no experience to provide any insight on the matter."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["PHP is a good candidate, because it's popular.", "You can find a lot of info on the web."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Python isn't as popular for webdev, so finding examples won't be as easy."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I also second Dave Markle's opinion.", "If you want to learn webdev, HTML, CSS and JavaScript will be crucial as well.", "You may never want to be a front-end developer, but you can't get away from dealing with those technologies at some point."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["As was said in the previous answers you will for sure need to learn HTML, CSS and Javascript to get going on the client-side."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Now, if you already need to learn JavaScript, why don't use it on server side, too?", "Node.JS is a very high speed server using JavaScript.", "It may easily handle some 20k requests per second, even though it is only one process.", "The API is quite nice, JavaScript has loads of possibilities ('cause it's prototype based), there are implementations of MySQL interfaces, aso."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "very", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Furthermore I think JS by itself is a language worth learning."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["PS: I personally am using PHP.", "But that's only 'cause I always used it.", "As it is now, I am thinking about switching to Node.JS."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["It really isn't that similar to C++, but I would recommend PHP.", "You really can't expect a server-side scripting language to be similar to a compiled language like C++.", "Personally, I find PHP to be an ugly, messy looking language, but once you get into it, it's very rewarding.", "Other languages have too many drawbacks.", "ASP.Net is too Microsoft-centric, Python and Ruby on Rails are too obscure, and are also non-curly bracket languages, meaning it will require a lot of adjustment to change to them.", "Hope this helps. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["There are many options."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]