[[{"text": ["For cross-platform GUI-based desktop software, my preference is Qt -- solid, mature, rich, great tools, strong underlying event-like approach (signals and slots).", "Having Nokia behind it doesn't hurt, of course."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Qt", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://qt.nokia.com/products/"}]}, {"text": ["The mature Python interface to that is PyQt, but if the alternative of GPL or for-pay licenses is a problem for you, PySide is on the horizon (nowhere as mature as PyQt at this time, but by the time GPL'ing your software could possibly be a problem, PySide should be definitely ready for you;-).", "PySide is also sponsored by Nokia, according to this."], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "PyQt", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.riverbankcomputing.co.uk/software/pyqt/intro"}, {"text": "PySide", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.pyside.org/"}, {"href": "http://eli.thegreenplace.net/2009/08/19/pyside-nokia-sponsored-lgpl-bindings-to-qt/", "text": "this", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Beyond your choice of frameworks for GUI-based cross-platform desktop app development, of course, lie many, many other choices of tools and approaches -- but they're less crucial for solo development than they are for effective team cooperation, so, until teamwork is in prospect for you, it won't hurt to use whatever tools you find simplest (e.g., svn rather than a DVCS: I strongly recommend a DVCS such as hg, git or bazaar for team use, but for a solo developer I guess svn is still quite acceptable, and perhaps simpler to install and use)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["There are many answers to your question because you raise a number of issues:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Agile development is methodology and has very little to do with the language or software platform.", "It is more a set of principles around which software teams organize themselves.", "Refer to the works of Kent Beck for a bit more detail."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Do you have an existing Python code base?", "If you do have an existing Python code base you could get relatively far with pyHed.", "Otherwise you could look at something like Java Swing or C#. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["But really you might want to consider moving the application to a web platform - that seems to be the direction almost all desktop apps are heading.", "Django is well known Python framework.", "Or any number of the Java, C#, Ruby platforms if it strikes your fancy."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["The jquery JavaScript framework is a good tool to provide rich Web interfaces."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["For what is worth, last week with no previous experience in python itself..", "I managed to build a basic MVC app in about 4 days..", "I used wxpython &amp; wxglade "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I think that if you know what your functional needs are, with a bit of googling &amp; a bunch of reading other peoples code, you can produce very usable stuff in a very short time."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["http://www.wxpython.org/"], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "http://www.wxpython.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.wxpython.org/"}]}], [{"text": ["you could have a look at the camelot framework http://www.conceptive.be/projects/camelot/"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.conceptive.be/projects/camelot/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.conceptive.be/projects/camelot/"}]}, {"text": ["It provides a pyqt gui on top of sqlalchemy mapped classes.", "If you have questions, you can always\npost on our mailing list."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Erik"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["You might want to checkout http://dabodev.com/ too, I have no personally experience with it, just know of it existence and that there are a couple of enthusiasts."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://dabodev.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://dabodev.com/"}]}, {"text": ["I would recommend that you don't concentrate too much about Agile or XP coding, especially when you start out, good old big design up front will save your skin before you burn it with headless hacking. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["That being said, I usually start coding a prototype/proof-of-concept before I actually design it and consequently write unit-tests for the first release."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["But the most important advice I would like to give you is, keep yourself motivated and happy :-)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I'm one of the developers of pyHed.", "We know that pyHed's documentation is not very good yet, but we are working very hard in it (it's the main thread of 1.1 version).", "Having any doubt about pyHed please contact us in our forum, your question will be answered imediately..."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "forum", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.pyhed.com/forum%5Fus.html"}]}, {"text": ["Vinicius Berni - pyHed Team"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]