[[{"text": ["It might change when they offer paid plans, but as it stands, App Engine is not good for CPU intensive apps.", "It is designed to scale to handle a large number of requests, not necessarily a large amount of calculation per request.", "I am running into this issue with fairly minor calculations, and I fear I may have to start looking elsewhere as my data set grows."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["While I can not answer your question directly, my experience of building Microupdater (a news aggregator collecting a few hundred feeds on AppEngine) may give you a little insight."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Microupdater", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.microupdater.com"}]}, {"tag": "ul", "num": 2, "lis": [{"text": ["Fetching feeds.", "Fetching lots of feeds by cron jobs (it was the only solution until SDK 1.2.5) is not efficient and scalable, which has lower limit on job frequency (say 1 min, so you could only fetch at most 60 feeds hourly).", "And with latest SDK 1.2.5, there is XMPP API, which I have not implemented yet.", "The best promising approach would be PubSubHubBub, of which you offer an callback url and HubBub will notify you new entries in real-time.", "And there is an demo implementation on AppEngine, which you can play around."], "childNum": 4, "tag": "p", "senID": 1, "childList": [{"text": "XMPP API", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://drupal.org/project/xmpp"}, {"text": "PubSubHubBub", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://code.google.com/p/pubsubhubbub/"}, {"text": "real-time", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "demo implementation", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://pubsubhubbub.appspot.com/"}]}, {"text": ["Parsing feeds.", "You may already know that parsing feeds is cpu-intensive.", "I use Universal Feed Parser by Mark Pilgrim, when parsing a large feed (say a public google reader topic), AppEngine may fail to process all entries.", "My dashboard have a lot of these CPU-limit warnings.", "But it may result in my incapability to optimize the code yet."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Universal Feed Parser", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.feedparser.org/"}]}]}, {"text": ["Totally said, AppEngine is not yet an ideal platform for lifestream app, but that may change in future."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["(This is obviously pretty old, responding just because it still comes up really high in related Google queries...)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I just started using AppEngine and haven't been using it for tons of external requests.", "But I do know that the info above is probably a lot less valid now, and might not even still stand.", "They relaxed the limits quite a bit since September 08 - check Aral Balkan's blog for his initial complaint about the above, and later developments."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "check Aral Balkan's blog", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://aralbalkan.com/1975"}]}], [{"text": ["If you're app solely relies on Django, then App Engine is a good bet.", "However, if you ever need to add C-enhanced libraries, you're up a creek.", "App Engine doesn't support things like PIL or ReportLab, which use C to speed up processing times.", "I'm only mentioning this because you may want to use C to speed up some of your routines in the long run."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you decide to use a co-loc, check out WebFaction.com.", "They have great Django/Python support and they have no issue with you using the aforementioned lirbaries."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Take a look atSlice Host:  They sell xen based virtualized server instances starting at $20.00 / month..."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Take a look atSlice Host", "childNum": 1, "tag": "strong", "pos": 0, "childList": [{"text": "Slice Host", "tag": "a"}]}, {"href": "http://www.slicehost.com", "text": "Slice Host", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["It's great for starting a project on and scaling it out WITHOUT incurring the costs of a managed provider or colo."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["No.", "If you need to pull lots of things down, App Engine isn't going to work so well.", "You can use it as a front end by putting your data in their store after doing your offline preprocessing, but you can't do much in the ~1 second time you have per request without doing some really crazy things."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "really", "childNum": 0, "tag": "i", "pos": 2, "childList": []}]}, {"text": ["Your app would likely be better off on your own hosting."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Pulling feeds or doing calculations won't be a problem.", "But  you'll soon have to pay for your account.", "App engine includes Django, except you'll need to work with some adaptors for the model part.", "It will surely save you from maintenance headaches."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]