[[{"text": ["I would separate the work like this:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I've had this situation before and I used cronjobs.", "The HTTP script would just write in a queue a job to be performed (a DB or a file in a directory) and the cronjob would read it and execute that job."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You'll probably need to do a stdout.flush(), as the script isn't really writing anything yet to the webserver until you've written a page buffer's worth of data - which doesn't happen before the timeout."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "stdout.flush()", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}, {"text": ["But the proper way to solve this is, as others suggested, to do the processing in a separate thread/process, and show the user an auto-refreshed page which shows the status, with a progress bar or some other fancy visual to keep them from being bored."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["See Randal Schwartz's Watching long processes through CGI.", "The article uses Perl, but the technique does not depend on the language."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Watching long processes through CGI", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.stonehenge.com/merlyn/LinuxMag/col39.html"}]}], [{"text": ["Very similar question here.", "I suggest spawning off the lengthy process and returning an ajax based progress bar to the user.", "This way they user has the luxury of the web-interface and you have the luxury of no time-outs."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/510455/how-can-i-keep-an-ie-page-request-alive-more-than-1-minute"}]}], [{"text": ["imho the best way would be to run an independent script which posts updates somewhere (flat file, database, etc...).", "I don't know how to fork an independent process from python so i can't give any code examples."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To show progress on a WebSite implement an ajax request to a page that reads those status updates and for example shows a nice progress bar."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Add something like setTimeout(\"refreshProgressBar[...]) or meta-refresh for auto-refresh."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]