[[{"text": ["I can't point you to any article on how to do it, but I think there are a few libraries that can be good models on how to design your own."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["PyAws for example.", "I didn't see the source code so I can't tell you how good it is as code example, but the features and the usage examples in their website should be a useful design model"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "PyAws", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pyaws.sourceforge.net/"}]}, {"text": ["Universal Feed Parser is not a wrapper for a webservice (it's an RSS parser library), but it's a great example of a design that prioritizes usage flexibility and hiding implementation details.", "I think you can get very good usage ideas for your wrapper there."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Universal Feed Parser", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.feedparser.org/"}]}], [{"text": ["My favorite combination is httplib2 (or pycurl for performance) and simplejson.", "As REST is more \"a way of design\" then a real \"protocol\" there is not really a reusable thing (that I know of).", "On Ruby you have something like ActiveResource.", "And to be honest, even that would just expose some tables as a webservice, whereas the power of xml/json is that they are more like \"views\" that can contain multiple objects optimized for your application.", "I hope this makes sense :-)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["This tutorial page could be a good starting place (but it doesn't contain everything you need)."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "This tutorial page", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://learn-rest.blogspot.com/2008/02/using-rest-in-python.html"}]}], [{"text": ["You should take a look at PyFacebook.", "This is a python wrapper for the Facebook API, and it's one of the most nicely done API's I have ever used."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It would help to know about the service API you want to interface with.", "You say \"REST-style\" but that can mean many things these days, since almost no one actually means REST when they say it.", "The way you'd consume a real REST API is very different from the much more common RPC APIs."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You could checkout pythenic jobs, a nice, simple, but well-formed \"Python wrapper around the Authentic Jobs ... API\" as a good example.", "That's what I'm doing now :)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pythenic jobs", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://github.com/ryanmcgrath/pythentic_jobs"}]}]]