[[{"text": ["Foord and Muirhead's IronPython in Action is an amazingly good book, perfectly suitable for teaching Python to .NET folks as well as teaching .NET to Python folks.", "I may be biased, as I was a tech reviewer and Foord is a friend, but I've had other cases in the past where a friend wrote a book and I tech reviewed it -- and ended up deciding the book was just wrong and publicly saying so (way to lose friends, but, I just can't tell a lie, not where Python is concerned at least!-)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "IronPython in Action", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.manning.com/foord/"}]}, {"text": ["Edit: If you're forbidden from moving to IronPython (which would probably support your legacy apps just fine, btw), there are better answers: Mark Pilgrim's Dive into Python is often considered the best Python intro for the experienced developer, and my own Python in a Nutshell has been praised as the fastest way onboard for superstar developers.", "I am of course biased in favor of these -- Mark is a colleague, and my wife was a key tech editor for his book (and my own as well), and obviously I'm biased in favor of my own book too;-).", "But then, I do tend to be biased towards a lot of the best Python books, as I've either had a hand in their editing, or am friends with their authors, or both;-)."], "childNum": 5, "tag": "p", "senID": 1, "childList": [{"text": "Edit", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "Dive into Python", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://diveintopython.org/"}, {"text": "Python in a Nutshell", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9780596100469/"}, {"text": "am", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "do", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}], [{"text": ["Hardest thing I was confronted to in using python coming from Java was to properly wrap my head around the Duck Typing thing...  At first I thought it was just plain horrible and just dressed the hairs on the back on my neck."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Next is the scope by convention, but that one is pretty easy.", "And the importance of white spaces gave me a few bumps."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["However once you ease yourself in the language's concision and speed of development you learn to appreciate it a lot more.", "After a while I thought it was the best thing that ever happened to me !!", ":-)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["here are a few things that helped me a lot :"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["First I started with this book and got the basics of the language and for everyday use the Python Quick Reference Card was very helpful.", "Also the console will be your best ally to try quick things and solidify your learning. "], "childNum": 3, "tag": "p", "senID": 4, "childList": [{"text": "book", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9780596009250/"}, {"text": "Python Quick Reference Card", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.limsi.fr/Individu/pointal/python/pqrc/versions/PQRC-2.4-A4-latest.pdf"}, {"text": "console", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://projects.gnome.org/gnumeric/doc/sect-extending-python-console.shtml"}]}, {"text": ["For IDEs, coming from the eclipse world PyDev was a natural choice for me, but there were many more to choose from."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "PyDev", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pydev.sourceforge.net/"}]}, {"text": ["Good luck, Hopefully you'll find Python as much fun as I did."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["I would recommend using IronPython to help you learn.", "It is an implementation of Python on the .NET framework.", "So you can use/learn Python with access to the .NET class library."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "IronPython", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.codeplex.com/IronPython"}]}, {"text": ["A good place to start is by downloading IronPython and looking at IronPython in Action, which is a very good book looking at Python on the .NET framework."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "IronPython", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.codeplex.com/IronPython"}, {"href": "http://www.ironpythoninaction.com/", "text": "IronPython in Action", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["EDIT: Since IronPython is not an option, disregard this answer.", "Thanks though."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The book Pro IronPython is worth reading too if you have time."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Pro IronPython", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.apress.com/book/view/1430219629"}]}], [{"text": ["There is a big initial hurdle of getting comfortable with dynamic typing.", "The first step is when you look at Python-code and realize that variables aren't defined anywhere, you just create them out of thin air, which feels like jumping over a cliff.", "There is a brief moment before your hang glider catches the air properly. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And then it's going to take time before you trust your newfound dynamic wings, and you probably only can get their by doing aerobatics with them.", "Learn how python handles references, have fun with monkey-patching methods, duck type various animals.", "Try to learn some ugly tricks."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And although you can't use IronPython for this, there is no reason you can't use it to learn Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I would recommend just to read a book about it.", "A book for beginners.", "It'll contain many stuff you already know but you won't miss anything regarding using a dynamic language.", "I can point you to Dive into Python, which seems to be very friendly, or The Python Tutorial which seems to be very to the point (that's how I learned)."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Dive into Python", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://diveintopython.org/"}, {"href": "http://docs.python.org/tutorial/", "text": "The Python Tutorial", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["You're going to experience quite a bit of culture-shock going from C# to the wild duck-typed outback of Python.", "Lack of types and intellisense can be pretty daunting.", "Good thing that you're experienced in JavaScript.", "Also know that indent-sensitive block rules of Python can be very confusing for the inexperience (usually you either love it or hate it :-)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Apart from that the biggest challenge moving from one language to another is usually the framework.", "Getting to know all the classes and functions Just Takes Time unfortunately."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["For an experienced developer learning Python, Dive Into Python is a very good book.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Dive Into Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://diveintopython.org/"}]}, {"text": ["Wesley Chun's Core Python Programming book takes a more \"ground up\" approach, which may be a little slow for an experienced developer.", "But it allowed for very easy comparisons of the basic syntax and operators compared to other languages.", "Wesley's writing style is very easy to read, and his example projects are non-trivial enough to actually be interesting.  "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Core Python Programming", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0132269937"}]}, {"text": ["The Python Cookbook is an excellent reference for learning to program in a 'Pythonic' way.", "This book contains hundreds (?", ") of examples of how to solve common everyday problems with Python.", "In general, the \"Cookbook\" series will expose you to the idioms of the language faster than any other book.  "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Python Cookbook", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://rads.stackoverflow.com/amzn/click/0596007973"}]}, {"text": ["Whenever I need to learn a new programming language, I start using it for all the 'daily maintenance' tasks that come up - all the little things that I would normally solve with a shell script or with common unix tools - I start to use the new language to solve those problems.", "Since you have .NET experience, IronPython is probably a good way to leverage that knowledge while learning Python.", "Even if you only install IronPython in a personal sandbox...and use it for all your daily busy work coding tasks - that can be a great way to learn the syntax and idioms of Python.  "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]]