[[{"text": ["My personal opinion is that you should program in a language, any language, I don't care what language!", "for two years to learn all the ins and outs of it.", "While doing that it is a great idea to expose yourself to other influences.", "Since you have started learning Java it makes sense to continue, but if Python interest you go for that."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Once you have really learned a language you will find that most of what you have learned in transferable to other languages.", "The syntax will be different, but most of the concepts will be the same."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["A couple of good books to read for influencing are:"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["The Design and Evolution of C++"], "childNum": 0, "tag": "a", "senID": 3, "childList": []}, {"text": ["Effective Java"], "childNum": 0, "tag": "a", "senID": 4, "childList": []}]}, {"text": ["As for projects, find something that interests you, something that is reasonable in scope (say creating a database of your music library or something like that).", "Something that you would use will motivate you to improve on it as time goes by."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Widen your horizons early, learn the some practical theory, get feedback"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Widen your horizons early, learn the some practical theory, get feedback", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["People may disagree, but here is my 2p:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["a) Read SICP -- You won't get it all first time round, but do try ... it is worth it."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "Read SICP", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://mitpress.mit.edu/sicp/"}, {"text": "is", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["b) Learn about the nature of programming languages, not just the languages themselves.", "Get a good mix of object orientated, procedural and functional languages.", "Haskell, Lisp, Self, Javascript, Clojure, Scala, Python are all good candidates.", "Learn about 'design patterns' for common solutions."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["c) learn C. and use it in a sufficiently complex project.", "The aim here is to hone your 'debugging intuition'"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["d) Open Source -- Try finding a mentor or someone to give consistent criticism to your patches.", "Go and contribute to software that real people use in the real world"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "real people use in the real world", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Most importantly, get feedback from people and study real world code."], "childNum": 2, "tag": "p", "senID": 6, "childList": [{"text": "get feedback", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "real world", "childNum": 0, "tag": "strong", "childList": []}]}], [{"text": ["The best advice I can give is to write and read A LOT of code, and work on projects where you know the problem space very well.", "What helped me early on was writing software that solved problems that I was already intimately familiar with.", "For example I worked as a bus dispatcher for a time so when I was asked to write a web app for tracking busses, shifts, drivers and driver to shift / bus to shift assignment I could basically just sit down and pund away without having to think much about all of the ancillary aspects of software development.  "], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "write and read A LOT of code", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "work on projects where you know the problem space very well", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Also, like a few people have already said, you want to 1) become an expert in a language but 2) become proficient in say pulls number from hat 7 languages.  "], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "expert in a language", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "pulls number from hat", "childNum": 0, "tag": "em", "childList": []}]}, {"text": ["I think SICP might be a little over your head at this point (btw they stopped using SICP at MIT a few years ago, sigh), but it's a great read once you start thinking you know what you're doing.", "(at which point, btw, you don't know what you are doing)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Write a memory manager.", "(or some other very low level component) I think the most progress I ever made as a \"programmer\" in one week was when I had to swap out the linux memory manager for my own implementation for a project in undergrad.", "Once you run vim, pine, mplayer, ... etc.", "on your own memory manager and know what's going on in the background... that's when you start to feel like you actually know what the hell is going on on the inside.", "Just little things like debugging the fact that ls ran succeccfuly but ls -l gave you a seg fault are great learning experiences."], "childNum": 3, "tag": "p", "senID": 3, "childList": [{"text": "Write a memory manager.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "ls", "childNum": 0, "tag": "code", "pos": 4, "childList": []}, {"text": "ls -l", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["Write an application framework.", "Given the number of web development jobs out there I would say write a web application framework... from scratch.", "You probably don't want to use it in a real production application because there are likely a dozen more complete, more secure, more scalable, etc.", "frameworks out there to chose from, but the exercise is enlightening.", "Plus when you switch to working with other people's frameworks later their framework will be easier to understand because they wrote it by solving the same problems you had.", "Believe it or not folks Rails is not actually magic.", ":-)"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Write an application framework.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["Understand the underlying systems and tools you are going to be working with.", "I have mentored a number of junior developers and the ones who are confortable working with the environment they are working in invariably get off to a better start (by weeks or months, not days folks) than those who don't.", "I have had an intern who was \"stuck\" for an entire day while I was out sick because he couldn't get his dev server restarted.", "Solving the problem took us 20 seconds the next morning.", "To be fair he was a terrible intern all around, but the fact remains that even if you have an entire department of 30 people dedicated to the support of your development systems you will be a more effective software developer if you are intimately familiar with the operating system and tools required for your code to function.  "], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Understand the underlying systems and tools you are going to be working with.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["If you already know a language (sounds like you do), check out Google's Python Class videos.", "While doing these exercises (to find the actual files, go here) As extra practice, take a look at codingbat.", "This site was written by the same guy in the videos. "], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "Google's Python Class videos", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.youtube.com/watch?v=tKTZoB2Vjuk"}, {"text": "here", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://code.google.com/edu/languages/google-python-class/google-python-exercises.zip"}, {"text": "codingbat", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.codingbat.com"}]}, {"text": ["For me at least, learning code from a book is a tough thing to do, so I like videos more than just text."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python is a great language with easy to learn syntax, and can be applied almost anywhere.", "Its strengths are usually that it is easily written and understood, as opposed to efficiency and running speed."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you're looking to do some more intense programming, take a look at C++.", "It's very similar to Java syntactically.", "With c++ you can make the fastest running programs out there, and you can make them run on windows with the Windows API (However, the windows API is hard to learn, and Microsoft has horrible documentation) "], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["For learning C++, or at least starting to learn, I recommend the 3DBuzz Introduction to C++ Videos"], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "3DBuzz Introduction to C++ Videos", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.3dbuzz.com/vbforum/sv_videonav.php?fid=d1434abf441133049c1f616771e32dfb"}]}, {"text": ["As for projects, try to find something that really annoys you on your computer.", "Do you hate doing something repetitive?", "Want to make a bot for a game?", "Find something to fix with code, and then fix it!"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["Good luck on your new language!"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}], [{"text": ["You should learn atleast one Functional Language, (Haskell,Scheme,etc) it'll be hard at first.", "But then it becomes \"fun\". "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Functional Languages, help you think, in an entirely different way. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["A lot of job postings look for abilities in scripting languages (python, perl, php, bash, etc..) in addition to mainstream languages like Java or C++.", "From a practical point of view, I'd suggest you start learning python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]