[[{"text": ["Since you mentioned python, I would suggest looking into Django.", "You may need to look harder for hosting options, however..."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Django", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}]}], [{"text": ["App Engine is nice.", "It supports Pyhton or Java (with some limitations), it provides  free hosting for small needs (rare, at least for Java).", "But I wouldn't expect the exact same performances than with dedicated servers, the cloud is about scalability, not performance (you won't always get the fastest response time for a single hit; however, GAE would handle gazillions of concurrent hits without any problem while your servers would be on fire).", "But this scalability is not without cost and if you don't need it, the development tradeoffs may be too much troubles.", "And also note that it does not support full text search out of the box (what an irony), you will have to use extra tooling."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "limitations", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://groups.google.com/group/google-appengine-java/web/will-it-play-in-app-engine"}, {"text": "does not support full text search", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://code.google.com/p/googleappengine/issues/detail?id=217"}]}, {"text": ["I like Stripes very much.", "I love its conventions over configuration approach, it's a very elegant and simple framework (but still powerful).", "Definitely not a bad choice.", "For the persistence, if you go for GAE, you will have to use JPA or JDO.", "If you don't, it's at your discretion (although I would go for JPA)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": ["Google AppEngine - A Second Look"], "childNum": 0, "tag": "a", "senID": 2, "childList": []}]}], [{"text": ["As many things in life, this depends on what your goals are.", "If you intend to learn a web framework that is used in corporate environments, then choose a Java solution.", "If not, don't.", "Python is certainly more elegant and generally more fun in pretty much every way."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["As to which framework to use, django has the most mindshare, as evidenced by the number of questions asked about it here.", "My understanding is that it's also pretty good.", "It's best suited for CMS-like web sites, though - at least that's what it's coming from and what it's optimized for.", "You might also have a look at one of the simpler, nimbler ones, such as the relatively new flask.", "All of these are enjoyable, though they may not all have all features on AppEngine."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "django", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "flask", "childNum": 0, "tag": "code", "pos": 3, "childList": []}]}], [{"text": ["Kay and Tipfy are excellent Python framework choices when you target specifically GAE.", "Kay is modelled after and similar to Django, but is better suited to GAE."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Kay", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/kay-framework/"}, {"text": "Tipfy", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.tipfy.org/"}]}], [{"text": ["I've been kick App Engine around a little bit, and so far the DataStore is pretty quick... there is a bit of a learning curve compared to SQL, but I've had no real issues.", "I'm not sure about fulltext search, however filtering is simple, you would just run each filter one at a time. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n class DBModel(db.Model):\n    field1 = db.StringProperty()\n    field2 = db.StringProperty()\n    field3 = db.IntegerProperty()\n\nGQLObj = DBModel.all().filter('field1 =', 'Foo')\nGQLObj = GQLObj.filter('field2 =', 'Bar')\n</code>\n</pre>\n", "senID": 1}, {"text": ["As far as hosting, with GAE I'm not sure you even get a choice, I know you can register your own domain with google though."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I don't think the datastore is a problem.", "Many people will reject it out of hand because they want a standard relational database; if you are willing to consider a datastore in general then I doubt you will have any problems with the GAE datastore.", "Personally, I quite like it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The thing that might trip you up is the operational limitations.", "For example, did you know that an HTTP request must complete within 10 seconds?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["What if you get 50% of the way through a project and then find that a web service you are using sometimes take 15 seconds to respond?", "Now you are toast.", "You can't pay extra to get the limit raised or anything like that."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So, my point is that you must approach GAE with great care.", "Learn about the limitations and make sure that they will not be a problem before you start using it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["It depends on your personality.", "There's no right answer to this question any more than there's a right answer to \"what kind of car should I drive?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you're artistic and believe code should be beautiful, use Rails."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you're a real hacker type, I think you'll find a full-stack framework such as Rails or Django to be unsatisfying.", "These frameworks are \"opinionated\" software, which means you have to really embrace the author's vision to be most productive."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["The wonderful thing about web development in the Python world is there's several great minimal frameworks.", "I've used several, including web.py, GAE's webapp, and cherrypy.", "These frameworks are like \"here's a request, give me a string to serve up.", "\" It's raw.", "Don't think you'll be stuck in Python concatenating strings though, God no.", "There's also several excellent templating libraries for Python.", "I can personally recommend Cheetah but Mako also looks good."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Google App Engine + GWT and you have a pretty powerful combination for developing web applications.", "The datastore is quite fast, and it has so far done the job quite nicely for me. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In my project I had to do a lot of redesigning of my database model, because it was made for a traditional relational database, and some things were not (directly) possible with the datastore."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["GWT has a fairly moderate learning curve, but it gets the job done very well.", "The gui code is really easy to get started with, but it's the asynchronous way of thinking that's the hardest part."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["As for search I don't think it's supported in the framework.", "Filtering is possible on parameters."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["There are some limitations to GAE, and you should consider them before putting all your eggs in that basket.", "The fact that GAE uses J2EE distribution standards makes the application very easy to move to a dedicated server, should the limitations of GAE become a problem.", "In fact I only think you would have to refactor the part of your code that makes the queries and stores the data (which shouldn't be much more than 100 lines)."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I've built several apps on GAE (with Python) over the last year.", "It's hard to beat the ease with which you can get an app up and running quickly.", "Don't discount the value in that alone. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["While you may not understand the datastore yet, it is extremely well documented and there are great resources - including this one - to help you get past any problem you might have. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]