[[{"text": ["Depends on the type of game.", "For the \"big\" games, certainly C and C++ as that's what the big engines and middleware are written in (e.g., Gamebryo, Unreal, id tech, FMOD Sound System, the RAD Game tools stuff etc.", ")."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python is used in some games as a scripting language (for game logic, missions, sometimes AI), but there is also LUA and possibly many others, but python certainly is used here."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For \"casual\" games you might also consider Flash/ActionScript (Browser Games are also games, and it's a big market) or C#/XNA (although that did not really take off)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you want to develop games for the iPhone, Objective-C is your best bet as the alternatives (Flash and MonoTouch) have yet to prove themselves."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["What do you actually want to do in game development?", "Do you want to work on a Graphics engine?", "Or Sound?", "AI?", "Game Logic?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["It all depends on what your goals are.", "As a beginner, pick whichever you think is easiest and start learning.", "You need to learn to program before you worry about what language to use for what."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["When you are mature enough to list the pro's and con's of each on your own, then you are mature enough to ask this question (and despite how that sounds, it isn't circular logic)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It depends what kind of games.", "I don't think there are many 3D graphics games programmed purely in Python.", "C++ is used for 3D graphics since it is very fast at the numerical computations necessary.", "Python can't compete with it.", "If you want to make a 3D graphics car-racing game like Mario Kart, you need to learn C++, not Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, as San Jacinto says, the question is a little moot at this stage."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Wanting to \"Learn game development\" is very, very vague."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to develop your own, small games, for fun, while learning how to structure the application, go with python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you want to learn more hard-core graphics programming, or gain experience towards working in the industry, I would have to say go with c++."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I think the answer depends very much on your current skillset and goals.", "Note that I'm certainly no expert in the field."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["if you want to be hired in the industry, get good at C++.", "Real good.", "Like, godly."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["if you want to Get Things Done and ship a small game with a small team (e.g.", "just you), use python, C++ is a premature optimization."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python2 has better library support for game stuff -- PyGame will set up your window and give you 2D operations, PyOpenGL to do fancier stuff, Panda3D, etc."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "PyOpenGL", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pyopengl.sourceforge.net/"}, {"href": "http://www.panda3d.org/", "text": "Panda3D", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["Which language do you know best?", "If your goal is to learn game development, don't make the process that much harder by also trying to learn C++. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If performance is critical use C++."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Many games write the core engine in C++ then have bindings to python for less performance critical code (game logic, missions, AI).", "A good example of this is Civilization 4.", "This also makes the game expandable."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I would personally recommend C# / XNA for a new developer and using a framework such as Ogre."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Given that you want to learn game development and don't have a lot of experience with it, I would recommend starting with Python 2 and use the latest version that PyGame supports. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.pygame.org/"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.pygame.org/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pygame.org/"}]}, {"text": ["There are an awful lot of games, written in Python with PyGame, that are available as source code to download and study.", "If you ever get a job programming games, chances are that the game engine that they use, will not be one that you have used before, so you will need to translate your experience into their engine and API.", "Therefore, Python will not handicap you in any way.", "In fact, because it frees you from a lot of the gritty details, you can focus on learning game development, not pointers and structs and syntax and compile errors etc."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Later on, you can move into C when you already have the game programming concepts down pat.", "Or, you may find that you prefer digging into the internals of a game engine and tweaking the drivers etc.", "In that case, stick with PyGame and work on improvements and enhancements."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["I would give different advice to a skilled programmer who wanted to make a career move into game programming."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I would start with C++ which is the language of choice for most games created today.", "There are a number of games being developed on DirectX using C# in a managed environment, using the XNA frame work.", "Check out this site.", "XNA Developer Center"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "XNA Developer Center", "tag": "a", "pos": 3, "childList": [], "childNum": 0, "href": "http://msdn.microsoft.com/en-us/aa937791.aspx"}]}], [{"text": ["C++ is the language used to actually write the game, at least for the graphically-intensive complex games like World of Warcraft.", "Languages like Python are often used for scripting behaviors within the game."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["On the other hand, a major category of games is the \"casual\" games category, which includes simpler games like Sudoku games or simple puzzle solving games.", "These might be written in a very high level language like Python."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["More likely than Python, however, lightweight games are usually written in Flash, using the scripting language in Flash (ActionScript).", "It turns out that this is actually a flavor of Javascript.", "Javascript, in turn, is much like Python."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So, my suggestion is that you learn Python, and then learn Javascript.", "Then write some simple games in your choice of PyGame, Flash, or even in-browser Javascript.", "Then if you still want to learn C++, go on and learn that, but keep playing around with game design in your spare time, writing casual games."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I think your best approach is to start with a language that you are familiar with.", "Learning about game development requires you to be at ease with your tools and to focus on the specific challenges that comes with the field, rather than the language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Start with the fundamentals: how do you manage your game loop, how do you load external resources, how to you save and restore state, how to you manage your artificial intelligence and which pathing algorithms are more efficient for your needs?", "As you start learning, you'll see architectural and functional patterns emerge. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["As your project grows, you'll start tackling new challenges such as networking, optimization and the usage of frameworks to make game development more efficient."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So in general, I'd say go for something easy that you are comfortable with, like Python (there are wonderful libraries and frameworks available).", "Learn the core fundamentals there, and from then on you can explore other options like C++ (seriously used in the industry) and their existing frameworks.", "I'd stick to non-mobile, non-flash development for now, as developing in those environments introduces extra challenges and constraints which are fairly specific."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["I'm of the mind that you want to know lots of languages, and how the same \"program\" looks in different languages.", "Then you can make better decisions about what parts of a program should be in which languages.", "You can use any language to write a game.", "The concepts themselves behind organizing data to execute are more important than the language, and practicing different languages helps you become comfortable with those concepts.", "Then you can \"pick up\" and get a feel for new languages quickly without much re-learning."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So I think that it doesn't hurt to try to learn and practice multiple languages at once, even as a beginner.", "C++ is certainly widely used in industry game programming (where it's survived more than in many other programming domains).", "OpenGL usually comes along with that for high performance 3d programming.", "Python has libraries for writing games, is considered 'easy' syntactically (personally I agree).", "You might skip C++ for now and focus on C and python, and return to C++ after studying Object-oriented."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["You want to learn the concepts behind what your code does, and efficiency trade-offs.", "To write more complex games you simply need more knowledge - knowing which data structures are most efficient for the requirements.", "How to structure your programs so that they don't fall apart in your head when you want to fix a bug or add a feature.", "With a bit of rudimentary programming knowledge and Python you can write a pretty good game without graphics for practice.", "And there is PyGame and other libraries for graphics, sound etc."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["It depends on your target."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For instance, if you ever want to develop games for the Xbox 360, you need C# and the XNA Game Studio."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["XNA Game Studio is a set of C# projects and libraries made for use with Visual Studio (any edition, including Express) for creating both Xbox 360 and Windows/DirectX games."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "XNA Game Studio", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.microsoft.com/downloads/details.aspx?FamilyID=80782277-d584-42d2-8024-893fcd9d3e82&displaylang=en"}]}], [{"text": ["The simplest and fastest way to learn game programming is with Python/PyGame."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python is a cross platform, byte code compiled, easy to learn programming language with a really clean syntax that maximises readability.", "It has a ton of libraries and documentation written for it."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["PyGame is a 2D game development framework written in python which is really simple to learn, with lots of tutorials and documentation written for each.", "Each year a PyGame context is held where people over the word submit their PyGame games.", "Python is interpreted language ( but you can also package it in an standalone executable) , so when you download a game to play you can also see its source code and change it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["If you don't already know exactly why you are forced to use C++, you don't need it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["If you're making an Indie game(i.e.", "2d, in a team of less than ten people, low budget), then pygame is your best bet."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["There are many libraries in http://pygame.org that make development a snap.", "There's in-game GUI, networking, pathfinding...\nPython 2 is better, for now.", "You won't need the P3000 stuff just yet."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://pygame.org", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pygame.org"}]}, {"text": ["Lua is also a very popular choice, but that's mostly for big, professional games.", "They often choose Lua because of its can't fail philosophy.", "You can pass more or less arguments than a function takes and it won't complain.", "Pretty much anything can crash, and it will still run on average.", "Also, it has very powerful (kind of)threads.", "There's no race conditions.", "Ever.", "And there's Lambdas.", "And it's extremely moddable.", "It's basically Lisp with less parentheses.", "It should go without saying, Lua programmers are very, very careful people."], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "can't fail", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "on average", "childNum": 0, "tag": "em", "pos": 3, "childList": []}, {"text": "", "childNum": 0, "tag": "br", "pos": 4, "childList": []}]}, {"text": ["Anyway, no matter what you hear, know this:\nGames are written in script languages.", "Engines are written in C++.  "], "childNum": 4, "tag": "p", "senID": 3, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}, {"text": "script languages", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "", "childNum": 0, "tag": "br", "pos": 1, "childList": []}, {"text": "C++", "childNum": 0, "tag": "strong", "childList": []}]}, {"text": ["If you \"want to learn game development\", you probably want to write games.", "Also, for both python and Lua there's a pretty simple way to write a script and then ship an .exe.", "Search elsewhere for \"Embedding %s\" % language_name, but it's basically just "], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["#include\n...\npython_run_file(\"main.py\");"], "childNum": 2, "tag": "p", "senID": 5, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}, {"text": "", "childNum": 0, "tag": "br", "childList": []}]}], [{"text": ["C++ since that is the widely used one for game programming and you will get lot of samples for c++ games to look at.", "As other answer said, there aren't many phython 3d programs."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The game concept is more important than the language you chose.", "Use whichever language you are most comfortable with.", "All but the most complex 3D graphics games will run fine with even interpreted languages."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["My advice is to minimize the number of unknowns.", "I assume you are new to game programming and you state you are new to python.", "My personal bias is to approach a new domain (games) with a familiar language (C++) or approach a known domain with a new language.", "Approaching a new domain with a new language is tough challenge."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think one of the quickest and most rewarding game development languages is ActionScript 3.0 using the Flex SDK.", "The ability to create a game and release it on the web to a huge audience is a very rewarding experience."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["ActionScript Reference material can be found here and Emanuele Feronato has a great blog for beginner game developers."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://livedocs.adobe.com/flash/9.0/ActionScriptLangRefV3/"}, {"href": "http://www.emanueleferonato.com/", "text": "Emanuele Feronato", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["Most modern games are not built from scratch but use some pre-existing game/graphics engine."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Flash games are quite popular.", "Although most games written in Flash tend to be simple, the language is geared towards graphics and you will really learn at the higher level."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["C++ is really widely used, but it is unlikely that building a game engine from scratch is a viable idea. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Look at www.GarageGames.com for a good place to find both a ready game engine and a community of developers writing games."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You might want to consider starting with casual games.", "This depends of course on your desires but casual gaming is a little more accessible to both developers and users.", "The tools are easier to learn as well: Flash/Flex and Silverlight are both very available and a lot of fun to use."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Game programming is not different in C++ than Python.", "You already know C++, so the answer is: Learn Python.", "Why?", "Because it's a bloody cool language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You'll also learn a lot of game programming by doing it in Python, even if you need to switch to C++ for doing heavyweight 3D engines."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["So the answer is really....", "BOTH!", ":-)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Go with C++, It's the main language in the industry; and you'll learn all the bits and bobs of game development.", "Using C++ also gives you another benefit, you can implement a scripting language such as LUA or Python for for instance Game Logic!"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I would say this depends on your programming experience, if your used to C like syntax and think that way, i.e curly brackets, semicolons, strong typing,  go with the C++, its fast, and its the language you know. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However if you comfortable with programming languages as a whole, then python is not a bad alternative, and I would highly recommend the panda3d 3d engine (I consider this more of a 3D engine, rather then a game engine in the sense you still have to build game specific logic), it uses python and I think the newest python 2.6.xx version is your best bet.", "As far as performance, unless your running an older machine, interpreted languages such as python can run nearly as fast a compiled languages such as c/c++. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think that C++ is the best choice, I made some small games using free engines like Ogre or Irrlicht, especially Irrlicht because it's very easy to learn. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also for 2D games you can use HGE."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But if you want to go whith Pyton try Blender a 3D modeling an animation tool, whith Blender you can make cool games and you have all the things you need to make a game in the same sotware, Blender uses Python for programing, but you can make games whithout knowing programing just using logic blocks."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'm thinking that if you want 3D graphic games then C++ with DirectX is the best"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Target platform?", "To Flash or not to Flash (vector based graphics)?", "To bitmap or not to bitmap?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Based on some of those types of questions you can arrive at a smaller range of possibilities."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For example, target platform XBox 360:\ncode: C++\nteam needed with publishing deal: yes (if you work at a game co. this is easier :)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Same holds true for Playstation platforms or older XBox, etc.", "Pretty much any console based games you're going to do need a dev kit and that only happens if you have a deal with the manufacturer or a publisher."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["So, let's skip console for now."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["That leaves several options still most online based or iPhone based.", "But you've already said you don't want to do Flash, iPhone, or browser based games."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["So next up is Mac or PC.", "If you want to get onto console eventually Widows based games is a great way to go.", "You can learn the graphics libs, DX, there and then later use something similar on XBox 360 for example.", "Or, if you want to go cross platform look at Open GL... and should you decide to lower yourself to a platform that has \"2 billion\" downloads, lets you sell your game worldwide right now, and only costs $99 to have access to as a developer, well Open GLES is right there as a subset of Open GL."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["In the Windows and Mac and even iPhone cases, C++ will work.", "C definitely will."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["// :)"], "childNum": 0, "tag": "p", "senID": 8, "childList": []}], [{"text": ["if you are looking for a 2d racing game, i would suggest using AS3(Flash) with Box2d.", "-easier to get started\n-larger audience"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["best of luck to you, what-ever language you choose!"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I am not sure what your prior programming experience is.", "If you wish to get up to speed quickly, I would recommend Python.", "Others have recommended PyGame, which is the defacto standard for Python.", "There are other alternatives (like a modified version of the Verge engine called Ika that is under slow development, http://ika.sourceforge.net/news.php) but PyGame is very solid."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "slow", "childNum": 0, "tag": "em", "pos": 3, "childList": []}, {"href": "http://ika.sourceforge.net/news.php", "text": "http://ika.sourceforge.net/news.php", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Since you asked about a resource to get started, I would recommend Invent with Python (http://inventwithpython.com/chapters/).", "It uses Python 3 and PyGame, and starts real basic.", "In the next month or so you will be able to buy the book if you so desire (the author mentioned to me that a publisher took an earlier version of the book and made a very poor paper version -- so if you see that on Amazon, avoid it!", ")."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Are you starting to program now?", "Why don't you want to learn C#?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you are a beginner, I would suggest to not start with C/C++.", "I think you should learn how to use UNITY3D, a game engine that is very popular today.", "Many people, from indie developers to big companies are using Unity, to make all kinds of games (by the way, car racing games is one of the tutorials."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This engine is easy to learn, you can use it with UnityScript (a custom language with JavaScript-inspired syntax), C# or Boo (which has a Python-inspired syntax).", "I strongly recommend C#, it's more powerful and you learn the language that you can use with XNA later."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]