[[{"text": ["Typically, Python code strives to adhere to the Uniform Access Principle.", "Specifically, the accepted approach is:"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Uniform Access Principle", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Uniform_access_principle"}]}, {"tag": "ul", "num": 2, "lis": [{"text": "Expose your instance variables directly, allowing, for instance, ", "tag": "none", "senID": 1}, {"text": "If you need to wrap the accesses inside methods, for whatever reason, use ", "tag": "none", "senID": 2}]}, {"text": ["The main advantage to this approach is that the caller gets to do this:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n foo.x += 1\n</code>\n</pre>\n", "senID": 4}, {"text": ["even though the code might really be doing:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n foo.set_x(foo.get_x() + 1)\n</code>\n</pre>\n", "senID": 6}, {"text": ["The first statement is infinitely more readable.", "Yet, with properties, you can add (at the beginning, or later on) the access control you get with the second approach."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Note, too, that instance variables starting with a single underscore are conventionally private.", "That is, the underscore signals to other developers that you consider the value to be private, and they shouldn't mess with it directly; however, nothing in the language prevents them from messing with it directly."], "childNum": 2, "tag": "p", "senID": 8, "childList": [{"text": "conventionally", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "prevents", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["If you use a double leading underscore (e.g., __x), Python does a little obfuscation of the name.", "The variable is still accessible from outside the class, via its obfuscated name, however.", "It's not truly private.", "It's just kind of ... more opaque.", "And there are valid arguments against using the double underscore; for one thing, it can make debugging more difficult."], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "__x", "childNum": 0, "tag": "code", "pos": 0, "childList": []}]}], [{"text": ["As others have said, private attributes in Python are merely a convention.", "The use of property syntax should be used for special processing when attributes are bound, modified or deleted.", "The beauty of Python is that you can start off by just using normal attribute binding, e.g.,  self.attr = 0 and if at some later date you decide you want to restrict the value of attr to say 0 &lt;= attr &lt;=100, you can make attr a property and define a method to make sure this condition is true without ever having to change any user code."], "childNum": 4, "tag": "p", "senID": 0, "childList": [{"text": "property", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "self.attr = 0", "childNum": 0, "tag": "code", "pos": 2, "childList": []}, {"text": "0 &lt;= attr &lt;=100", "childNum": 0, "tag": "code", "childList": []}, {"text": "attr", "childNum": 0, "tag": "code", "childList": []}]}], [{"text": ["Python doesn't have public OR private attributes.", "All attributes are accessible to all code."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n self.attr = 0 #Done\n</code>\n</pre>\n", "senID": 1}, {"text": ["Your method isn't in any way making _attr private, it's just a bit of obfuscation. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["In Python, unless you need special behavior out of an attribute, there's no need to hide it behind accessor methods.", "If an attribute is for internal use only, prepend it with an underscore."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The nice thing about properties is that they given you a really cool interface to work with.", "Sometimes it's handy to derive a property based on some other (ie.", "BMI is defined by weight and height).", "The user of the interface doesn't have to know this of course."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I prefer this way over having explicit getters and setters like in Java ie.", "Way nicer.", ":)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Quite simply, the OOP principles are wrong.", "Why this is is a long discussion which leads to flamewars and is probably off topic for this site.", ":-)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In Python there is not private attributes, you can't protect them, and this is never a real problem.", "So don't.", "Easy!", ":)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Then comes the question: Should you have a leading underscore or not.", "And in the example you have here you should definitely not.", "A leading underscore in Python is a convention to show that something is internal, and not a part of the API, and that you should use it on your own risk.", "This is obviously not the case here, but it's a common and useful convention."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]