[[{"text": ["Java and Python are both excellent languages.", "It is a matter of taste and believe which you choose. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "If you prefer a lightweight solution, use Python.", "tag": "none", "senID": 1}, {"text": "If you have enterprise needs, ", "tag": "none", "senID": 2}]}, {"text": ["If you ask for my personal believe, my subjective stand-of-point is:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": "Use Python wherever possible and stick to other languages if there is a need to.", "tag": "none", "senID": 4}]}, {"text": ["So this is my opinion, but as S.Lott commented on your question: "], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["Most people here are missing the fact that the question is really about App Engine, not java or python in general."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The Java and Python SDKs and App Engine runtimes have pretty much the same abilities at this point.", "One caveat with the current java runtime is that if you use a lot of external libraries, your loading hits (the first time someone hits your website, and app engine has to spin up your app) can be a bit slow."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["If you want to learn Java, then use Java! "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you feel that Java is too verbose compared to Python, you could try Scala, which runs on the JVM like Java.", "Scala is more concise and well designed."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I would personally go with a Java based solution.", "If this is just a little website for yourself, then it would be a good idea to learn a new technology, in this case Java.", "Little projects like this are ideal for learning new technologies and seeing if they are suitable for you as a developer and other projects you may decide to do in the future"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You'll be able to accomplish the exact same results using either Python or Java.", "Java is much more verbose than Python, which can make it have a bit of a steeper learning curve.", "The fact that you have some experience in Django (which GAE's webapp is largely based on and which you can even use directly if you want) will make it easier for you to get the website up and running in the immediate term."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So again, it does depend on what you want to accomplish.", "If your goal is to learn Java, then doing a project in Java is the best way to learn it.", "If your main goal is to get the site up and running, Python will be a better choice as it will let you focus less on struggling with learning new Java syntax and more on simply getting the website off the ground."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You need an IRL mentor."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Java is on the way out.", "Stick to Python and C++."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Update0"], "childNum": 0, "tag": "h2", "senID": 1, "childList": []}, {"text": ["This.", "Is.", "Sparta!"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}]]