[[{"text": ["The representation of a float has been designed such that there are some special combination of bits reserved to store special values such as NaN, infinity, etc."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "special values", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Floating_point#Special_values"}]}, {"text": ["There are no unused representations for an int type - every bit pattern corresponds to an integer.", "This has many advantages:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "The range of an integer type is as large as possible - no bit patterns are wasted.", "tag": "none", "senID": 2}, {"text": "The representation of an integer is easy to understand because there are no special cases.", "tag": "none", "senID": 3}, {"text": "Integer arithmetic can be done at extremely high speed even on very simple processors.", "tag": "none", "senID": 4}]}], [{"text": ["A clear Explanation about float arithmetic is given here"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.artima.com/underthehood/floatingP.html"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.artima.com/underthehood/floatingP.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.artima.com/underthehood/floatingP.html"}]}], [{"text": ["Basically, it's a purely arbitrary decision."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The traditional int tries to use all the bits for representing possible numbers, whereas IEEE 754 standard reserves a special value for NaN."], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "int", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"href": "http://en.wikipedia.org/wiki/IEEE_754-2008", "text": "IEEE 754", "childNum": 0, "tag": "a", "childList": []}, {"text": "NaN", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["The standard could be changed for ints to include special values, at a cost of less efficient operations.", "The developers usually expect int operations to be very efficient, whereas the operations with floating point numbers are (purely psychologically) more allowed to be slower."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "int", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "int", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"text": ["Java reflects the way most CPUs are implemented.", "Integer divide by zero causes an interrupt on x86/x64 and Floating point divide by zero results in Infinity, Negative infinity or NaN.", "Note: with floating point you can also divide by negative zero.", ":P"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I think the real reason, the root of this, is the well known fact: computers store everything in zeroes and ones."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["What does it have to do with integers, floats and zero division?", "It's pretty simple.", "If you have only zeroes and ones, it is pretty easy to combine them into integer numbers, like you do with decimal digits.", "So \"10\" becomes two, \"11\" becomes three and so on.", "This kind of integer representation is so natural that no one would think of inventing anything else for integers, it would just make CPUs more complicated and things more confusing.", "The only \"invention\" that was required is to figure out how to store negative numbers, but that's also very natural and simple if you start from the point that x+(-x) should always be equal to zero, without using any special kind of addition here.", "That's why 11111111 is -1 for 8-bit integers, because if you add 1 to it, it becomes 100000000, then 8th bit is truncated due to overflow and you get your zero.", "But this natural format has no place for infinities and NaNs, and nobody wanted to invent a non-natural representation just for that.", "Well, I won't be surprised if someone actually did that, but there is no way such format would become well-known and widely used."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Now, for floating-point numbers, there is no natural representation.", "Even if we translate 0.5 to binary, it would still be something like 0.1 only now we have \"binary point\" instead of decimal point.", "But CPUs can't naturally represent a \"point\", only 1 and 0.", "So some kind of special format was needed.", "There was simply no other way to go.", "And then someone probably suggested, \"Hey guys, while we are at it, why not to include special representation for infinity and other numeric nonsense?", "\" and so it was done."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["This is the reason why these formats are so different.", "How to handle divisions by zero, it's up to language designers, but for floating-points they have the choice between inf/NaN and exceptions, while for integers they don't naturally have such kind of thing."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Ints and floats are represented differently inside the machine.", "Integers usually use a signed, two's complement representation that is (essentially) the number written out in base two.", "Floats, on the other hand, use a more complex representation that can hold much larger and much smaller values.", "However, the machine reserves several special bit patterns for floats to mean things other than numbers.", "There's values for NaN, and for positive or negative infinity, for example.", "This means that if you divide a float by zero, there is a series of bits that the computer can use to encode that you divided by zero.", "For ints, all bit patterns are used to encode numbers, so there's no meaningful series of bits the computer could use to represent the error."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This isn't an essential property of ints, though.", "One could, in theory, make an integer representation that handles division by zero by returning some NaN variant.", "It's just not what's done in practice."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]