[[{"text": ["Depends on what type of freelance work that you are looking for.", "There is certainly a demand for PHP programmers, no doubt about it, but its also allot of folks doing this at the same time, meaning that the competitions takes place in the $ / hour vector."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If I where to start out today doing freelance work I would specialize myself on a language /product combination. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["For example, being good at C# / Sharepoint (just as an example) , would probably land you far more better paid jobs, than just being a C# programmer."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I would agree with you that PHP projects definitely dominate the freelance landscape as far as web development goes.", "This is mainly due to its wide use in legacy web pages but also that many clients are comfortable with PHP and wouldn't want to tread into 'new' waters (ie.", "Ruby)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Make sure you don't tie yourself down to PHP just because it will make you money in the short run.", "Learn Ruby or Python (whatever you enjoy more!", ") and continually update your  skills so that once you do have that freelance coding experience behind your back you will have other skills in your pocket as well."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It's true that most of the ones I've seen are PHP-based but I'd be wary about them.", "I've seen too many \"make me a CMS for $15\" adverts.", "If you're finding good, reliable and well paying jobs good for you."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I had a look around and while there's the Python job board (seems to be mainly part-time/full-time jobs) a quick scan of this board screams mostly PHP and MySQL."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Python job board", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.python.org/community/jobs/"}, {"href": "http://www.simplyhired.co.uk/a/jobs/list/q-Freelance%2BWeb%2BDeveloper", "text": "this board", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["Also based on something I just found on HN (which I think is the same site as Bill's answer) it looks like PHP far outstrips Ruby and Python, as far as Craigslist is concerned."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "something", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://langpop.com/#craigslist"}]}, {"text": ["GitHub's another source, which interesting shows Ruby as the top item, with Python 3rd and PHP 7th.", "Not sure how good a representation this is (after all Rails (yet not Ruby) is on Github and PHP turned down the offer) but it certainly shows a counterpoint."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "GitHub's", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://github.com/languages"}]}, {"text": ["You'll probably be interested in this HN topic."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "this HN topic", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://news.ycombinator.com/item?id=558851"}]}], [{"text": ["And what's so bad about PHP?", "I hear the v.6 is going to bring in some nice treats :) "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I would not be so picky about the language and start hacking.", "Yesterday was too late."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think that it very much depends on what the economics of your location are like.", "I live in Leeds, Yorkshire, UK and around here we a saturated with new media companies offering CMS/Ecom solutions and its a usually a high proportion of php work. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The main reason for this is that php fits for these kinds of developments.", "Php is heavily web based and there are a lot of open source projects for this type of work."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["BUT, it really depends if you want to spend your time skinning cms sites over and over again, or whether you want to build products and solve interesting problems. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["This type of work is really mind numbing to me, and I would much rather turn it down than take it.", "That said things aren't great around here, and I am finding myself taking on such projects more and more.", "I'd suggest you work out what your perfect job/clients would look like and concentrate on finding them.", "It may be that you cant initially get them and you have to take intermediatory work, but If you work at what you want you'll find youll get it."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Go to craigslist for your market or a market that you would be willing to move to.", "Search the internet engineers, software / qa / dba, and web / info design jobs.", "Search for technologies you're interested in - this will give you a rough idea of how in demand a certain technology is in your region."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For example I search for Ruby in the SF bayarea and got 71 results.", "You could probably find a Ruby gig in SF.", "Where I live, Ruby returned 2 results - it's going to be tough for me to find a Ruby gig in MN."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]