[[{"text": ["Why do you have to convince your boss to use Django?"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "have", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Your boss should understand that it's in his best interest to work in what the people he'll be employing know best. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But, how can you tell that Django is really the best suit all things considered? "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["For example:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Are the servers in-house? do the sysadmins know how to maintain servers for Django? ", "tag": "none", "senID": 4}, {"text": "Are the servers in a webhost, do you know how much does it cost to have a Django webhost versus a PHP one?", "tag": "none", "senID": 5}, {"text": "Are the rest of the team familiarized with Django/Python? If you are a one man team, what if your boss wants to make the team bigger, will he be able to? At what cost? PHP devs abound.", "tag": "none", "senID": 6}, {"text": "Given the PHP framework of choice, can you honestly give some criteria that will translate to dollars (or whatever your currency is) giving Django the advantage? Say, time to market, or some features that will be used and come for free in Django but not in the other alternative? Don't forget that if you are a good programmer you can create good programs in any language.", "tag": "none", "senID": 7}]}, {"text": ["This are just some things you have to consider before presenting with your boss with a \"PHP sucks, let's use Python instead\" speech.", "I understand the feeling but it really might not make sense in the long run in certain cases.", "If, after all these things are answered (and some more), you can still present a good case for Django, then you should do so.", "Just don't do what sounds to a business man like fanboy speech."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["UPDATE: If the only thing stopping you from doing in Django is your boss' fear and you both know that you can make it work at a comparable cost in infrastructure, then the only way to alleviate that fear is to jump in and do something like it.", "You might get authorization for a prototype, for example.", "No amount of talking will relieve him from his fear, he'll need to see something.", "You should also tutor him (if possible) on how Python works while you go at it, so he can appreciate the beauty of the beast."], "childNum": 1, "tag": "p", "senID": 9, "childList": [{"text": "and you both know that you can make it work at a comparable cost in infrastructure", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}], [{"text": ["People like to see tangible results.", "On your own time implement a small portion of the project using Django that can demonstrate what you believe to be some of the advantages of switching the project to Django.", "Besides demonstrating technical advantages, it will demonstrate your commitment to the idea."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "On your own time", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["From your boss' point of view, switching frameworks is a risk that she will have to explain.", "So you will need to show that you are motivated and committed to making it work."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Here is a somewhat related article by Joel Spolsky about Getting Things Done When You're Only a Grunt.", "You might need to take a longer term approach to introducing Python and Django.", "Perhaps you could write some scripts in python that other people on the team will find useful.", "Maybe you could implement an internal tool using Django, which people will start using."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "Getting Things Done When You're Only a Grunt", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.joelonsoftware.com/articles/fog0000000332.html"}]}], [{"text": ["You want to know how to convince a business person?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Two words: \"steaks and strippers\" (Zed Shaw)."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "steaks and strippers", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://blog.cusec.net/2009/01/05/zed-shaw-the-acl-is-dead-cusec-2008/"}]}], [{"text": ["If you have the possibility, you could create a prototype in Django.", "Your boss will see it, and will be able to measure the advantages.", "A good presentation in powerpoint with explained required effort, advantages, etc.", "may be also a way to increase the chances of success.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}, {"text": ["And, over all, make sure to reply to the question: \"why can't we just use the old system\"."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["It would be unfair on your fellow programmers to move to django, if they happen to only know php."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["The problem is your Boss who knows PHP but doesn't know Python.", "And I can imagine that he doesn't want to spend valuable time learning to become familiar with a new technique."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["About 16 years ago, I've tried to convince my employer to use Delphi (then a new product) instead of some other RAD tools that he was considering.", "I did my best to convince him and managed to convince him that Gupta SQL-Windows was a bad choice.", "I also made it clear that Visual Basic would be less powerful than Delphi, since Delphi had much better database-aware components.", "So he decided to not use VB either.", "But Delphi was Pascal and he knew nothing about Pascal and couldn't be bothered to learn more about it so he chose to develop in PowerBuilder for new projects.", "And I decided to move to a company with a smarter Boss who did believe in Delphi.", "It was frustrating as Hell to try to convince my Boss and I found more than enough satisfaction with my next employer, who did use Delphi.", "My old employer did manage to write some application with PowerBuilder but it never resulted in the profits he'd expected.", "(Not a surprise either, since another developer had used two days work just to create an animated trash-bin icon on a button.", ") His company went chapter 11 and he went on an early retirement..."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Now, if your Boss doesn't listen to your advise, you have two options: Accept it or leave for another Boss.", "He is the Boss, so if you continue to nag him about this issue then he might decide you're better off working for someone else..."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "is", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Bottom line is what it is all about really.", "How much money does a move to python/django save the company overall in terms of dev effort, testing and support? "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you can demonstrate that python out performs php in these areas then its going to make a saving for the company.", "More savings means better profit margin - that should be pretty convincing."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["The best way to persuade people (coworkers, pointy-haired-bosses, peers, etc) is to help them reach their own conclusions by continually demonstrating your awesomeness."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Implement a cool prototype-demo of a cool technology on your own time, using the tools you want to use.", "Then show it off as a \"check-out-what-I-did-this-weekend\" demonstration.", "In doing this, you'll plant the seed of your new way of doing things that will inevitably win them over."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You can check-out my summary from a talk on this subject by Justin Lilly, in last EuroDjangoCon."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "summary", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.flickr.com/photos/dibau%5Fnaum%5Fh/3501239850/sizes/o/"}]}], [{"text": ["Google uses Django with the App Engine.", "And nobody ever\ngot fired for choosing Google..."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "App Engine", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Google%5FApp%5FEngine"}]}, {"text": ["Like: \n\"Nobody ever got fired for buying IBM\" (1980s)\nand \n\"No one ever got fired for buying Microsoft\" (1990s)."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "Nobody ever got fired for buying IBM", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.barrypopik.com/index.php/new%5Fyork%5Fcity/entry/no%5Fone%5Fever%5Fgot%5Ffired%5Ffor%5Fbuying%5Fibm%5Fmicrosoft%5Fgold/"}, {"href": "http://www.barrypopik.com/index.php/new%5Fyork%5Fcity/entry/no%5Fone%5Fever%5Fgot%5Ffired%5Ffor%5Fbuying%5Fibm%5Fmicrosoft%5Fgold/", "text": "No one ever got fired for buying Microsoft", "childNum": 0, "tag": "a", "childList": []}]}], [{"text": ["I agree with the 'just hack out a demo' school.", "The beauty of Django is that you can set up a quick project with SQLite, define the models, and then instantly have a database API, a slick admin and databrowse to play with.", "If databrowse doesn't cut it, write just enough views to demonstrate django's benefits. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I know PHP people that are queasy about taking on a large-ish content management project, but django makes those kinds of projects relatively easy.", "When they see what you did in a few hours, they may come around."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]