[[{"text": ["It can be confusing in some editors where one line is indented with spaces and the next is indented with a tab.", "This is confusing as the indentation looks the same but causes an error."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Also when your copying code, if your editor doesn't have a function to indent entire blocks, it could be annoying fixing all the indentation."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["But with a good editor and a bit of practice, this shouldn't be a problem.", "I personally really like the way Python uses white space."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["yeah there are some pitfalls, but most of the time, in practice, they turn out to be enemy windmills of the Quixotic style, i.e.", "imaginary, and nothing to worry about in reality.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "windmills of the Quixotic style", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Tilting%5Fat%5Fwindmills"}]}, {"text": ["I would estimate that the pitfalls one is most likely to encounter are (including mitigating steps identified):"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "most likely to encounter", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["That actually kept me away from Python for a while.", "Coming from a strong C background, I felt like I was driving without a seat belt."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It was aggravating when I was trying to fill up a snippet library in my editor with boilerplate, frequently used classes.", "I learn best by example, so I was grabbing as many interesting snippets as I could with the aim of writing a useful program while learning."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["After I got in the habit of re-formatting everything that I borrowed, it wasn't so bad.", "But it still felt really awkward.", "I had to get used to a dynamically typed language PLUS indentation controlling my code."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It was quite a leap for me :)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["When I look at C and Java code, it's always nicely indented."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Always.", "Nicely.", "Indented.  "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Clearly, C and Java folks spend a lot of time getting their whitespace right."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So do Python programmers."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Whitespace block delimiters force a certain amount of code formatting, which seems to irritate some programmers.", "Some in our shop seem to be of the attitude that they are too busy, or can't be bothered to pay attention to formatting standards, and a language that forces it rubs them raw.", "Sometimes the same folks gripe when others do not follow the same patterns of putting curly braces on a new line ;)"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I find that Python code from the web is more commonly \"readable\", since this minor formatting requirement is in place.", "IMO, this requirement is a very useful feature."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["IIRC, does not Haskell, OCaml (#light), and F# also use whitespace in the same fashion?", "For some reason, I have not seen any complaints about these languages."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Long ago, in and environment far, far away, there were languages (such as RPG) that depended on the column structure of punch cards.", "This was a tedious and annoying system, and led to many errors, and newer languages such as BASIC, pascal, and so forth were designed without this dependency."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A generation of programmers were trained on these languages and told repeatedly that the freedom to put anything anywhere was a wonderful feature of the newer languages, and they should be grateful.", "The freedom was used, abused, and calibrated (cf the IOCC) for many years."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "IOCC", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.ioccc.org/"}]}, {"text": ["Now the pendulum has begun to swing back, but many people still remember that forced layout is bad in some way vague, and resist it."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["IMHO, the thing to do is to work with languages on their own terms, and not get hung up on tastes-great-less-filling battles."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Some people say that they don't like python indentation, because it can cause errors, which would be immensely hard to detect in case if tabs and spaces are mixed.", "For example: "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"code": "<pre>\n<code>\n 1 if needFrobnicating:\n2    frobnicate()\n3 update()\n</code>\n</pre>\n", "senID": 1}, {"text": ["Depending on the tab width, line 3 may appear to be in the same block as line 2, or in the enclosing block.", "This won't cause runtime or compile error, but the program would do unexpected thing."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Though I program in python for 10 years and never seen an error caused by mixing tabs and spaces"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["When python programmers don't follow the common convention of \"Use 4 spaces per indentation level\" defined in PEP 8.", "(If your a python programmer and haven't read it please do so)"], "childNum": 3, "tag": "p", "senID": 0, "childList": [{"text": "PEP 8", "tag": "a", "pos": 0, "childList": [{"text": "PEP 8", "tag": "strong"}], "childNum": 1, "href": "http://www.python.org/dev/peps/pep-0008/"}, {"text": "PEP 8", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "If your a python programmer and haven't read it please do so", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Then you run into copy paste issues."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Pick a good editor.", "You'd want features such as:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["For example, Vim lets me highlight tabs with these settings:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n set list\nset listchars=tab:\\|_\nhighlight SpecialKey ctermbg=Red guibg=Red\nhighlight SpecialKey ctermfg=White guifg=White\n</code>\n</pre>\n", "senID": 2}, {"text": ["Which can be turned off at any time using:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"code": "<pre>\n<code>\n set nolist\n</code>\n</pre>\n", "senID": 4}, {"text": ["IMO, I dislike editor settings that convert tabs to spaces or vice versa, because you end up with a mix of tabs and spaces, which can be nasty."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}], [{"text": ["I found this very useful to understand the pitfalls of using white spaces in Python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "this", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.secnetix.de/~olli/Python/block%5Findentation.hawk"}]}], [{"text": ["If you use Eclipse as your IDE, you should take a look at PyDev; it handles indentation and spacing automatically.", "You can copy-paste from mixed-spacing sources, and it will convert them for you.", "Since I started learning the language, I've never once had to think about spacing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["And it's really a non-issue; sane programmers indent anyway.", "With Python, you just do what you've always done, minus having to type and match braces."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Pitfalls"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["It can be annoying posting code snippets on web sites that ignore your indentation."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Its hard to see how multi-line anonymous functions (lambdas) can fit in with the syntax of the language."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It makes it hard to embed Python in HTML files to make templates in the way that PHP or C# can be embedded in PHP or ASP.NET pages.", "But that's not necessarily the best way to design templates anyway."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["If your editor does not have sensible commands for block indent and outdent it will be tedious to realign code."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}]}, {"text": ["Advantages"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["Forces even lazy programmers to produce legible code.", "I've seen examples of brace-language code that I had to spend hours reformatting to be able to read it..."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["Python programmers do not need to spend hours discussing whether braces should go at the ends of lines K&amp;R style or on lines on their own in the Microsoft style."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Frees the brace characters for use for dictionary and set expressions."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Is automatically pretty legible"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]}], [{"text": ["No, I would say that is one thing to which I can find no downfalls.", "Yes, it is no doubt irritating to some, but that is just because they have a different habit about their style of formatting.", "Learn it early, and it's gonna stick.", "Just look how many discussions we have over a style matter in languages like C, Cpp, Java and such.", "You don't see those (useless, no doubt) discussions about languages like Python, F77, and some others mentioned here which have a \"fixed\" formatting style."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The only thing which is variable is spaces vs. tabs (can be changed with a little trouble with any good editor), and amount of spaces tab accounts for (can be changed with no trouble with any good editor).", "Voila !", "Style discussion complete."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Now I can do something useful :)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["The problem is that in Python, if you use spaces to indent basic blocks in one area of a file, and tabs to indent in another, you get a run-time error.", "This is quite different from semicolons in C."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This isn't really a programming question, though, is it?"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["The only trouble I've ever had is minor annoyances when I'm using code I wrote before I settled on whether I liked tabs or spaces, or cutting and posting code from a website."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I think most decent editors these days have a convert tabs-to-spaces and back option.", "Textmate certainly does."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Beyond that, the indentation has never caused me any trouble."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I used to think that the white space issues was just a question of getting used to it."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Someone pointed out some serious flaws with Python indentation and I think they are quite valid and some subconcious understanding of these is what makes experienced programs nervious about the whole thing:-"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": "Cut and paste just doesnt work anymore! You cannot cut boiler plate code from one app and drop it into another app.", "tag": "none", "senID": 2}, {"text": "Your editor becomes powerless to help you. With C/Jave etc. there are two things going on the \"official\" curly brackets indentation, and, the \"unnofficial\" white space indentation. Most editors are able reformat hte white space indentation to match the curly brackets nesting -- which gives you a string visual clue that something is wrong if the indentation is not what you expected. With pythons \"space is syntax\" paradigm your editor cannot help you.", "tag": "none", "senID": 3}, {"text": "The sheer pain of introducing another condition into already complex logic. Adding another  if then else into an existing condition involves lots of silly error prone inserting of spaces on many lines line by hand.", "tag": "none", "senID": 4}, {"text": "Refactoring is a nightmare. Moving blocks of code around your classes is so painful its easier to put up with a \"wrong\" class structure than refactor it into a better one. ", "tag": "none", "senID": 5}]}], [{"text": ["If your using emacs, set a hard tab length of 8 and a soft tab length of 4.", "This way you will be alterted to any extraneous tab characters.", "You should always uses 4 spaces instead of tabs."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["One drawback I experienced as a beginner whith python was forgetting to set softtabs in my editors gave me lots of trouble."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But after a year of serious use of the language I'm not able to write poorly indented code anymore in any other language."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]