[[{"text": ["In your specific case, where it's just an email queue, I wold take the easy way out and use django-mailer.", "As a nice side bonues there are other pluggable projects that are smart enough to take advantage of django-mailer when they see it in the stack."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "django-mailer", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/django-mailer/"}]}, {"text": ["As for more general queue solutions, I haven't been able to try any of these yet, but here's a list of ones that look more interesting to me:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["So far I have found no \"nice\" solution for this.", "I have some more strict soft realtime requirements (taking a picture from a cardboard box being labeled) so probably one of the approaches is fast enough for you.", "I assume emails can wait for a few minutes."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "A \"todo list\" in the database processed by a cron job.", "tag": "none", "senID": 1}, {"text": "A \"todo list\" in the database processed permanently beeing polled by a daemon.", "tag": "none", "senID": 2}, {"text": "Using a custom daemon which gets notified by the webserver via an UDP packet (in Production today). Basically my own Queing system with the IP stack for handling the queue.", "tag": "none", "senID": 3}, {"text": ["Using ActiveMQ as a message broker"], "childNum": 0, "tag": "a", "senID": 4, "childList": []}, {"text": "Using Update Triggers in CouchDB. Nice but Update Triggers are not meant to do heavy image processing, so no good fit for my problem.", "tag": "none", "senID": 5}]}, {"text": ["So far I haven't tried RabbitMQ and XMPP/ejabebrd for handling the problem but they are on my list of next things to try.", "RabbitMQ got decent Python connectivity during 2008 and there are tons of XMPP libraries."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["But perhaps all you need is a correctly configured mailserver on the local machine.", "This probably would allow you to dump mails synchronously into the local mailserver and thus make your whole software stack much more simple."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Stompserver is a good option.", "It's lightweight, easy to install and easy to use from Django/python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["We have a system using stompserver in production for sending out emails and processing other jobs asynchronously."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Django saves the emails to the database, a model.post_save handler in Django sends an event to stompserver and stompserver passes the event to a consumer process which does the asynchronous task (sends the email)."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It scales up quite nicely because you can add consumer processes at runtime - two consumers can send twice as many emails, and the consumers can be on seperate machines.", "One slight complication is that each consumer needs its own named queue so Django needs to know how many consumers are available and send events to each queue in a round-robin way.", "(Two consumers listening on the same queue will both get each message = duplication).", "If you only want one consumer process then this isn't an issue."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["We previously had processes which polled the database continuously for jobs but found that it was adding a lot of load to the system, even when nothing needed to be processed."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Just add the emails to a database, and then write another script ran by some task scheduler utility (cron comes to mind) to send the emails."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You might want to have a look at pymq.", "It's written in python, talks HTTP with it's clients and allows a host of monitoring and management options for queues."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "pymq", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://code.google.com/p/pymq/"}]}], [{"text": ["http://www.snakemq.net/ might work as well"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.snakemq.net/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.snakemq.net/"}]}], [{"text": ["If you already have MySQL installed, you could create a table to use as a \"todo list\" of sorts."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Threads synchronously add jobs to the table, and a batched task removes jobs as they're completed."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["That way, there's no need to install and learn more software, and it should work fine as a persistent job store so long as you're not sending lots of email (like >10/sec)."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "lots", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Is there anything wrong is solving this using the mail infrastructure?", "Like, every app server running their own mail daemons which will queue any locally submitted mail, which forward to a centralized mail server which can do the mail heavy lifting?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You can also use Twisted for this.", "But it won't play with django in all cases, it's very dependant on deployment scenarios.", "The most important thing is every request has to be served by one python process, so you need apache compiled in threaded mode."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]