[[{"text": ["While writing a specialized logging backend to handle logging both locally and to the network is quite possible, I would advise against it.", "The reason being that network latency can be to long so it either stops your application, or logging messages can be queued up if using another process/thread to do the actual network pushing."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["A much simpler solution is to use little script that is scheduled to run once or a couple of times per day, and that copies the log file(s) to the remote location."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["For C++ I highly recommend Poco logging.", "It allows you to specify the formatting and log level/output using e.g.", "a properties file."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Poco logging", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pocoproject.org/slides/110-Logging.pdf"}]}], [{"text": ["I'm not sure, but I think what you're looking for is SPLUNK.", "This can parse almost every log and display it in a unified manner.", "It can listen to ports, read log files via polling and parses and indexes anything you throw at any point of time."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "SPLUNK", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.splunk.com/"}]}, {"text": ["You can use this to set up you're own multi-language logging server/system.", "We've been using this and it seamlessly works in our distributed environment."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["the python logging library that is included with python is quite similar to log4net, so if you are used to those, the other will be quite easy to understand, but they do not share code (as far as I know)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "python logging library", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/library/logging.html"}]}], [{"text": ["Use log4j/log4net with a socket appender or log remotely via rsyslog."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["You might be interested in something like web beacons.", "I know it's not exactly what you're asking for, but you ought to think about it for the same reason that web developers do: it's good to know what users are doing."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "web beacons", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.webopedia.com/TERM/W/Web_beacon.html"}]}]]