[[{"text": ["Seems to me that all 200k people could get a \"token\" to start with but only 200 can complete the token."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So two things come to mind; \n1) why not keep track of \"Seats Remaining\" on the event itself that way you're not doing a count and over bookings cannot occur because the lock needed to update the event would prevent it ever going below zero."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["2)  At anytime during the persons subscription if the seats remaining drops to zero all the remaining tokens become invalid and users are \"kicked\" out of the signup process (being nice about it and apologizing but all seats are now full etc)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Have you found that out, or is it a gut feeling?", "I'd rather benchmark that (and also whether your web servers can carry that load) than assume it on beforehand.", "Indexing (and properly selecting a storage engine) might help a lot here."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Furthermore, wouldn't it be a lot more user-friendly to let people register and enter their account data before registering for an event?", "Because now you seem to favor people who can type real quick, or who use a decent browser."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You could cache the count available in the database, and update that whenever you issue (registration started), confirm (registration finished), or revoke (over 5 minutes) a token.", "But if you need that kind of performance, this really isn't what a SQL database is for."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You could implement a fairly simple token broker using a heap (based on expiring-soonest).", "Every time a token is requested, it'd check the soonest-expiring token and see if it has expired.", "If so, revoke it from whoever it was assigned to, and give it to the new person.", "If not, tell them to try again later. "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "heap", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Heap_%28data_structure%29"}]}, {"text": ["When a registration is completed, you'd have to remove that token from the heap (a relatively expensive operation, but you're only doing that 200 times).", "So your heap would always have tokens equal to the number of free+pending slots."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Handling even thousands-per-second of find-soonest-expiring requests against e.g., a Fibonacci heap is trivial on even modest hardware."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Fibonacci heap", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Fibonacci_heap"}]}, {"text": ["I didn't check, but I suspect that someone else has already solved most if not all of this problem, you may be able to download said token broker."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["Sorry for misreading the question.", "In this case I would suggest having a cache table (yes, you can), that will be updated using a trigger (ON INSERT / DELETE) on the table where the transactions are. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["When you allow a user to go into the transaction you insert his hash and expiration timestamp into that table.", "It triggers a trigger, that will update the cached value (i.e.", "value in the cache table) according to that - +1 for insert / -1 for delete. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["When checking wheteher there are free seats, you check the cache table. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Would this sort of caching work?", ":)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Redis http://redis.io is a good fit for what you're wanting to do.", "You can keep a counter of available seats, store the temporary data and have it auto-expire... Super versatile. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://redis.io", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://redis.io"}]}], [{"text": ["I agree with xQbert, with each successful attendance fill out completion you just decrement the total in the database row for the event (or an adjoining table)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If your worried about reservation collisions then just decrement it at the beginning of filling out the attendance info; Then add a row to a temp table saying the person with this session id is filling out the attendance form for this event and they have 5 minutes from this timestamp to complete it.", "When they complete the form their entry is removed from this temp table."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Then run a cron job on this table that queries for timestamps that are less than or equal to the current time - 5 min.", "Any that come up will be removed from the table and their events will get a seat incremented back on it.", "Then when they submit the form past the 5 min timeframe it will check to make sure they still have an entry in the table before saving their seat permanently."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If they don't then check to see if there are any seats remaining.", "If there are then decrement the seat count and insert their reservation record.", "If not then give them an error that says that they didn't complete the form in the allotted time, lost their position in line and you ran out of seats."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Its simple enough and can be done all on the PHP side.", "You will probably want to put a JS timer on their page so that they know how much time they have left though."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["It's probably worth to re-visit your design:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The remaining seats are the total number of seats minus booked seats."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This number is only valid in a certain moment of time as the number of booked seats change."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["To book a seat, you're doing a transaction: A user signals that she wants to book one or multiple seats, processes the registration and then finally books (or not)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["As long as this transaction has not been finished, the remaining seats number that you can calculate is probably wrong."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["You have two options here:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["With the first one, each time a user starts a transaction and tells the application that X seats should be booked, these X seats are locked.", "It does not mean that those seats are already booked, they are just locked, so the user has enough time to complete the booking transaction.", "If the transaction finishes, those locked seats are booked by the user."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["With the second one, Optimistic Locking the user just starts to register but nothing is locked.", "At the end of the booking transaction, the transaction may fail if not enough seats are available any longer."], "childNum": 1, "tag": "p", "senID": 7, "childList": [{"text": "Optimistic Locking", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["Permissive Locking might prevent some users from subscribing before they start a transaction - even if they could a day later - Optimistic Locking might prevent some users from subscribing at the end of the transaction."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["You need to find out what's working best for your case.", "Normally optimistic locking is more nice to users (as only some fail at the end), however permissive locking will help you to not frustrate users at the end of a transaction.", "If there is always a run on the tickets, maybe permissive locking is best."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["You can think about how to make things less frustrating for users by bringing usability into play.", "For example with optimistic locking, each page in the transaction could have a AJAX remaining counter at the top giving the current numbers of remaining seats, so you can inform users early if seats have run out.", "So even they might already have put something into forms, they can see how lucky (or fast enough) they are with their doing."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["I would not time-limit users to sign-up btw.. That puts stress on the user.", "With optimistic locking and the AJAX bar users will be stressed enough if seats run out.", "It's just that your system does not need to care about sign-ups."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["If you want to allow sign-ups with a peace of mind, you need to choose permissive locking.", "Then you need a timeout, but I would do this per user action, so if the user is active, the timeout will be extended with another 15 minutes until completed.", "I would choose a high value here to not frustrate the user of getting a timeout."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["For those users who want to sign-up while all available seats are locked by signup transactions, you should offer a back-list and tell the users that currently X seats are locked with sign-ups but they might be lucky to catch another seat later.", "Or you allow to over-book the number of locked seats so those users are queued in case another user does not finish her transaction successfully."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["BTW, the database design should reflect the procedure you define upfront, I don't think you run into real problems here as long as you know what you try to achieve.", "As everything is done in buisiness transactions you can even keep a simple count per each event of total, booked and locked seats.", "That's one simple query, no need for aggregation like with COUNT(*).", "Triggers and stored procedures can be helpful, too."], "childNum": 1, "tag": "p", "senID": 14, "childList": [{"text": "COUNT(*)", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}], [{"text": ["I think COUNT(*) applied to 200k records could be retrieved fairly quickly.", "I just tried a query on 243k records and it took well under 1 second."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But I don't think you even need COUNT, except at the final confirmation step."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I don't think you need any \"cron jobs\", either.", "That would certainly be more intensive than just querying the database."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Not to mention the fact that you don't even have to let users check how many people are attending if the event is already fully booked.", "Once you hit 200 attendees, you can just change another db value.", "The front page should not even display a clickable button if you don't have seats left."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Also, if there are plenty of seats left, why limit a user to 5 minutes?", "Why clean out their session with a \"cron job\" and force them to start all over?", "What if there are still 100 seats left?", "Instead, when 200 seats are reserved, but not all confirmed, you have the newest clickers crowd out the older ones one-by-one."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["On your front page, where you have the \"sign up button\", it doesn't need to perform the COUNT(*) query."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["You can just have it do this:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"code": "<pre>\n<code>\n SELECT `event_status` from `events` WHERE `event` = 'this_event';\n</code>\n</pre>\n", "senID": 7}, {"text": ["The event_status can be updated as soon as all the seats are confirmed."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Then using your PHP or whatever, you either display the button, or display \"Sorry, Event is Full\"."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"code": "<pre>\n<code>\n if($event_status == 'full') { echo 'Sorry, it's full; }\nelse { echo $press_this_button; }\n</code>\n</pre>\n", "senID": 10}, {"text": ["Once all 200 seats are reserved, but not all are confirmed, you start kicking people out.", "When a new person clicks the button, you do this."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"code": "<pre>\n<code>\n SELECT MIN(time_initiated) as time_initiated, id, sessID FROM testtime WHERE `time_initiated` &lt;= DATE_SUB(NOW(), INTERVAL 5 MINUTE);\n</code>\n</pre>\n", "senID": 12}, {"text": ["If that gives you any results, then you have your guy to kick off the waiting list.", "Just flag his session as \"Expired\" and if he ever does click submit, 1st check to see if the event is fully confirmed.", "If so, tell him sorry he was too late.", "If not, then repeat the above query, kick someone else off the bottom of the list, and confirm him, unless all people on the waiting list are less than 5 minutes old, in which case you can ask him to wait a few minutes and see if any spots free up."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["After every successful confirmation, you can query the COUNT of confirmed guests and if the number is 200+, you change the event_status to \"full\" and prevent anyone else from clicking that button.", "They will just see the message that the even is full.", "You should be able to wrap those 2 queries in a transaction to ensure that multiple people cannot book at the exact same time and you end up overbooked."], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"text": ["That's just my 2 cents."], "childNum": 0, "tag": "p", "senID": 15, "childList": []}]]