[[{"text": ["Difficult decision.", "Normally I would say 'definitely Drupal' without hesitation, as Drupal was build as a System for community sites from the beginning, whereas Wordpress still shows its heritage as a blogging solution, at least that's what I hear quite often.", "But then I'm working with Drupal all the time recently and haven't had a closer look at Wordpress for quite a while."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["That said, Drupal has grown into a pretty complex system over the years, so there is quite a learning curve for newcomers.", "Given that you are already familiar with Wordpress, it might be more efficient for you to go with that, provided it can do all that you need."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "might", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["So I would recommend Drupal, but you should probably get some opinions from people experienced with Wordpress concerning the possibility to turn it into a community site first."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "hr", "senID": 3}, {"text": ["As for the Python vs. PHP CMS question, I'd say that the quality of a CMS is a function of the ability of its developers, the maturity of the system, the surrounding 'ecosystem', etc.", "and not of the particular language used to build it.", "(And discussions about the quality of one established language vs. another?", "Well - let's just not go there ;)"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["I make websites both using Drupal and Django - sometimes with Pinax (Python).", "So let me try to set up the differences between Python and PHP, and the different CMS's."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Django", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://djangoproject.com"}, {"text": "Pinax", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://pinaxproject.com"}]}, {"text": ["Python - PHP"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Python - PHP", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"tag": "ul", "num": 2, "lis": [{"text": "Pros for Python.\n", "tag": "none", "senID": 2}, {"text": "Cons for Python.\n", "tag": "none", "senID": 3}]}, {"text": ["Generally it's easier to code with python in many regards, but this is something that can be overcome simply by using more time with PHP.", "Also if you don't know python, that means you will have to invest some time learning it, and the things you can do with python.", "On the other hand it's a bit more difficult to find cheap hosting for Python projects."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Django/Pinax vs Drupal vs Wordpress."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Django/Pinax vs Drupal vs Wordpress.", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["It's always difficult to be able to say, which CMS?CMF to use.", "Which to choose is dependent on several factors."], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "How much custom coding are you going to do?", "tag": "none", "senID": 7}, {"text": "How much customization do you need?", "tag": "none", "senID": 8}, {"text": "How fine grained control over the system do you want?", "tag": "none", "senID": 9}]}, {"text": ["Wordpress' strength is it's ease of use, and how you quickly and easily can setup a lot of things.", "You might be able to get a site like what you want with only a few hours spent.", "The problem with wordpress however, is when you want to make custom functionality.", "It doesn't have a strong API like Drupal, and you might have problems changing the output to give you exactly what you want."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["Drupal's great strength is it's powerfull API, ability to customize and overwrite anything.", "In addition to all this, it also has a lot of modules giving you the ability to in many cases build your most/all of your site in a very short time.", "The problem with Drupal is, that it's not easy to use.", "You have to spend time learning the system and API before you can take advantage of it.", "the Drupal AI is also hard to navigate for newcomers, and it takes a while before you learn where the different things are.", "Drupal is a big machine though, and it can get a bit slow, unless you setup something like Varnish in front of it."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["Django is made for rapid development.", "So once you get into it, which isn't that hard, you can quickly create apps to suite your needs.", "You have complete control over the urls.", "The problem with django is that it's not so easy to find the different apps that has been made and figure out which are good.", "The template system makes it easy to make the markup like you want, but you can't change the functionality of the apps the same way you can with Drupal.", "One thing to note, is that Pinax doesn't have a 1.0 release yet, while Drupal is on code freeze for it's 7.0 release."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["All in all, with all these tools, the biggest challenge is finding out how to use them.", "If you know wordpress very well and just want to make this one site, you can just use it and be done with it.", "If however you want to take it further, I would suggest that you use either Django or Drupal.", "These two has some great development potential. "], "childNum": 0, "tag": "p", "senID": 13, "childList": []}], [{"text": ["If you're open to Python, and are building a social / community site, I would check out Pinax for the Django web framework.", "It provides a lot of common social site features like user accounts, blogging, tagging, friend invites, etc."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Pinax", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pinaxproject.com/"}, {"text": "Django", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/"}]}, {"text": ["Here's an example of a social site built using Pinax."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://cloud27.com/"}]}], [{"text": ["There's a WordPress extension called BuddyPress that'll give you a ready-to-go social network.", "If it suits you, it may be an easier solution than a Drupal install.", "If it doesn't suit you, though, I find Drupal more suited to extending in the long run."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "BuddyPress", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://buddypress.org"}]}], [{"text": ["I'd do it Drupal as it's a proven social networking platform and has te ability to be upgraded to do just about anything, from the vast range of modules on offer (read up on cck and views- they basically let you add your own customised page type (cck) and views lets you show data in various different ways, and based on various other parameters."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I run my own mini social network site in Drupal - Tunstall Communities - Bankeyfields,  "], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Tunstall Communities - Bankeyfields", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.bankeyfields.co.uk"}]}, {"text": ["Heres a social network/news site using Wordpress, which they've now opted to upgrade to Drupal, as they want more social networking features."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "social network/news site", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://pitsnpots.co.uk/"}]}], [{"text": ["DrupalSN is a social network site designed for showing you how to build Drupal sites, and a lot of the Tutorials on there are focussed on user interaction, so it will be a great resource if you go with Drupal."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "DrupalSN", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://drupalsn.com/"}, {"href": "http://drupalsn.com/learn-drupal/drupal-tutorials", "text": "Tutorials", "childNum": 0, "tag": "a", "childList": []}]}]]