[[{"text": ["Separate 'global' files for constants, configurations, and includes needed everywhere are fine.", "But when they contain actual mutable variables then they're not such a good idea.", "Consider having the files communicate with function return values and arguments instead.", "This promotes encapsulation and will keep your code from becoming a tangled mess. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Clear communication between files makes them easier to understand and makes what's going on more obvious.", "When you're using variables and nobody knows where they came from, things can get pretty annoying.", ":)"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Uhm, i think it does not make sence if this happens: \"realized that helper.py needed to reference variables from main\", your helper functions should be independent from your \"main code\", otherwise i think its ugly and more like a design failure. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I try to design my code so that it looks much like a pyramid.", "That, I have found, leads to cleaner code."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'm not too sure about if that's good practice but if you use classes, I don't see why there should be a problem.", "Or am I missing something?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to be able to just run each script independently too, and that's what is keeping you from going object oriented then you could do something like the following at the end of your script."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"code": "<pre>\n<code>\n if __name__ == '__main__':\n    # Code that you want to run when the script is executed.\n    # This block will not be executed if the script is imported.\n</code>\n</pre>\n", "senID": 2}, {"text": ["Read more about classes in Python here."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/tutorial/classes.html"}]}], [{"text": ["You should probably read up on Dependency Inversion."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Dependency Inversion", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.c2.com/cgi/wiki?DependencyInversionPrinciple"}]}], [{"text": ["Seems like what you want is to organize various dependencies between components.", "You will be better off expressing these dependencies in an object-oriented manner.", "Rather than doing it by importing modules and global states, encode these states in objects and pass those around."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "objects", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}, {"text": ["Read up on objects and classes and how to write them in Python; I'd probably start there."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]