[[{"text": ["There are many useful libraries (not to mention educational material, cookbook snippets, etc.", ") that have yet to be ported to Python 3.0, so I recommend using Python 2.x for now (where, currently, 5 &lt;= x &lt;= 6).", "Doubly so if you're a beginner to Python.", "Triply so if you're actually planning on releasing some software--many systems do not ship with Python 3.0."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Python 3.0 is not radically different from the Python 2.x series; what you learn in Python 2 will very much still apply to Python 3.", "Searching Python 3.0 here on SO reveals many threads in which the majority declare that they're not moving to Python 3.0 anytime soon."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["If your looking for a GUI editor, have a look at these:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["wxFormBuilder"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}, {"text": "XRCed ships with wxpython and could do this as well.", "tag": "none", "senID": 2}]}, {"text": [".XRC files are xml file which describes your GUI and are not language specific.", "You could load these files from a Python 2.6 and a Python 3.0 without any change."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["WxPython is currently available only for Python 2.6 though.", "I would not worry too much about converting a python 2.6 to 3.0.", "This is the matter of a few lines to change."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["The problem with the .XRC approach is that you still need to glue these xml files with Python code.", "If you're a beginner this might be as tricky as writing the GUI by hand.", "That's the problem with WxPython anyway: I don't know any real good editor for it, have a look at this discussion"], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "discussion", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/800849/nice-ide-for-wxpython-or-tkinter-gui-development"}]}], [{"text": ["Just use whichever editor you are most comfortable with."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The \"leading space as logic\" and duck typing mean that there is a limited amount of syntax checking and re-factoring an editor can reasonably do (or is required!", ") with python source."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you dont have a favorite editor then just use the \"idle\" editor which comes with most python distributions."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["If you were talking about a GUI design tool then you need to choose among the several supported GUIs (Tk, WxWindows etc.", "etc.", ") before you choose your design tool."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["The only GUI toolkit currently available in Python3.0 is Tkinter, and I don't think there are any Python3.0 GUI-builders available yet."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["WING 3.2 beta work in python 3."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["ricnar"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["PyQt 4.5 (released a couple of days ago) added support for Python 3"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PyQt 4.5", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.riverbankcomputing.co.uk/software/pyqt/download"}]}, {"text": ["That doesn't of course devaluate gotgenes answer: most of the 3rd party libraries are just not ready yet for Python 3."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]