[[{"text": ["I'm sure I'm going to get downvoted on this because it doesn't answer the question.", "I do feel, however, that this question needs to be unasked because it is a flat impossibility."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["In particular the following is impossible:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This is just flatly not going to happen.", "There are no cross-platform GUI frameworks that accomplish this task.", "You will be searching in vain for one."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["So..."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["What's left for you to do is code your applications properly.", "Divide them into semi-independent chunks like this:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 4, "lis": [{"text": ["PD (problem domain)"], "childNum": 0, "tag": "strong", "senID": 5, "childList": []}, {"text": ["HI (human interface)"], "childNum": 0, "tag": "strong", "senID": 6, "childList": []}, {"text": ["SI (system interface)"], "childNum": 0, "tag": "strong", "senID": 7, "childList": []}, {"text": ["DS (data storage)"], "childNum": 0, "tag": "strong", "senID": 8, "childList": []}]}, {"text": ["You may also wish to consider a fifth chunk:"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"tag": "ul", "num": 1, "lis": [{"text": ["NY (not yet)"], "childNum": 0, "tag": "strong", "senID": 10, "childList": []}]}, {"text": ["The key to this is to design each of these chunks with interfaces that don't change so your PD chunk interacts with the DS chunk using the same interface regardless of which backing store you wind up using.", "It's told \"save this object under this key\", for example, and in the background it does all the SQL (or file system (or NoSQL)) operations necessary to accomplish this aim.", "That way when you have to add a new back-end you don't touch your fully functioning PD code at all."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["Going to your specific examples, you will have to code your HI portion to write to an interface that the PD components know how to speak to.", "That interface won't change no matter what HI platform you're on -- but if you really want that native look-and-feel across multiple platforms you have no choice but to code a separate HI for each and every portion.", "They may even be in different languages on each one: C# on Windows and Objective-C on Macintosh, for example."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["There is no easy way around this.", "If you (rightly!", ") insist on having a native look and feel on multiple platforms you are going to be writing the HI portions of your code once for each platform.", "If you divide your code base up properly, however, this is not too onerous as you'll only be writing the HI pieces and not modifying/rewriting the PD (or SI/DS/whatever) pieces."], "childNum": 1, "tag": "p", "senID": 13, "childList": [{"text": "only", "childNum": 0, "tag": "strong", "pos": 3, "childList": []}]}], [{"text": ["I would definitely go with python + devel's choice of libraries.", "It ranks greatly on your 1-6 checklist.", "Frameworks / libraries: You can go with Qt, it has great development support - Qt designer/creator, and PyQt is a great toolkit.", "wxWidgets is also a reasonable choice, but I wouldn't go with tk or gtk+.", "Python also has tons of libs for sound and media.", "You can easily pich sqlite for desktop app, but if you can afford centralisation, I would go with postgresql.", "For networking, you can use the lightweight support libs, but if you need something larger - twisted is very powerful."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "can", "childNum": 0, "tag": "em", "pos": 2, "childList": []}]}], [{"text": ["This \"1.Cross Platform Modern - native look &amp; feel\" is an impossible request.", "There is no framework with any programming language that will give you this.", "Every single truly modern looking cross-platform application uses a separate UI layer for each of supported platforms.", "See for instance the source for Google Chrome to see what I mean."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I'll say upfront my strength is Java.", "I've used a lot of other languages years ago such as PowerBuilder and VB.net, and am currently working in Objective C on Mac as well as Java. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Generally speaking I would think it's hard to go past Java for choice when it comes to:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"tag": "ul", "num": 5, "lis": [{"text": "Third party libraries offering about everything you could desire.", "tag": "none", "senID": 2}, {"text": "Multiple IDEs across all platforms.", "tag": "none", "senID": 3}, {"text": "Documentation, mostly very good, but with some third party APIs it can be lacking.", "tag": "none", "senID": 4}, {"text": "Cross platform support. There's not much it doesn't work on.", "tag": "none", "senID": 5}, {"text": "Build and test systems.", "tag": "none", "senID": 6}]}, {"text": ["However, having said that it does sound like the GUI is a primary concern and there you may find some issues.", "Consistency of look and feel varies from platform to platform.", "However there are also a range of third party L&amp;fs out there as well which may be more consistent."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["You could attempt to role your own, but it would involve a fairly large amount of your development time."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["As for a couple of the cons you mention.", "I don't think java is harder to especially hard to deploy.", "And depending on the how you setup your project, it can be either a complex or simple dev environment.", "This is certain where a disciplined developer will shine where as a messy developer will rapidly come a cropper."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}], [{"text": ["Best Programming language depends on what you know already.If you have experience in Java already, then Java is best to develop, If have experience in C++ already C++ is Best to develop. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["So my opinion is what ever language your team is well experienced that ll be the best choice."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Nowadays we can do almost any type of applications with any language and we have many free frameworks present online."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I'd try pyQt before going down the more complex Java/C road, considering your app and team size.", "There are articles showing how to deploy pyQt apps using py2exe."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "how to deploy pyQt apps", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://arstechnica.com/open-source/guides/2009/03/how-to-deploying-pyqt-applications-on-windows-and-mac-os-x.ars"}]}], [{"text": ["C++ -- shouldn't Qt be an option?", "But I think it is strange to pick C++ for a GUI program today.", "I would go with wxPython but you are right, that it doesn't look great visually."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Despite its problems, I'd recommend Java with Swing/SWT because of its cross-platform support.", "Python, Ruby, and others are great for Linux and other Unix-likes, but their presence on Windows is negligible and deploying them on Windows is a nightmare."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The only language that will let you deploy to any number of architectures without a mess of external dependencies is Java, which works nicely on Windows and Linux."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I think Swing/SWT looks okay (Eclipse and OpenOffice.org are a few examples of good Swing/SWT apps), and you'll be able to easily find/train Java developers."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Short while ago I would have suggested Java as well, but i'm not so sure its a good option now in the claws of Oracle.", "IMHO Python is your best option, closely followed by C++."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Out of interested does it/them need to be specifically a desktop application?", "With web services its easy to integrate native app's (e.g.", "Office) with web applications.", "Web apps are instantly cross platform and as pretty or as ugly as you want."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Shoes is a cross platform GUI toolkit using Ruby for Linux, Mac OSX and Windows.", "It has a good native look and feel on all platforms.", "I have only tried it on Linux and it works really well but from screenshots it looks good for Mac and Windows too.", "It does, however, allow you to deviate from the users' themes by setting your own background colour but it uses the system colour scheme if you don't specify the colours manually. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It has inbuilt drawing capability (using cairo) so is good for small graphical applications.", "It is less suited to large, complicated user interfaces with advanced widgets although it is still possible to create this soft of application."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["From my experience, Shoes is easy to use and well documented.", "The API is very rubyish, which should make it easy for someone experienced in ruby."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "well documented", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://shoesrb.com/manual/Hello.html"}]}, {"text": ["It also has the capability to create single file executables for all 3 platforms.", "These embed the ruby interpreter and the Shoes toolkit.", "This makes it very easy to distribute."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Shoes is probably not the best choice for large, complicated GUIs.", "For that you will need to use another toolkit.", "None of the cross platform frameworks fit in exactly with all 3 platforms.", "Qt only fits in well with KDE and GTK with GNOME.", "TK looks bad everywhere.", "Wx* fits in on Linux, Windows and Mac - almost.", "The only way to get exact native looks is to use the native toolkits for that platform - this means GTK for GNOME, QT for KDE and the native Mac and Windows toolkits (I'm not sure what these are called) for those platforms.  "], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "almost", "childNum": 0, "tag": "em", "pos": 5, "childList": []}]}], [{"text": ["My advice is to look at Java (using Swing) and .NET (using C# and maybe Winforms or GTK)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I have found Java to be very well suited for cross-platform development.", "The environment presented to the programmer is very well defined, and it is very easy to write code that runs on most if not all Java platforms if you stay with pure Java."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Deployment is not harder than with other languages, plus there is Java Web Start as an alternative for easy updates. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["I have also found .NET well suited for Windows application, but it marries you in eternity to the Windows platform (any Mono-fans please show me a version guaranteed to behave like .NET).", "We did not want to marry Windows so we stayed on Java."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["JRuby might fit the bill.", "It combines the strengths of Java and Ruby."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]