[[{"text": ["Let me share my own experience with django.", "My prerequisits:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["average knowledge of python"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["very weak idea of how web works (no js skills, just a bit of css)"], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["my day job is filled with coding in C and I just wanted to try something different,\n so there certainly was a passion to learn (I think this is the most important one)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}]}, {"text": ["Why I've chosen django:"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": ["I've already knew bits and pieces of python"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["django has excelent documentation, including tutorial, which explained everything\n  in very clear and simple manner"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}]}, {"text": ["It is worth to read complete manual first (it took me two or three weekends.", "I remember I could not remember/understand everything at first pass, but it helped me to learn where\nthe information can be found when needed.", "There is also another source of documentaion\ncalled djangobook.", "Djangobook contains same information as manual, but things are explained more in detail.", "It's worth to read it also, it helps to catch up with MVC concept, if you have not tried that before."], "childNum": 2, "tag": "p", "senID": 7, "childList": [{"text": "manual", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.djangoproject.com/en/dev/"}, {"text": "djangobook", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.djangobook.com/"}]}, {"text": ["And finally to answer your question best: there are already also OpenId modules ready for you.", "I'm considering to use django-authopenid for my new project.", "It supports OpenId, while providing fallback to locally managed users."], "childNum": 2, "tag": "p", "senID": 8, "childList": [{"text": "OpenId", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://openid.net"}, {"text": "django-authopenid", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://bitbucket.org/benoitc/django-authopenid/wiki/Home"}]}, {"text": ["There is certain learning curve if you are going learn django.", "The more you know about the web and python the steeper the curve is.", "I had to also learn bits and pieces of javascript and it took me also some time.", "If you are able to spend full time learning django, then\nyou can expect you'll be able to deliver first results within 4-6 weeks.", "It took me 6 months, since I was doing my django studies in free time."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}], [{"text": ["There are several blog entries &amp;c pointing out some problems with Python on Dreamhost and how to work around them to run several web frameworks that could suit you.", "(Most of the posts are over a year old so it may be that dreamhost has fixed some of the issues since then, of course, but the only way to really find out is to try!-)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Start with this page, dreamhost's own wikipage about Python -- at least you know it's quite current (was last updated earlier today!-).", "It gives instructions on using virtual env, building a custom Python &amp;c if you absolutely need that, and running WSGI apps -- WSGI is the common underpinning of all modern Python web frameworks, including Django which everybody's recommending but also Pylons &amp;c."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "this page", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.dreamhost.com/Python"}]}, {"text": ["Some notes on running Pylons on Dreamhost are here (but it does look like Dreamhost has since fixed some issues, e.g.", "flup is now the dreamhost-recommended FCGI layer for WSGI as you'll see at the previously mentioned URL) and links therefrom.", "If you do go with Pylons, here is the best place to start considering how best to do auth (authentication and authorization) with it.", "I'm trying to play devil's advocate since everybody else's recommending django, but for a beginner django may in fact be better than pylons (still, spending a day or so lightly researching each main alternative, before you commit to one, is a good investment of your time!-)."], "childNum": 4, "tag": "p", "senID": 2, "childList": [{"text": "here", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.heikkitoivonen.net/blog/2008/02/03/pylons-on-dreamhost/"}, {"text": "flup", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "is", "childNum": 0, "tag": "em", "pos": 2, "childList": []}, {"text": "here", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://wiki.pylonshq.com/display/pylonscookbook/Authentication%2Band%2BAuthorization"}]}, {"text": ["For Django, again there's an official dreamhost wiki page and it's pretty thorough -- be sure to read through it and briefly to the other URLs it points to.", "The contributed auth module is no doubt the best way to do authentication and authorization if you do decide to go with Django."], "childNum": 2, "tag": "p", "senID": 3, "childList": [{"text": "wiki page", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.dreamhost.com/Django"}, {"text": "auth", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["And, whichever way you do choose -- best of luck!"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}], [{"text": ["You can try starting with django-registration."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "django-registration", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://bitbucket.org/ubernostrum/django-registration/wiki/Home"}]}, {"text": ["EDIT: You can probably hack something up on your own faster than learning Django.", "However, learning a framework will serve you better.", "You'll be able to easily ask a large community  when you have problems, and build on work that's already been done.", "And of course, if you're doing something new in the future, your knowledge of the framework can be more easily reapplied."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["django framework"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Django is the way to go.", "You can try it locally on your PC and see do you like it.", "It is very nice framework and allows you to quickly build your applications."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to give Django quick go to see how it feels you can download Portable Python where everything is preinstalled and ready to use."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "Portable Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.portablepython.com"}]}, {"text": ["You can also do what you are trying to do with apache module mod_python (which is also used to run Django) but it would require more coding.", "Your code snippet would work with mod_python (http://www.modpython.org/) right away.", "I think mod_python comes pre-installed on Dreamhost so you can try it."], "childNum": 2, "tag": "p", "senID": 2, "childList": [{"text": "would require more coding", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "http://www.modpython.org/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.modpython.org/"}]}], [{"text": ["For a more complete basic setup (with lots of preprogrammed features) I would point you at Pinax which is a web site on top of Django (which I praise of course, see the dedicated page on dreamhost Wiki at http://wiki.dreamhost.com/Django)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://wiki.dreamhost.com/Django", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://wiki.dreamhost.com/Django"}]}, {"text": ["The introduction on the project's web site (pinaxproject.com) : "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["There you will have a complete web site to customize and add features to."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["I've noticed that a lot of people recommend Django.", "If you're running on a shared host on Dreamhost, the performance will not be satisfactory. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["This is a known issue with Dreamhost shared hosting.", "I have installed web2py on my Dreamhost shared account and it seems to work okay; search the google groups for an install FAQ."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Later edit: google Dreamhost Django performance for an idea of what I mean."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Another voice to the choir."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Go for django.", "It's very good and easy to use."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]