[[{"text": ["Scale this down a lot.", "I would recommend looking at one very small piece of an operating system that you would want to do, perhaps parallel processing.", "There is no feasible way you will be able to write an entire operating system in under 500 hours, let only 5000 hours.", "The real question is is this for an undergraduate course or a graduate course?", "The answer to that will greatly reflect what is needed to pass."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Adding\nGrab a book on a topic about the operating system that interests you and focus intently on that for 3 months and you may just produce something that is good.", "Operating systems may seem like they don't do much on the outside, but think of it this way Windows has ~50 million lines of code."], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "Adding", "childNum": 1, "tag": "em", "pos": 0, "childList": [{"text": "Adding", "tag": "strong"}]}, {"text": "Adding", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}, {"text": "", "childNum": 0, "tag": "br", "pos": 1, "childList": []}]}], [{"text": ["Does your professor require a \"low-level\" component in the project?", "For example, anything that deals with the hardware or the instruction architecture.", "If so, your professor will not allow you to do the project in Python.", "The project must be written in C and assembly.", "And you will invariably be working on modifying the Linux kernel."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["However, nowadays Operating System is no longer confined to the low-level aspect.", "Virtualization, database, parallelization are all built on top of the Operating System.", "If your professor is \"old school\" then he/she may not consider those new topics to be part of Operating System.", "So, you may need to bring some sample ideas to your professor and seek clarification."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Whether to go into low-level, as some have suggested, depends entirely on the professor's educational goals."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["A good project would include one or more of:"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "Input / Output", "tag": "none", "senID": 4}, {"text": "Storage\n", "tag": "none", "senID": 5}, {"text": "Starting / managing / logging tasks (processes, threads or Python functions), locally or remotely", "tag": "none", "senID": 6}, {"text": "Managing resources\n", "tag": "none", "senID": 7}, {"text": "Communication", "tag": "none", "senID": 8}, {"text": "Concurrency ", "tag": "none", "senID": 9}]}, {"text": ["A project that does not directly interact with hardware, but would still be good project, will be:"], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["Then it will be a good Operating Systems project, regardless of the language used."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["I would suggest implementing your own memcached, map-reduce or a simple version control system as good project examples."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["Edited: removed ranting"], "childNum": 1, "tag": "p", "senID": 13, "childList": [{"text": "Edited: removed ranting", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["I don't get how you think you can write an operating system in Python.", "You need native code to at least load an interpreter during bootup, not to mention hardware communication, drivers etc., all of which would be nearly impossible to do given current Python interpreters when running on a bare machine.", "I'm also pondering if you are aware that you'd have to port a given Python interpreter to compile and run without an underlying operating system, which alone would keep you busy for a time."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["It's good that you are ambitious, but I honestly think you could not even finish the basic operating system, let alone \"some very basic apps running\"."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["You probably can't do this in one semester."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["If you want to take a swing at something similar, read up on the Solo operating system, built by Per Brinch Hansen and his students at Caltech.", "They wrote the whole thing in Concurrent Pascal, a Pascal derivative developed by Brinch Hansen."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The source for Solo is available in Brinch Hansen's \"Architecture of Concurrent Programs\".", "(link is to a PDF of the entire book)  Your professor SHOULD have a copy.", "Your university library should have a copy.", "Occasionally, copies show up on Amazon."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "\"Architecture of Concurrent Programs\"", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.cs.otago.ac.nz/cosc470/archprog-brinch_hansen.pdf"}]}, {"text": ["Or you could do a version of Brinch Hansen's RC4000 Nucleus.", "(Google is your FRIEND."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["You could probably code a small embedded-system OS in the timeframe you indicate, using concepts that are over a decade old.", "Many newer operating systems require many more complicated scheduling and memory-management heuristics than would be typical in a small embedded OS; designing an entire modern OS would not be a practical single-person project, but one might be able to do something interesting with some subsystem of it.", "I personally think there's some room for improvement in flash file systems, but I don't know what your prof would think.", "What is your prof really looking for?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["In our university we have operating systems course where we too are supposed to develop something on linux.", "Not entire OS.", "We did our own scheduling policy and file system for linux.", "But this will be done in C since linux is in C. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["I know...the idea is pretty bubbly.", "Even I had this experience (for a while :p)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But Its really when you dig into it, that you realize how big a word you just said.", "I am in no cost gonna say that you can't make an OS.", "Cause I believe in keeping unachievable dreams.", "Cause doing this might help you learn faster. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Anyways, PYTHON?", "na.", "Go for C. "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "Read (principles) : System processes\n&amp; services.", "tag": "none", "senID": 3}, {"text": "Write (code)  :  Practice &amp; get used\nto code. Use language as a tool, not\na skill. ", "tag": "none", "senID": 4}, {"text": "Learn (frm mistakes) : This is    the\nbest thing. You will have an OS    if\nyou learn frm dem.", "tag": "none", "senID": 5}]}, {"text": ["I would however suggest not to waste your 3 months, googling how to create an OS in 3 months &amp; rather\nAlso dun things things like which say the job you are trying is a piece of cake.", "eg : http://linuxologist.com/1-general/create-your-own-linux-distro/\nEven that heading is misleading n discouraging."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "http://linuxologist.com/1-general/create-your-own-linux-distro/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://linuxologist.com/1-general/create-your-own-linux-distro/"}]}, {"text": ["All that said.", "Best of Luck :)"], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Learn from what other people have done in the world of operating systems.", "In addition to the books mentioned above download the vanilla linux kernel source and start exploring it: http://www.kernel.org/ .", "Robert Love's book on the Linux Kernel, Linux Kernel Development, will give you a great overview of the all the pieces involved in the Kernel.  "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://www.kernel.org/", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.kernel.org/"}]}, {"text": ["A major highlight would be how the O(1) scheduler works in the new kernels since scheduling is just one of the many and major concerns that come into play when writing an Operating System."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Developing an operating system in Python is possible.", "However, you might want to choose C or Assembly because there's an huge code base developed in those languages."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "is", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "huge", "childNum": 0, "tag": "strong", "pos": 1, "childList": []}]}], [{"text": ["lol, it reminds me this"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["http://www.getacoder.com/projects/programming_c_87390.html"], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://www.getacoder.com/projects/programming_c_87390.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.getacoder.com/projects/programming_c_87390.html"}]}, {"text": ["Making a complete OS like Windows or Mac or Linux is as hard as making a MMORPG."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "MMORPG", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://gamedev.stackexchange.com/questions/90/why-is-so-hard-to-develop-a-mmo"}]}, {"text": ["Maybe you should make the simplest OS that lets you boot successfully and run some simple command line scripts, like how DOS works, but in Python and runs Python."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Buddy, here is the answer you have been looking for:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Writting an Operating System is not different than writting any other application, actually it is far easier than writing any other code for the reason an Operating System is an ALL-PURPOSE software or what is meant as a platform... and you know it!."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["All of the previous asnwers are EXTREMELY USEFUL!, and ALL OF THE PREVIOUS INCLUDING THIS ONE WILL HELP YOU IN CODING YOUR O.S.", "actually in less than three months."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["Please, try to be objective and get rid of negative answers (that is just mindblocking...)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["A Software Developer actually CODE EVERYTHING that comes to his mind!", "(in my case I was a SUPERB software developer until I had a brain accident and suffered hypoxia for a considerably period... not want to talk further about it... me traumatized...)..."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Let's speak clear:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["If you want to build an O.S.", "do the following and start TODAY!"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Define if you want to write a SHELL or if you want to write a CORE O.S."], "childNum": 0, "tag": "p", "senID": 7, "childList": []}, {"text": ["Plan main functions of the O.S., processes, etc."], "childNum": 0, "tag": "p", "senID": 8, "childList": []}, {"text": ["Choose the level you want to build it on:"], "childNum": 0, "tag": "p", "senID": 9, "childList": []}]}, {"text": ["Because of the time required for you to build it I must assume you are delivering a College work to earn credits... and yet in case you work for a Corporation or in case you are self employed or your own C.E.O., you must have resources assigned to this project...", "I will assume you are building it for a Academic's!."], "childNum": 0, "tag": "p", "senID": 10, "childList": []}, {"text": ["Imagine you are writing a shell, that will ease the start-up of your work, and while you are writing the shell your mind should be drawing the real core of it, along with the addressing and along with the lowest level routines..."], "childNum": 0, "tag": "p", "senID": 11, "childList": []}, {"text": ["I think you may know MS(R)-DOS(R).", "The version 3.3 is one of the easiest and enriching (pedagogically speaking) Operating Systems ever designed and published by Microsoft(r) Corp.", "Please, be creative, DO NOT CLONE IT, just inspire your mind on it, and then build something your Professor or end-consumer will admire and enjoy!."], "childNum": 0, "tag": "p", "senID": 12, "childList": []}, {"text": ["Do not forget we are in the age of Graphical User's Interface, so do not go into texting, although ASCII is still the most beautiful expression of computer age, you can play with both interfaces."], "childNum": 0, "tag": "p", "senID": 13, "childList": []}, {"text": ["Once you work this from Top to Dowm you will find out how easy it is to build routines in High Level language, and once you build it, and debug it, may be you will speed up a CORE os.", "that is: Bootstrapping, Memory management, etcetera... "], "childNum": 0, "tag": "p", "senID": 14, "childList": []}, {"text": ["Do not get to involved in dealing with interruptions or you may end up loosing you enthusiasm INMEDIATELY!...", "leave the UNDERGROUND O.S.", "to deal and take care of the interruptions."], "childNum": 0, "tag": "p", "senID": 15, "childList": []}, {"text": ["In less than three months you will have your first prototype, and then you need to make it work good (To Debug it, I mean!).", "Exceed yourself!."], "childNum": 0, "tag": "p", "senID": 16, "childList": []}, {"text": ["If you work SOLO, you will need to write a manual, IT TAKES CONSIDERABLY PRECIOUS TIME YOU DO NOT WANT TO LOOSE... My advice (please, do not laugh, I used this technique and it made today's Magnate's earn BILLIONS) WRITE DOWN IN PAPER, HANDWRITTEN, ALL OF THE DOCUMENTATION (THIS IS BECAUSE YOUR FINE MOTRICE COORDINATION IS FASSST!", "AND EVEN IT WILL NOT EQUAL THE SPEED OF YOUR THOUGHTS IT IS A HARD COPY TO DELIVER TO A WELL PAID ASSISTANT TO TYPE IT INTO A COMPUTER AND EDIT IT MARVELOUS -MAYBE A .PDF WITH ILLUSTRATIONS, ALONG WITH A VIDEO WILL SHARPEN AND DELIGHT THE EYES OF THE END-CONSUMER!."], "childNum": 0, "tag": "p", "senID": 17, "childList": []}, {"text": ["Remember, the build up of the first month must be actually a SHELL of the basic functions a BASIC operating system must deliver to the user:"], "childNum": 0, "tag": "p", "senID": 18, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "Commands Processor;", "tag": "none", "senID": 19}, {"text": "File Directory listup;", "tag": "none", "senID": 20}, {"text": "Create/Edit and Delete files;", "tag": "none", "senID": 21}, {"text": "Create/Edit and Delete Directories;", "tag": "none", "senID": 22}, {"text": "Accessing drive units (floppies, Compact Discs, HardDrives, Flash Drives, etc...);", "tag": "none", "senID": 23}, {"text": "Update and Display of information through the screen!;", "tag": "none", "senID": 24}]}, {"text": ["I would focus mainly in the previous, and then ANYTHING else comes up easily through the creation of enriching routines (trust me this phase is addictive and you will have NO MORE life when you reach to this poit for you will be married to this project and you will never leave it anymore), do not fear, it wil work!."], "childNum": 0, "tag": "p", "senID": 25, "childList": []}, {"text": ["Present your Operating System, and if your expecting upcomming funds show up, or if your expecting grade gets the higher rated you expect, you may want to keep enlarging your project and then build it into a more solid, robust and steady application!."], "childNum": 0, "tag": "p", "senID": 26, "childList": []}, {"text": ["Just imagine yourself using this platform as a plaintiff for any kind of hardware you may want to work with: ROBOTS, AUTOS; AIRPLANES; REMOTE CONTROL; ETC..."], "childNum": 0, "tag": "p", "senID": 27, "childList": []}, {"text": ["I know you will enjoy this assignment and I know you will entertain yourself greatly!", "Only a real programmer has this kind of ambitions!"], "childNum": 0, "tag": "p", "senID": 28, "childList": []}, {"text": ["God bless America!"], "childNum": 0, "tag": "p", "senID": 29, "childList": []}, {"text": ["KnowBuddy"], "childNum": 0, "tag": "p", "senID": 30, "childList": []}]]