[[{"text": ["It's hard to think of kinds of general applications where Python would be unsuitable, but there are several kinds where, like just about all higher-level languages akin to it, it might be considered a peculiar and probably inferior choice."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "applications", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["In \"hard real time\" applications, all dynamic memory allocation and freeing, and especially garbage collection, are quite understandably frowned upon; this rules out almost all modern languages (including Python, but also Java, C#, etc, etc), since almost all of them rely on dynamic memory handling and garbage collection of some kind or other."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "especially", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["If you're programming for an \"embedded device\" which you expect to be produced and sold in huge numbers, every bit of ROM may add measurably to the overall costs, so you want a language focused on squeezing the application down to the last possible bit -- any language that relies on a rich supporting runtime environment or operating system (including Python, and, again, also Java, C#, etc, etc) would no doubt force you to spend extra on many more bits of ROM (consider threaded-interpretive languages like good old Forth: they can make a substantial application's code be measurably more compact than straightforward machine code would!", ")."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["There many be other niches that share similar constraints (mostly focused on MEMORY: focus on using as few bits as possible and/or strictly confining execution within precisely predefined limits -- no dynamism, no allocation, no garbage collection, etc, etc), and basically the case would once again incline in similar ways (for example, there are server applications, intended to run on myriads of servers, which can save many megabytes per server if coded in C++ [especially if without \"allegedly-smart\" pointers;-)] rather than Java, Python, C#, and so on)."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Of course there are excellent reasons most modern languages (Python, Java, C#, etc) choose to do dynamic memory allocation, garbage collection, and so forth, despite the importance of application niches where those techniques are a negative aspect: essentially, if you can possibly afford such nice memory handling, writing applications becomes MUCH, MUCH easier, and a whole class of problems and bugs connected with the need to carefully manage memory if you lack such support can go away -- programmer productivity really soars...", "IF garbage collection and the like can be afforded at all, that is.", "For example, if an application was going to run on a few hundreds or thousands of servers, I probably wouldn't bother coding it in C++ with manual memory management in order to save memory; it's only at tens and hundreds of thousands of servers, that the economics of all those extra megabytes really kicks in."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Note that, despite the common misconception that \"interpreted languages\" (ones with a rich underlying runtime or VM, like Java, C#, Python, etc) \"are slow\", in fact for most CPU-intensive applications (such as scientific computation), Python is perfectly suitable, as long as the \"rich supporting runtime environment\" (e.g.", "numpy) is factored in.", "So, that is not really a factor -- though memory consumption and garbage collection CAN be, in some niches."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "numpy", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}], [{"tag": "ul", "num": 2, "lis": [{"text": ["http://www.python.org/about/apps/"], "childNum": 0, "tag": "a", "senID": 0, "childList": []}, {"text": ["http://wiki.python.org/moin/Applications"], "childNum": 0, "tag": "a", "senID": 1, "childList": []}]}, {"text": ["Recap: "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 6, "lis": [{"text": "Web Applications ( Django, Pylons ) ", "tag": "none", "senID": 3}, {"text": "Games ( Eve Online - MMORPG )", "tag": "none", "senID": 4}, {"text": "Software Development ( Trac for Project Management )", "tag": "none", "senID": 5}, {"text": "Object Databases ( ZODB / Durus )", "tag": "none", "senID": 6}, {"text": "Network Programming ( Bittorent )", "tag": "none", "senID": 7}, {"text": "Mobile applications", "tag": "none", "senID": 8}]}, {"text": ["And far more..."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}], [{"text": ["You say:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I think the distinction between \"scripting languages\" and \"programming languages\" is quite arbitrary.", "Nearly every language developed in the last 10-20 years has some kind of runtime support, usually in the form of a bytecode interpreter or virtual machine.", "Python is no different: it gets compiled to bytecode and the bytecode is executed by the Python runtime.", "The point is, I would say there are very few things you can do in Java, C#, Ruby, etc., that you couldn't do in Python."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "couldn't", "childNum": 0, "tag": "strong", "pos": 3, "childList": []}]}, {"text": ["That said, however, different languages have different strengths.", "So there are certainly some kinds of programs that would be better suited to being written in Python.", "It really depends on what you want the programming language to do for you, and what you want to do yourself.", "The right answer depends on what kinds of problems you're interested in solving."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Well, the short answer is, since you mentioned Perl, anything you could build in Perl you could build in Python.", "You can build anything in any language, and if the language has easy C bindings, you could even do it efficiently.  "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Now, this being the case, the question becomes somewhat philosophical.", "Python has as a key tenet \"There should only be one way to do it\".", "Perl is exactly the opposite.", "The key tenet of Perl is \"There Is More Than One Way To Do It\" (TIMTOWTDI) or ( Tim Toady, to his frineds ;) )   How do you like to do things?", "One clear and shining path, agreed upon by most?", "Or perhaps you value the almost infinite number of solution paths that any task has in Perl? "], "childNum": 3, "tag": "p", "senID": 1, "childList": [{"text": "There should only be one way to do it", "childNum": 0, "tag": "em", "pos": 1, "childList": []}, {"text": "There Is More Than One Way To Do It", "childNum": 0, "tag": "em", "pos": 3, "childList": []}, {"text": "you", "childNum": 0, "tag": "em", "pos": 5, "childList": []}]}, {"text": ["So, assuming that your task is I/O bound ( like most things ) rather than CPU bound ( real time programming or games , or nipple crinkling number crunching ) then Python would be suitable.", "Whether its philosophy suits you is the key question."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "you", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Most of the 3d packages these days, such as Maya, SoftImage, Houdini, RealFlow, Blender, etc.", "all use Python as an embedded scripting and plugin language."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["It's computer programming language, and as such any computer program could theoretically could be built with it.", "See here for an example"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "here for an example", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.google.co.nz/search?hl=en&rlz=1C1GGLS%5FenNZ329NZ329&q=python+large+scale+applications&btnG=Search&meta="}]}], [{"text": ["Bittorrent was built on Python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]