[[{"text": ["Your examples are good, but, understandably, they're all text-focused -- I fear that some kinds might lose attention because of that.", "The Sande's Hello World book uses EasyGui (as well as Python of course) to make things graphical and colorful in the easiest possible way, and it's aimed to young kids (even younger than your target: their son, for whom they developed the book, is in elementary school)."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Hello World", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.manning.com/sande/"}, {"href": "http://www.ferg.org/easygui/", "text": "EasyGui", "childNum": 0, "tag": "a", "childList": []}]}, {"text": ["I highly recommend you look at it -- and more importantly so does my wife Anna, who knows more about teaching programming to beginners &amp;c than just about anybody else I know.", "Anna recommends finding out what their interests are and how to work them into some project, so their motivation is strong -- \"don't make the teacher happy, make the students happy!", "\" (and I quote her directly) so they'll continue programming because they've seen how it can make their lives better."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "their", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}], [{"text": ["Your examples sound reasonable.", "I would also suggest having the kids work through selected parts of the Python tutorial, which will simultaneously teach them about programming in general and Python programming in particular.", "Some of the easier Project Euler problems might also be worthwhile."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Python tutorial", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://docs.python.org/tutorial/"}, {"text": "Project Euler", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://projecteuler.net/"}]}], [{"text": ["Have you looked at PyGame?", "Once you've got the basic introductory stuff out of the way, I don't think it'll be beyond the abilities of a bunch of teenagers to knock up a fairly cool arcade-style game in PyGame."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PyGame", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pygame.org"}]}], [{"text": ["Jotto is a good game to program.", "I recently coded it in Ruby for a PL class.", "Take a look at the example problems from SICP, too.", "They're in Scheme, but could give you ideas."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Jotto", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Jotto"}, {"text": "the example problems from SICP, too.", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://mitpress.mit.edu/sicp/psets/index.html"}]}], [{"text": ["If you want to show them some graphics, there are libraries out there, such as PyGame, that might make it easier and a little flashier."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "PyGame", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://www.pygame.org"}]}, {"text": ["You could also try a card game, such as blackjack, which isn't too bad."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["And don't forget, the students don't have to write everything.", "You can provide a foundation which they build on top of or start a project and let them finish it.", "In one of my first computer science courses in school, our teacher assigned us to do a project where a user navigates a 3d maze.", "He provided us all the graphics and high level stuff, but we were responsible for the logic of the game (such as the array of spaces on the map).", "We learned the basics this way, but it was a lot more entertaining than just a guess the number game."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Give them puzzles that are competitive in nature.. a lot of people learn really fast when trying to outdo their peers.", "You could give them starter code for a tic-tac-toe game and ask them to build a computer player for it.. which would then compete against other people's computer players."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "", "childNum": 0, "tag": "br", "pos": 0, "childList": []}]}], [{"text": ["I prefer actual casino games because they're a hair more complex.", "And they teach an important lesson about the house always winning."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "always", "childNum": 0, "tag": "em", "pos": 1, "childList": []}]}, {"text": ["Roulette, for example, allows easy simulation of the wheel with selection from numbered bins.", "It has easy decision-making (did the bet win or lose?", ") and easy math (payout at 2:1, etc."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Further, you can dive into the various kinds of bets (hi-lo, even-odd, red-black) each of which requires slightly different if-statements.", "The column bets require using the % operator and understanding modulus arithmetic (well, a little). "], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "%", "childNum": 0, "tag": "code", "pos": 1, "childList": []}]}, {"text": ["You can -- for the really advanced students -- move on to combination bets of 2, 3 or 4 \"adjacent\" numbers.", "(2 is easy, except at the edges.", "3 is a 'row' of 3.", "4 is challenging."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Craps, as another example, is stateful, leading to interesting state change rules and rules on which bets are allowed and not allowed."], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["Blackjack may be a bit hard, because modeling cards, decks and the dealer shoe can be rather complex to simulate realistic deals from a subset of the available cards in the shoe."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["See http://homepage.mac.com/s_lott/books/oodesign.html for specific programming exercises."], "childNum": 1, "tag": "p", "senID": 6, "childList": [{"text": "http://homepage.mac.com/s_lott/books/oodesign.html", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://homepage.mac.com/s_lott/books/oodesign.html"}]}], [{"text": ["Maybe you can find something in the old Computer Recreations column from Scientific American.", "I had lots of fun with some of the projects when I was in school.", "They cover many exciting and timeless topics from computer science and science in general (cellular automata, fractals, genetic algorithms,...).", "They also give enough hints to make the implementation relatively straight forward for novice programmers, but at the same time there is lots of potential for extensions and generalisations."], "childNum": 2, "tag": "p", "senID": 0, "childList": [{"text": "Computer Recreations", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}, {"text": "Scientific American", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["Unfortunately I was not able to find any good links, but maybe you can find them at a library or with some more searching (I think they published two digest books)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["http://projecteuler.net/"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "http://projecteuler.net/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://projecteuler.net/"}]}, {"text": ["Good site for challenges.", "Might not guide you much within your own language but could help."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]