[[{"text": ["I think Cog does what you want."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Cog", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://nedbatchelder.com/code/cog/"}]}], [{"text": ["I recall that in previous versions of VS, there was a way to add custom build steps to the build process.", "I used that a lot to do exactly the kind of automated code generation you describe."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I imagine the custom build step feature is still there in 2008."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I don't understand what you are trying to do here.", "Are you trying to execute a Python script that generates a C# file and then compile that with the project?", "Or are you trying to compile a Python script to C#?"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["OK, I see.", "Well, as far as I know there isn't any code generator for Python.", "There is a good introduction on how to roll your own here."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "here", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.drewnoakes.com/snippets/WritingACustomCodeGeneratorToolForVisualStudio/"}]}, {"text": ["Actually, that's quite an under-used part of the environment, I suppose it's so because it needs you to use the IDE to compile the project, as it'd seem only the IDE knows about these \"generators\", but MSBuild ignores them."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I dug through my old bookmarks (I love Del.icio.us!", ") and found this article: Code Generation with Python, Cog, and Nant.", "Keep in mind that anything you can do in NAnt can probably be done in MSBuild as well.", "This should be enough to get you started."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Code Generation with Python, Cog, and Nant", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://blogs.acceleration.net/ryan/articles/577.aspx"}]}], [{"text": ["Yes, they are of course, but I'd still like to have a custom generator, as this would automatically be invoked if I changed the Python file, and thus regenerating the code in question."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]