[[{"text": ["From your position, the best way to learn would be trying to make something that you've always wanted to make, but didn't make it before."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["I wouldn't worry much about learning CSS/Javascript.", "You can learn those as need-to-know basis while working on your project.", "Modern javascript frameworks like jQuery make client side coding really simple."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["Make a project for yourself, try something that is not in the book.", "This will give you some real life experience, let you make yours the concepts you've learned, stumble on real-life problems.", "Books are good to begin with, but you've got to jump in at some point."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["You could also play with tools that use Python/Django.", "For example, Google's AppEngine lets you use Python and Django."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["The best kind of learning is learning by doing.", "Try to start your project.", "If possible, choose a small part to deploy first just to keep you motivated.", "If you get stuck somewhere:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["\"Perhaps it would be better to start my own project right away, and learn by practice\""], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "\"Perhaps it would be better to start my own project right away, and learn by practice\"", "childNum": 0, "tag": "strong", "pos": 0, "childList": []}]}, {"text": ["This is what you are already doing.", "It's what you are doing right now."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "are", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}, {"text": ["\"It worked fine but the code was a total mess."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "\"It worked fine but the code was a total mess.\"", "childNum": 0, "tag": "strong", "pos": -1, "childList": []}]}, {"text": ["This is the results of doing what you are already doing."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}, {"text": ["Why would this change?", "Any reason why continuing to do what you are doing will lead to better results?", "Any reason at all?"], "childNum": 0, "tag": "p", "senID": 4, "childList": []}, {"text": ["If you don't like the results you're getting, you have to change what you are doing.", "You cannot continue attempting to \"learn by practice\".", "If your code is a total mess, then you aren't learning the things you think you need to learn."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["So stop this \"learn by practice\" and do something different.  "], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"text": ["You'll need to start reading (and understanding) existing well-written code as well as reading books. "], "childNum": 0, "tag": "p", "senID": 7, "childList": []}], [{"text": ["Learning by practice is essential.", "You won’t know how to write an application until you’ve written a few badly."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["But learning by reading is also essential.", "Once you’ve made the mistakes, knowledge from others will show you ways to avoid those mistakes."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["If you’re writing Django apps, you need to have a good understanding of Python on its own.", "Django is written in Python, and was intended to embody its authors’ interpretation of Python’s principles."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": ["Learning Python by Mark Lutz is a great, comprehensive guide to the language itself."], "childNum": 1, "tag": "p", "senID": 3, "childList": [{"text": "Learning Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://oreilly.com/catalog/9781565924642"}]}, {"text": ["Make sure you finish Dive Into Python as well, that’s great too.", "(There is Dive into Python 3 for the next version of Python, but I don’t think Django has a migration path to Python 3 mapped out yet, so it’s probably best to stick with Python 2 for now."], "childNum": 1, "tag": "p", "senID": 4, "childList": [{"text": "Dive Into Python", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://diveintopython.org/"}]}, {"text": ["Code Complete (2nd Edition) is a great, comprehensive and language-independent guide to better programming."], "childNum": 1, "tag": "p", "senID": 5, "childList": [{"text": "Code Complete (2nd Edition)", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://cc2e.com/"}]}]}], [{"text": ["For your question, How to learn to program, the Truth, I have found is as follows,"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Use git, branch, try new stuff, don't worry about screwing up.", "In fact, screw it up.", "Get stuff to work.", "Understand that you code is bad, read up on how to do that better, browse through github to find patterns to do that.", "For Django, Read James, Uswaretech, Ericholsher, Very own SO, Alex Gaynor and the entire community, and refactor your code in a different branch.", "Also make it reusable and put it up on Github.", "Repeat."], "childNum": 6, "tag": "p", "senID": 1, "childList": [{"text": "James", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://b-list.org/"}, {"text": "Uswaretech", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://uswaretech.com/blog"}, {"text": "Ericholsher", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://ericholscher.com/blog/"}, {"text": "Very own SO", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/tagged/django"}, {"text": "Alex Gaynor", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://lazypython.blogspot.com/"}, {"text": "entire community", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.djangoproject.com/community/"}]}], [{"text": ["I think that you've read a lot of very interesting stuff and now it's time to start your own path.", "Feel free to ask on SO when you have a question"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["There are a few ways to be able to write clean code:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Dive Into Python is a great start for learning python, although you can get pretty far in django without knowing much python."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["After you've read http://djangobook.com/ and went through the original tutorial there isn't more left for you to do outside of working on your own project and learning as you come up with new things."], "childNum": 1, "tag": "p", "senID": 1, "childList": [{"text": "http://djangobook.com/", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://djangobook.com/"}]}, {"text": ["I think most people learn faster when they are enjoying what they are working on and its hard to really be emotionally invested in small tutorial applications."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["I suggest you just get hacking on your project and come here to ask questions on problems that arise while you are coding :)"], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["Have a look at one of the library modules (python's difflib.py is nice, I don't know any good django modules but the sessions module looks promising) and try to figure out how they tick."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Look at the tests (and write a couple of additional tests yourself), draw up the architecture, see how the sessions module is used by Django, and maybe add some new functionality if you can. "], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["No one has mentioned the Python Tutorial by Guido.", "It's a pretty good overview of the language features (but maybe too complex for those new to programming).", "I would suggest that it is a mandatory read for those working with Python."], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "Python Tutorial by Guido", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://docs.python.org/tutorial/"}]}], [{"text": ["I think that the most important thing to hold to during a learning process is \"to stick to the plan\" what ever happens.", "Choose simple introductory materials to Python, then to Django and stick to them until you finish them.", "Start right after that with your project.", "You'll learn a lot by applying your basic knowledge to your project because at some point you'll have to search for complementary knowledge, the official documentations for both Python and Django are here to fill the gaps."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Resources:"], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Good luck."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Django for e-commerce is not very useful for e-commerce, learning how to use Satchmo will be more rewardful i think.", "It contains good programmation patterns, but, again, you will better understand them if you go through errors yourself trying to do it..."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}]]