[[{"text": ["Several reasons:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "faster development loop, ", "tag": "none", "senID": 1}, {"text": "easier to arrange for dynamic behavior (reflection, metaprogramming)", "tag": "none", "senID": 2}, {"text": "makes the whole system portable (just recompile the underlying C code and you are good to go on a new platform)", "tag": "none", "senID": 3}]}, {"text": ["Think of what would happen if the system was not interpreted.", "Say you used translation-to-C as the mechanism.", "The compiled code would periodically have to check if it had been superseded by metaprogramming.", "A similar situation arises with eval()-type functions.", "In those cases, it would have to run the compiler again, an outrageously slow process, or it would have to also have the interpreter around at run-time anyway. "], "childNum": 3, "tag": "p", "senID": 4, "childList": [{"text": "not", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "eval()", "childNum": 0, "tag": "code", "pos": 3, "childList": []}, {"text": "also", "childNum": 0, "tag": "em", "pos": 4, "childList": []}]}, {"text": ["The only alternative here is a JIT compiler.", "These systems are highly complex and sophisticated and have even bigger run-time footprints than all the other alternatives.", "They start up very slowly, making them impractical for scripting.", "Ever seen a Java script?", "I haven't."], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"text": ["So, you have two choices:"], "childNum": 0, "tag": "p", "senID": 6, "childList": []}, {"tag": "ul", "num": 2, "lis": [{"text": "all the disadvantages of both a compiler and an interpreter", "tag": "none", "senID": 7}, {"text": "just the disadvantages of an interpreter", "tag": "none", "senID": 8}]}, {"text": ["It's not surprising that generally the primary implementation just goes with the second choice.", "It's quite possible that some day we may see secondary implementations like compilers appearing.", "Ruby 1.9 and Python have bytecode VM's; those are &frac12;-way there.", "A compiler might target just non-dynamic code, or it might have various levels of language support declarable as options.", "But since such a thing can't be the primary implementation, it represents a lot of work for a very marginal benefit.", "Ruby already has 200,000 lines of C in it..."], "childNum": 0, "tag": "p", "senID": 9, "childList": []}, {"text": ["I suppose I should add that one can always add a compiled C (or, with some effort, any other language) extension.", "So, say you have a slow numerical operation.", "If you add, say Array#newOp with a C implementation then you get the speedup, the program stays in Ruby (or whatever) and your environment gets a new instance method.", "Everybody wins!", "So this reduces the need for a problematic secondary implementation."], "childNum": 1, "tag": "p", "senID": 10, "childList": [{"text": "Array#newOp", "childNum": 0, "tag": "code", "pos": 2, "childList": []}]}], [{"text": ["Exactly like (in the typical implementation of) Java or C#, Python gets first compiled into some form of bytecode, depending on the implementation (CPython uses a specialized form of its own, Jython uses JVM just like a typical Java, IronPython uses CLR just like a typical C#, and so forth) -- that bytecode then gets further processed for execution by a virtual machine (AKA interpreter), which may also generate machine code \"just in time\" -- known as JIT -- if and when warranted (CLR and JVM implementations often do, CPython's own virtual machine typically doesn't but can be made to do so e.g.", "with psyco or Unladen Swallow)."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["JIT may pay for itself for sufficiently long-running programs (if memory's way cheaper than CPU cycles), but it may not (due to slower startup times and larger memory footprint), especially when the types also have to be inferred or specialized as part of the code generation.", "Generating machine code without type inference or specialization is easy if that's what you want, e.g.", "freeze does it for you, but it really doesn't present the advantages that \"machine code fetishists\" attribute to it.", "E.g., you get an executable binary of 1.5 to 2 MB in lieu of a tiny \"hello world\" .pyc -- not much point!-).", "That executable is stand-alone and distributable as such, but it will only work on a very specific narrow range of operating systems and CPU architectures, so the tradeoffs are quite iffy in most cases.", "And, the time it takes to prepare the executable is quite long indeed, so it would be a crazy choice to make that mode of operation the default one."], "childNum": 2, "tag": "p", "senID": 1, "childList": [{"text": "freeze", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://wiki.python.org/moin/Freeze"}, {"text": ".pyc", "childNum": 0, "tag": "code", "pos": 3, "childList": []}]}], [{"text": ["Merely replacing an interpreter with a compiler won't give you as big a performance boost as you might think for a language like Python.", "When most time is actually spend doing symbolic lookups of object members in dictionaries, it doesn't really matter if the call to the function performing such lookup is interpreted, or is native machine code - the difference, while not quite negligible, will be dwarfed by lookup overhead."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["To really improve performance, you need optimizing compilers.", "And optimization techniques here are very different from what you have with C++, or even Java JIT - an optimizing compiler for a dynamically typed / duck typed language such as Python needs to do some very creative type inference (including probabilistic - i.e.", "\"90% chance of it being T\" and then generating efficient machine code for that case with a check/branch before it) and escape analysis.", "This is hard."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}], [{"text": ["I think the biggest reason for the languages being interpreted is portability.", "As a programmer you can write code that will run in an interpreter not a specific OS.", "So your programs behave more uniformly across platforms (more so than compiled languages).", "Another advantage I can think of is it's easier to have a dynamic type system in an interpreted language.", "I think the creators of the language were thinking having a language where programmers can be more productive due to automatic memory management, dynamic type system and meta programming wins over any performance loss due to the language being interpreted.", "If you are concerned about performance you can always compile the language to native machine code employing a technique like JIT compilation."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["Today, there is no longer a strong distinction between \"compiled\" and \"interpreted\" languages.", "Python is in fact compiled just as much as Java is, the only differences are:"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"tag": "ul", "num": 3, "lis": [{"text": "The Python compiler is much faster than the Java compiler", "tag": "none", "senID": 1}, {"text": "Python automatically compiles source code as it is executed, there is no separate \"compile\" step required", "tag": "none", "senID": 2}, {"text": "Python bytecode is different from JVM bytecode", "tag": "none", "senID": 3}]}, {"text": ["Python even has a function called compile() which is an interface to the compiler."], "childNum": 2, "tag": "p", "senID": 4, "childList": [{"text": "compile()", "tag": "a", "pos": 0, "childList": [{"text": "compile()", "tag": "code"}], "childNum": 1, "href": "http://docs.python.org/library/functions.html#compile"}, {"text": "compile()", "childNum": 0, "tag": "code", "childList": []}]}, {"text": ["It sounds like the distinction you are making is between \"dynamically typed\" and \"statically typed\" languages.", "In dynamic languages such as Python, you can write code like:"], "childNum": 0, "tag": "p", "senID": 5, "childList": []}, {"code": "<pre>\n<code>\n def fn(x, y):\n    return x.foo(y)\n</code>\n</pre>\n", "senID": 6}, {"text": ["Notice that the types of x and y are not specified.", "At runtime, this function will look at x to see whether it has a member function named foo, and if so will call it with y.", "If not, it will throw a runtime error that indicates no such function was found.", "This sort of runtime lookup is much easier to represent using an intermediate representation like bytecode, where a runtime VM does the lookup instead of having to generate machine code to do the lookup itself (or, call a function to do the lookup which is what the bytecode will do anyway)."], "childNum": 5, "tag": "p", "senID": 7, "childList": [{"text": "x", "childNum": 0, "tag": "code", "pos": 0, "childList": []}, {"text": "y", "childNum": 0, "tag": "code", "pos": 1, "childList": []}, {"text": "x", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "foo", "childNum": 0, "tag": "code", "pos": -1, "childList": []}, {"text": "y", "childNum": 0, "tag": "code", "pos": 3, "childList": []}]}, {"text": ["Python has projects such as Psyco, PyPy, and Unladen Swallow that take various approaches to compiling Python object code into something closer to native code.", "There is active research in this area but there is not (as yet) a simple answer."], "childNum": 3, "tag": "p", "senID": 8, "childList": [{"text": "Psyco", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://psyco.sourceforge.net/"}, {"text": "PyPy", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://codespeak.net/pypy/dist/pypy/doc/"}, {"text": "Unladen Swallow", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://code.google.com/p/unladen-swallow/"}]}], [{"text": ["The effort required to create a good compiler to generate native code for a new language is staggering.", "Small research groups typically take 5 to 10 years (examples: SML/NJ, Haskell, Clean, Cecil, lcc, Objective Caml, MLton, and many others).", "And when the language in question requires type checking and other decisions to be made at run time, a compiler writer has to work much harder to get good native-code performance (for an excellent example, see work by Craig Chambers and later Urs Hoelzle on Self).", "The performance gains you might hope for are harder to realize than you might think.", "This phenomenon partly explains why so many dynamically typed languages are interpreted."], "childNum": 7, "tag": "p", "senID": 0, "childList": [{"text": "staggering", "childNum": 0, "tag": "em", "pos": 0, "childList": []}, {"text": "SML/NJ", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.smlnj.org/"}, {"text": "lcc", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://www.cs.princeton.edu/software/lcc/"}, {"text": "Objective Caml", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://caml.inria.fr/"}, {"text": "MLton", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://mlton.org/"}, {"text": "The performance gains you might hope for are harder to realize than you might think.", "childNum": 0, "tag": "strong", "pos": 3, "childList": []}, {"text": "why so many dynamically typed languages are interpreted", "tag": "a", "pos": 4, "childList": [], "childNum": 0, "href": "http://stackoverflow.com/questions/376611/why-interpreted-langs-are-mostly-ducktyped-while-compiled-have-strong-typing/376828#376828"}]}, {"text": ["As noted, a decent interpreter is also instantly portable, while porting compilers to new machine architectures takes substantial effort (and is a problem I personally have been working on for over 20 years, with some time off for good behavior).", "So an interpreter is a way to reach a wide audience quickly."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Finally, although fast compilers and slow interpreters exist, it's usually easer to make the edit-translate-go cycle faster by using an interpreter.", "(For some nice examples of fast compilers see the aforementioned lcc as well as Ken Thompson's go compiler.", "For an example of a relatively slow interpreter see GHCi."], "childNum": 3, "tag": "p", "senID": 2, "childList": [{"text": "lcc", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.cs.princeton.edu/software/lcc/"}, {"text": "go", "tag": "a", "pos": -1, "childList": [], "childNum": 0, "href": "http://golang.org/"}, {"text": "GHCi", "tag": "a", "pos": 2, "childList": [], "childNum": 0, "href": "http://www.haskell.org/ghc/"}]}], [{"text": ["Well, isn't one of the strengths of these languages that they are so easily scriptable?", "They wouldn't be if they were compiled.", "And on the other hand, dynamic languages are easier to intereprete than to compile."], "childNum": 0, "tag": "p", "senID": 0, "childList": []}], [{"text": ["In a compiled language, the loop you get into when making software is"], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Interpreted languages tend to be faster to make stuff in because you get to cut out step two of that process (and when you're dealing with a large system where compile times can be upwards of two minutes, step two can add a significant amount of time)."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["This isn't necessarily the reason python|ruby designers thought of, but keep in mind that \"How efficiently does the machine run this?", "\" is only half the software development problem."], "childNum": 0, "tag": "p", "senID": 2, "childList": []}, {"text": ["It also seems like it would be easier to compile code in a language that's interpreted naturally than it would be to add an interpreter to a language that's compiled by default."], "childNum": 0, "tag": "p", "senID": 3, "childList": []}], [{"text": ["REPL.", "Don't knock it 'till you've tried it.", ":)"], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "REPL", "tag": "a", "pos": 0, "childList": [], "childNum": 0, "href": "http://en.wikipedia.org/wiki/Read-eval-print%5Floop"}]}], [{"text": ["By design. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["The authors wanted something where they can write scripts into."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["Python gets compiled the first time it is executed though "], "childNum": 0, "tag": "p", "senID": 2, "childList": []}], [{"text": ["Compiling Ruby at least is notoriously hard.", "I'm working on one, and as part of that I wrote a blog post enumerating some of the issues here. "], "childNum": 1, "tag": "p", "senID": 0, "childList": [{"text": "enumerating some of the issues here", "tag": "a", "pos": 1, "childList": [], "childNum": 0, "href": "http://www.hokstad.com/the-problem-with-compiling-ruby.html"}]}, {"text": ["Specifically, Ruby is suffering from a very unclear (i.e.", "non-existent) boundary between the \"read\" and \"execute\" phase of the program that makes it hard to compile efficiently.", "You could just emulate what the interpreter does, but then you're not going to see much speed up, so it wouldn't be worth the effort.", "If you want to compile it efficiently you then face a lot of additional complications to handle the extreme level of dynamism in Ruby."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}, {"text": ["The good news is that there are techniques for overcoming this.", "Self, Smalltalk and Lisp/Scheme's have dealt quite successfully with most of the same issues.", "But it takes time to sift through it and figure out how to make it work with Ruby.", "It also doesn't help that Ruby has a very convoluted grammar."], "childNum": 1, "tag": "p", "senID": 2, "childList": [{"text": "are", "childNum": 0, "tag": "em", "pos": 0, "childList": []}]}], [{"text": ["Raw compute performance is probably not a goal of most interpreted languages.", "Interpreted languages are typically more concerned about programmer productivity than raw speed.", "In most cases these languages are plenty fast enough for the tasks the languages were designed to tackle. "], "childNum": 0, "tag": "p", "senID": 0, "childList": []}, {"text": ["Given that, and that just about the only advantages of a compiler are type checking (difficult to do in a dynamic language) and speed, there's not much incentive to write compilers for most interpreted languages."], "childNum": 0, "tag": "p", "senID": 1, "childList": []}]]